{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h3: \"h3\",\n    br: \"br\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Let’s talk about how one would put their autoimmune disease into remission. Of course, we can’t say cure, but we can say remission. It’s called spontaneous remission. I’ve done a lot of articles on autoimmune diseases, but I recently found some fascinating new information I want to share with you. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Because if you have an autoimmune disease and you want to put in remission, you need all the data, need to know this one very important fact. There’s been some recent research finding a huge link between this virus, the Epstein-Barr virus, and many of the autoimmune diseases. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, here’s the thing. You might say, well, this doesn’t apply to me. Well, guess what? 90% of the population has had the Epstein Barr virus. But here’s the thing, the unique thing about the Epstein Barr virus that’s different from a lot of other viruses. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It can go in the remission, and it can also come out of remission. In other words, it goes in this dormancy state where it just kind of sits there and waits for the right environment. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"See, normally, when your immune system is exposed to a virus, your immune system fights it off. It develops antibodies, and now it has an immunity against that virus. But the Epstein-Barr virus is different. \"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Top autoimmune disease triggers:\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"• Gut radiation \", _jsx(_components.br, {}), \"\\n\", \"• EBV \", _jsx(_components.br, {}), \"\\n\", \"• Stress\", _jsx(_components.br, {}), \"\\n\", \"• Low vitamin D \", _jsx(_components.br, {}), \"\\n\", \"• Low zinc \", _jsx(_components.br, {}), \"\\n\", \"• Dysbiosis\", _jsx(_components.br, {}), \"\\n\", \"• Drugs \", _jsx(_components.br, {}), \"\\n\", \"• GMO foods \", _jsx(_components.br, {}), \"\\n\", \"• Stress of pregnancy \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Epstein-Bar virus has this ability to infect certain immune cells and actually reprogram them and alter their function. You see, normally, really, our own proteins that can turn on or turn off certain genes. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But with this Epstein-Bar virus, it can actually bypass that and alter our genes, unfortunately. So it makes this protein, which can bind and control your genes and actually trigger autoimmune diseases. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If the right environment occurs. Let me explain what I mean by that. When we’re talking about autoimmune diseases, there’s a certain immune cell called the Th-17 that’s always involved in autoimmune diseases. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And without trying to get into the details of that, all you need to know is that this cell can either protect you against autoimmune diseases or creating situations where it can cause an autoimmune disease, with how it deals with inflammation and whether it protects you or harms you. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It really depends on the environment of that T cell, the environment which is really related to your epigenetics. So this explains why some people develop autoimmune diseases and some people don’t even know they’re exposed to the Epstein-Barr virus. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Like I said before, 90% of the population has been exposed to the Epstein-Barr virus. It is one of the most common viruses that we’re exposed to. So we are going to talk about how to create an environment to bulletproof yourself and keep these autoimmune diseases in remission. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s called the kissing disease. Therefore probably many people get it in high school. It can create what’s called infectious mononucleosis, which affects your lymph nodes, your throat, fever. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It can be really nasty. I had it in high school, of course, after kissing someone, and it was just devastating. It literally couldn’t breathe. And I think it lasted for two weeks, and it was terrible. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But it’s not highly contagious. But it does spread through saliva, blood, semen, and it’s also a herpes virus for and, like I said before, it can stay dormant for years and never come out of remission. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Or it can come out of remission when you have this perfect storm, which I want to discuss right now. So the reason why certain people get it and other people don’t, it really has to do with their own integrity, their resistance to fight this thing off, how strong their immune system is and then how great the external stress is as well. \"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"A natural treatment plan for autoimmune diseases:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"1. Put EBV in remission:\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"• Lower your stress \", _jsx(_components.br, {}), \"\\n\", \"• Increase your vitamin B1 \", _jsx(_components.br, {}), \"\\n\", \"• Increase your potassium and magnesium \", _jsx(_components.br, {}), \"\\n\", \"• Increase your vitamin D \", _jsx(_components.br, {}), \"\\n\", \"• Increase your zinc \", _jsx(_components.br, {}), \"\\n\", \"• Do aerobic exercise\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"2. Handle dysbiosis by taking probiotics (start with small amounts) and consuming fermented vegetables\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"3. Do a 48-hour fast every two weeks\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"4. Lower your inflammation:\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"• Do fasting \", _jsx(_components.br, {}), \"\\n\", \"• Take vitamin D\", _jsx(_components.br, {}), \"\\n\", \"• Get plenty of omega-3 fatty acids \", _jsx(_components.br, {}), \"\\n\", \"• Do the keto diet \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The stress has a lot to do with the triggering effect because the high level of cortisol can paralyze the immune system. One of the biggest stresses out of all the stresses is bereavement, which is a loss. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And you’re grieving after a major loss. So the greater the loss, the more the stress, the more it can trigger an autoimmune disease. And I’ve talked about this in other articles. In fact, it’s like one for one by patients.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They develop an autoimmune disease after a stress event. We also have another interesting thing that can happen gut radiation. So let’s say you had radiation of your abdomen or a Cat scan can alter your microbiome and create Dysbiosis and set you up for an autoimmune disease. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Let’s say, for example, you had an antibiotic. It can create Dysbiosis and that can also be a trigger. Or let’s say you consume a lot of foods with glyphosate, like in GMO foods that can alter your gut microbiome and then set you up for having this autoimmune disease, especially if you had Epstein-Barr virus in the past. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And also nutritional factors, let’s say your low in vitamin and then D or zinc. And then you go through a stress event, right? You’re going to be very vulnerable to developing one of these conditions. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are also certain drugs, there are also steroids, there’s even the stress of pregnancy that can set you up for an autoimmune disease. What’s interesting and unique about a pregnancy is that there are certain autoimmune diseases that go in remission once you’re pregnant, and then when you’re done being pregnant, then they can come out. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But there are certain autoimmune diseases that can be triggered by pregnancy as well. Now, there also are other triggers that I can’t really mention in this video, but I have mentioned them indirectly in other videos, which I’ll put a link down below that can set you up for this perfect storm to develop an autoimmune disease. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But let’s just dive into what to do to put this autoimmune disease into remission permanently. So here’s the plan. We don’t want to just focus on inflammation and the autoimmune disease. We want to focus on this Epstein-Bar virus.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Because this is new information and if we assume that it evolves, then we have a different strategy and we can focus in on something that can actually greatly help you. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So we want to put this Epstein-Barr virus back into remission. And one of the best ways to do it is to, of course, drop your stress level as much as possible, isolate exactly what’s really stressing you out, and do whatever you can to minimize that stress, at least lower it. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There is a test called an HRV test (Heart Rate variability test). HeartMath is an app in a device that you can get to measure heart rate variability. And the reason I like this test is it measures the parasympathetic nervous system and the sympathetic nervous system. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’ll give you data about this information and tell you how much parasympathetic you have, which is your recovery, versus how much sympathetic, which is your stress.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And it’s very interesting because some people might not even feel that they’re in sympathetic dominant, but they were. And they have basically no parasympathetic and they’re more at risk for having their immune system lowered to pull virus. So this is a good test to just give you feedback to know where you’re at. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, some other things to help lower the stress and to put this Epstein Bar virus back into where it needs to belong is vitamin B1. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A good amount of B1 is very, very important. Potassium and magnesium, vital and vitamin D. And in high doses, at least 40,000 IU, that’s going to take inflammation away, and it’s also going to help put this Epstein-Barr virus back in remission. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you also add a good amount of zinc, I would take no less than 50 milligrams of zinc every day. So these are the two most important things to take. Aerobic exercise versus other types of exercise. Aerobic exercise gives you a lot of oxygen. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It helps lower cortisol, which will put more control in your immune system. So long walks, a bike ride that is not too intense, very, very important.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All right,number two is, handle Dysbiosis. So the gut very, very key, since 80% of your immune system is in your gut. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So you need to start taking Probiotics as well as fermented vegetables. But if you’re going to take Probiotics, start small, because if you have Dysbiosis, you can create an immune reaction. So if you’re taking in a liquid form, take a very small amount in a teaspoon. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you’re taking in a capsule, take half of a capsule. Because I made a mistake when I had a lot of problems with gut issues to take the regular amount and I ended up with a major detox.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Number three, you should do a 48 hours fast every two weeks on a regular basis. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you did that for two to three months. That alone will help not just to lower inflammation, which is going to do, but also to strengthen greatly your immune system, which is exactly what we need to do to put this thing back in remission. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It can only really come out if there’s a weakness.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Number four, decrease inflammation through fasting vitamin D, as well as omega-3 fatty acids and also getting off carbs. So do the ketogenic diet. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ketones are natural anti-inflammatory compounds.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And last, number five, for those of you that have stuck around this long, which you’re smart, because this one’s a very important one, PMGs. Now, what is a PMG (proto-morphogen)? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What’s a proto-morphogen? Well, there’s a company. I’m not affiliated with them anymore, but Standard Process is a nutritional company that sells what’s called PMGs. And they have different nutritional products that have glandular extracts, like overtrophin PMG. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They have them for the thyroid; they have them for the lung tissue. They have them for the liver tissue. So they have PMG products for pretty much every tissue that’s in your body. And what’s interesting about these PMG is that it’s a dehydrated DNA of an animal. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And even though it’s from a different species, you can still use this as a strategy. And this is how it works. Let’s say you had, for example, Hashimoto’s, that’s of your thyroid gland. You have antibodies that are attacking your own thyroid gland. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You would take their product for the thyroid because it has the PMGs in it, and you would take one before bed. And what’s going to happen when you take it before bed? It’s going to go into the stomach, and the antibodies are going to attack that decoy. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And leave your thyroid alone. And then the next night, you would do it again. Next night you would do it again. And you do that for about three months. So whatever type of autoimmune disease you have, whether MS, which is in the brain, which is neurotrophin PMG, or you have type one diabetes, which is antibody against your own pancreas, in that case, you would take pancretrophin PMG. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So this is the little X factor, the additional strategy that you can also try. And you’ll have to do your own research to find out where you can buy these PMGs. I think you can pretty much get all of them online right now or find a practitioner that uses standard process products in your area. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, another really good article for you to see, especially because we’re talking about viruses, is my article on zinc. Check it out. I put it right here.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"How to Reverse Your Autoimmune Disease in natural way","metaDesc":"The Epstein-Bar virus has been linked to many autoimmune diseases, and 90% of the population has had it. It can go into remission and come out of remission depending on the right environment. It has the ability to infect certain immune cells and alter their genes, which can trigger autoimmune diseases if the right environment occurs. The Th-17 immune cell is involved in autoimmune diseases and can either protect or cause them. 90% of the population has been exposed to the Epstein-Barr virus, and it can create infectious mononucleosis, which affects lymph nodes, throat, and fever.\n\nIt is not highly contagious, but it does spread through saliva, blood, semen, and can stay dormant for years and never come out of remission. The reason why certain people get it and other people don't is due to their own integrity, their resistance to the virus.","tags":["auto immune disease","health"],"slug":"how-to-reverse-your-autoimmune-disease-in-natural-way","readTime":10,"img":"https://www.innovativehealthclinic.com/wp-content/uploads/2018/12/autoimmune-banner-image-for-blog-5c09476d480c4-2048x1072.jpg","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}