{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Can orgasms improve your pelvic floor muscle strength?\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’m sharing the results of this great new study that just came out looking at how orgasms can improve your pelvic floor.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So for those of you who don’t know, many women after having childbirth, because of the weight of the uterus, pushing the baby out from the vaginal canal can cause weakness in the pelvic floor. This weakness in the pelvic floor can lead to issues like urinary incontinence, which can be quite bothersome.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"How to improve pelvic floor strength?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, in order to improve pelvic floor strength, there currently are two options. One is to undergo pelvic floor muscle training under the supervision of a pelvic floor physical therapist. They work with you on learning how to do Kegel correctly and other exercises that can help strengthen your pelvic floor. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Kegels \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, this is expensive and time consuming and not readily accessible to all patients.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So very often patients are counseled on doing Kegel. Kegel are exercises which can help strengthen the pelvic floor.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Essentially, there are a few different ways of describing it. One is like squeezing your vagina up and in without squeezing your abdomen or your butt and doing this and then relaxing. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The other way, sometimes people describe it is how when you’re urinating and you try to stop the stream of urinating that’s actually recruiting those pelvic floor muscles.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And lastly, I’ve also heard it described as trying to hold in a fart. However, during orgasm, the pelvic floor involuntarily contracts, meaning that you don’t have to do anything after the orgasm, your pelvic floor will contract in these sort of rhythmic contractions. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so the hypothesis of the study was that doing Kegel exercises in addition to having regular orgasms may be better than doing Kegels alone.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So they recruited 55 women who were in the postpartum period, and they had them either randomized to do kegels every day at home and they were encouraged to have orgasms either by themselves or with a partner twice a week.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They then followed up these women for six months and saw them each month. And at each month they measured their pelvic floor strength as well as their sexual function and any evidence of incontinence or pain with intercourse. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Benefits of Kegels + Orgasm\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What they found was that women who did the kegels as well as had orgasms regularly, were having stronger pelvic floor muscles, having more ability to relax those muscles normally, as well as better sexual function than the women who just did kegels alone. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So this is really awesome. I wish that every woman who delivered a baby had access to postpartum pelvic floor muscle training, because I think a lot of issues that women face after delivering babies would be improved if they actually saw a pelvic floor physical therapist. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Kegel exercises at home\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, as I mentioned before, not everyone has the means or access to see a pelvic floor physical therapist. And so being able to do something at home like kegel exercises, as well as just having regular orgasms, as I mentioned before, has so many benefits, including better sleep, better mood, better self-esteem, and overall just general well being. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So not to say that everyone needs to in the calendar have two orgasms a week, but if they can during a postpartum period when you have a newborn at home, that’s a great option to help strengthen those pelvic floor muscles. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, for those of you men who are reading, make sure you share this article with the women in your lives. And for the women.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Orgasms Could Be Better Than Kegel Exercises, According to Science","metaDesc":"Kegel exercises are often given to new moms to help them strengthen the muscles in their pelvic floor after giving birth. However, a study suggests that orgasms may work even better.\n\nTo improve pelvic floor strength after giving birth there currently are two options: \n• undergo pelvic floor muscle training under the supervision of a pelvic floor physical therapist.\n• other exercises that can help strengthen your pelvic floor\n\nThe researchers asked a group of women who had just given birth to their child to have sex or masturbate, as well as do regular Kegel exercises. In the meantime, another group was asked to do only Kegel exercises.\nThey found that the women who orgasmed had stronger pelvic floor muscles and better sex lives than those who just did Kegels.\nThe pelvic floor hurts during pregnancy because it has to stretch to make room for the growing baby. Over time, the extra weight makes the muscles weaker, leading to urinary incontinence, pelvic organ prolapse, and less sexual satisfaction for many women.\nTo help avoid this, new mothers are often told to do exercises that strengthen the muscles on the floor of their pelvis. But if women started sexually induced orgasms and Kegel exercises soon after giving birth, it could improve their quality of life.\nLet me make one thing clear: There's nothing wrong with you or your body if you don't have orgasms from sex alone (or simply have trouble with it).\nBut here's the good news: It's not impossible. And you're on the right track—experimenting with your body during solo sessions, doubling up on foreplay, and pulling in some extra help from toys are all great steps, and all things I recommend to everyone. It certainly helps to have a partner who's more than willing to put in the effort too!\n","tags":["Kegel exercices"],"slug":"orgasms-could-be-better-than-kegel-exercises-according-to-science","readTime":3,"img":"https://images.pexels.com/photos/4056723/pexels-photo-4056723.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}