{"pageProps":{"career":[{"id":24,"attributes":{"title":"Building Your Coding Portfolio: Projects for College Students and Beginners","slug":"building-your-coding-portfolio-projects-for-college-students-and-beginners","img":"https://images.pexels.com/photos/4348395/pexels-photo-4348395.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"If you are a college student or just starting out in coding, it is important to build a strong coding portfolio to showcase your skills and stand out to potential employers.\nIn this article, we will discuss some projects that you can work on to build your coding portfolio. These projects range from basic documentation projects to more complex full-stack and AI projects.","tags":["coding"],"readTime":3,"dataSources":null,"createdAt":"2023-04-20T20:49:56.866Z","updatedAt":"2023-04-20T20:49:58.193Z","publishedAt":"2023-04-20T20:49:58.191Z","category":{"data":{"id":6,"attributes":{"title":"Career","slug":"career","createdAt":"2023-03-22T21:26:35.063Z","updatedAt":"2023-03-22T21:27:47.418Z","publishedAt":"2023-03-22T21:27:47.416Z","img":"https://images.pexels.com/photos/601170/pexels-photo-601170.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"}}},"author":{"data":{"id":5,"attributes":{"username":"Ethan","email":"ethan@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-03-29T20:06:15.902Z","updatedAt":"2023-03-29T21:46:01.460Z"}}},"body":{"id":306,"content":"<p data-pm-slice=\"0 0 []\">If you are a college student or just starting out in coding, it is important to build a strong coding portfolio to showcase your skills and stand out to potential employers.</p><p>&nbsp;</p><h2>In this article, we will discuss some projects that you can work on to build your coding portfolio. These projects range from basic documentation projects to more complex full-stack and AI projects.</h2><p>&nbsp;</p><ol><li><p>Simple README</p><p>Project The first project that we recommend is a simple README project. The purpose of this project is to help you understand how to make your first contribution or push your code to GitHub. This project can be as simple as a list of compiled algorithmic resources or as complex as a guide to a particular library. The only thing you need to know here is Markdown, and there are many resources available to help you learn it. By completing this project, you will become familiar with Git, GitHub, and open-source contributions.</p><p>&nbsp;</p></li><li><p>Blog Project</p><p>The second project that we recommend is a blog project. This project will help you create a static website using a framework like Jekyll. This website will not have any backend and will be very simple to write. You can create a blog with different sections such as GSOC blog section, technical blog section, or personal blog section. In this project, you can write about your interests, projects, experiences, and any other topic that you would like to share with the world.</p><p>&nbsp;</p></li><li><p>Full Stack Application Project</p><p>The third project that we recommend is a full-stack application project. In this project, you will create a website with dynamic content that allows users to sign up, create an account, and do some things on the website. This project can be a notetaking application, a social media platform, or a shopping website. The main goal of this project is to showcase your ability to build a full-stack web application. You will need to use technologies such as HTML, CSS, JavaScript, React, Node.js, Express, and MongoDB.</p><p>&nbsp;</p></li><li><p>Game Project</p><p>The fourth project that we recommend is a game project. In this project, you will create a simple game using a game engine such as Unity or Phaser. This project can be a puzzle game, an arcade game, or a simulation game. The main goal of this project is to showcase your ability to build a game from scratch. You will need to use skills such as game design, game programming, and game art.</p><p>&nbsp;</p></li><li><p>Cloud-Based Project</p><p>The fifth project that we recommend is a cloud-based project. In this project, you will create an application that runs on the cloud. This project can be a web application, a mobile application, or a desktop application. The main goal of this project is to showcase your ability to use cloud technologies such as AWS, Google Cloud, or Microsoft Azure. You will need to use skills such as cloud computing, cloud storage, and cloud security.</p><p>&nbsp;</p></li><li><p>AI Project</p><p>The sixth project that we recommend is an AI project. In this project, you will create an application that uses artificial intelligence to solve a particular problem. This project can be a chatbot, a recommendation system, or a computer vision system. The main goal of this project is to showcase your ability to use AI technologies such as machine learning, deep learning, or natural language processing. You will need to use skills such as data preprocessing, model training, and model deployment.</p><p>&nbsp;</p></li><li><p>Web3 project</p><p>Finally, if you’re feeling adventurous, you can try your hand at a Web Three project. Web Three, also known as the decentralized web, is the next iteration of the internet that is more secure, private, and censorship-resistant.</p></li></ol><p>Some popular platforms to build Web Three projects include Ethereum, IPFS, and Solidity. You can try building a decentralized application (dApp) or a smart contract on one of these platforms.</p><p>&nbsp;</p><p>While this might be a more advanced project, it’s definitely worth exploring if you’re interested in the future of the internet and blockchain technology. And who knows, you might just create the next big thing in the decentralized world.</p>"}}}]},"__N_SSG":true}