{"pageProps":{"career":[{"id":14,"attributes":{"title":"Overcoming Adversity: My Journey from Mechanical Engineering to Programming","slug":"overcoming-adversity-my-journey-from-mechanical-engineering-to-programming","img":"https://images.pexels.com/photos/1181345/pexels-photo-1181345.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Life is like a jigsaw puzzle, where every piece has its place and its own importance. But, sometimes, we are not able to find the right piece, and it feels like we are trying to put a square block in a round hole. This is what happened to me when I was pursuing mechanical engineering. Growing up in a remote village in India, I did not have access to modern technology and the internet. I was cut off from the rest of the world, and this made me feel like I was missing out on things. But little did I know, my childhood was preparing me for something else, something big.","tags":["my journey"],"readTime":4,"dataSources":null,"createdAt":"2023-04-20T19:40:52.395Z","updatedAt":"2023-04-20T19:40:53.621Z","publishedAt":"2023-04-20T19:40:53.619Z","category":{"data":{"id":6,"attributes":{"title":"Career","slug":"career","createdAt":"2023-03-22T21:26:35.063Z","updatedAt":"2023-03-22T21:27:47.418Z","publishedAt":"2023-03-22T21:27:47.416Z","img":"https://images.pexels.com/photos/601170/pexels-photo-601170.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"}}},"author":{"data":{"id":2,"attributes":{"username":"Anupam singh","email":"anupam@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-03-24T18:24:29.424Z","updatedAt":"2023-03-29T21:45:30.990Z"}}},"body":{"id":296,"content":"<p data-pm-slice=\"0 0 []\"><strong>Life is like a jigsaw puzzle</strong>, where every piece has its place and its own importance. But, sometimes, we are not able to find the right piece, and it feels like we are trying to put a square block in a round hole. This is what happened to me when I was pursuing mechanical engineering. Growing up in a remote village in India, I did not have access to modern technology and the internet. I was cut off from the rest of the world, and this made me feel like I was missing out on things. But little did I know, my childhood was preparing me for something else, something big.</p><p>&nbsp;</p><p><strong>In this blog post, I will take you through my journey from being a mechanical engineer to becoming a successful programmer at Google.</strong> I will share how I overcame adversity and found my way to success. I hope this will inspire you to never give up on your dreams, no matter how hard things may seem.</p><p>&nbsp;</p><p><strong>Growing up,</strong> I did not have access to a TV, computer or the internet. I was largely cut off from the rest of the world, which made me feel like I was missing out on things. I used to resent my childhood, thinking that if only I had modern technology and better education growing up, I could have done much better with my life. However, what I did not realize was that all the time that I spent not playing video games and not surfing the internet would pay off big time in ways that I could not have even imagined.</p><p>&nbsp;</p><p><strong>When I graduated from college as a mechanical engineer,</strong> I applied to hundreds of jobs that I was not even interested in, and I got only one company to interview me. On the phone call, the recruiter rejected me. I felt like there was no way for me to go back, and I had wasted six years of my life studying mechanical engineering.</p><p>&nbsp;</p><p><strong>But that’s when I found a side door of programming.</strong> I spent every waking hour for the next few months learning programming, and I got my first job within six months. That job led me to my first big break in Amazon, and my time at Amazon helped me get my current job at Google. Within three or four years, I was able to turn my life around.</p><p>&nbsp;</p><p><strong>If you’re in a similar situation,</strong> I want you to know that your professional career is going to be 30 to 35 years long, and two or three bad years in your 20s would not have much effect in the grand scheme of things. The most important thing is to keep working hard and never give up on your dreams.</p><p>&nbsp;</p><p><strong>One of the biggest lessons</strong> that I learned is that the universe doesn’t care about your dreams. If you want something in life, go get it. And the best way to get what you want is to deserve it. You can sit there and complain all you want about people not giving you a chance because you didn’t go to a great college or because of your GPA. That’s never going to help your case. Understand the rules of the game, stay within those rules, and keep working hard. And as Mahatma Gandhi famously said, “First they ignore you, then they laugh at you, then they fight you, and then you win.”</p><p>&nbsp;</p><p><strong>Another lesson that I learned</strong> is that fear is your biggest enemy. When you think about fear, the moments that come to mind are the ones where your heart is racing fast, you feel like you’re about to die, and you feel like you’re in a life or death situation. But in reality, fear is just an emotion. It’s just a feeling. And the only way to overcome it is by facing it head-on. When you face your fears, you become stronger, more resilient, and more confident. You can take steps to overcome it. One way is to break down the task into smaller, manageable steps and focus on each step at a time. Another way is to visualize yourself successfully completing the task and imagine how you will feel when it’s done.</p><p>&nbsp;</p><p><strong>In addition to fear,</strong> another obstacle that can hold us back is self-doubt. It’s easy to doubt ourselves, especially when we face setbacks or failures. But it’s important to remember that failure is not the end of the road, but rather an opportunity to learn and grow. Instead of letting self-doubt hold you back, use it as motivation to work harder and improve.</p><p>&nbsp;</p><p><strong>Finally,</strong> it’s important to surround yourself with supportive people who believe in you and your dreams. These people can provide encouragement, advice, and a listening ear when you need it most.</p><p>&nbsp;</p><p><strong>In conclusion,</strong> life is a journey with many twists and turns, but it’s up to us to make the most of it. Don’t let your past or your fears hold you back from pursuing your dreams. Instead, embrace the challenges and keep moving forward, one step at a time. With hard work, determination, and a positive attitude, anything is possible.</p>"}}}]},"__N_SSG":true}