{"pageProps":{"article":[{"id":11,"attributes":{"title":"I went VEGAN For 30 Days | Here's How My Body Reacted...","slug":"i-went-vegan-for-30-days-here-s-how-my-body-reacted","createdAt":"2023-02-03T04:11:22.897Z","updatedAt":"2023-02-04T23:30:13.831Z","publishedAt":"2023-02-03T04:11:25.351Z","img":"https://images.pexels.com/photos/1351238/pexels-photo-1351238.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself.  \nFive things I Learned to be vegan for 30 days ...\nIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. One, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan. \nTwo, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that. \n\nThree, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet. \nFour, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual. \nFive, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible. \n\nIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\n\nMy advice to you .....\nIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you. In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process. \nAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy. ","tags":["health","lifestyle"],"readTime":10,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":11,"content":"<p>Four weeks of going vegan are in the books and I’m so happy I met my goal.&nbsp;</p><p>Just to clarify, there are many reasons people follow a vegan diet, moral, ethical, environmental. But the information I’m going to cover here is only what’s related to nutrition and health.&nbsp;</p><p>&nbsp;</p><h2>Is&nbsp;vegan&nbsp;Diet&nbsp;healty?&nbsp;</h2><p>&nbsp;</p><p>A vegan diet can be a very healthy diet, whether you’re young, old, somewhere in between, pregnant, nonpregnant breastfeeding, not breastfeeding. &nbsp;</p><p>&nbsp;</p><p>Basically, it’s applicable to all life stages. The reason I put that word can in there you can follow a vegan diet, eat vegan burgers with sugary sodas, with gummy&nbsp;candies, still be vegan. And that’s not really healthy, right? &nbsp;</p><p>&nbsp;</p><p>And I have to say it’s not the only healthy diet out there. Some of the loudest voices in the vegan community are quick to say that veganism is the only healthy option. That’s not the case. There are several other healthy diets out there.&nbsp;</p><p>&nbsp;</p><p>For example, the Mediterranean diet that I’m personally a fan of that are just as healthy, if not healthier than the vegan diet. &nbsp;</p><p>&nbsp;</p><h3>What I tell my patients?</h3><p>I have to be honest and admit that I rarely recommend veganism as my 1st option. I know that it’s a restrictive diet, and we know restrictive diets have high failure rates. Plus, the benefits of a vegan diet aren’t that much better than some of the other alternatives that are simpler to follow.&nbsp;</p><p>&nbsp;</p><p>When I recommend a diet, I’m trying to create&nbsp;the healthiest diet, but also one that’s feasible for my patients to face without disrupting their lives. On the other hand, if one of my patients comes in and wants to follow a vegan diet, I’m totally in support of that.&nbsp;</p><p>&nbsp;</p><p>I just have to make sure that they’re adequately planning their meals, they’re supplementing when need be, checking their blood tests, and ideally, having some guidance either for myself or a nutritionist.&nbsp;</p><p>&nbsp;</p><h3>What the research says?</h3><p>The research behind health benefits of following a vegan diet is substantial and high quality. If you’re following the standard American diet and then switch over to a vegan diet, you’re going to see an improvement in chronic diseases like diabetes, heart disease, strokes, even an extension of life in some cases.&nbsp;</p><p>&nbsp;</p><p>And what’s most interesting is when we add some animal products into the mix, those outcomes still hold true. That’s why what I recommend to my patients is a plant focused diet, meaning that they should get the majority of their calories from plants, fruits, vegetables, legumes, nuts, seeds, healthy fats, and a moderate amount of poultry and fish with a minimal amount of red meat.&nbsp;</p><p>&nbsp;</p><p>In fact, that’s the diet I follow and recommend to my family. The field of nutrition research is ever changing. And as we get more information, more quality studies, we doctors and nutritionists alike, are going to give better recommendations when it comes to a vegan diet, a plant focused diet, all of this is susceptible to change.&nbsp;</p><p>&nbsp;</p><p>But it’s important that we make the best decisions with the knowledge that we have on hand. The one thing that I can say with 100% certainty is there’s no such thing as a miracle diet for everybody. &nbsp;</p><p>&nbsp;</p><h3>Challenge begins ...</h3><p>&nbsp;</p><p>On day one, I was excited.I was like, if I could tackle keto, I can definitely do vegan. First point at which I had a little bit of hesitation was when I ordered my first at home delivery. Buffalo cauliflower bites with some kind of not real mayo.&nbsp;</p><p>&nbsp;</p><p>And this is. A wrap with vegan cheese and unchicken. I was having second thoughts, and that’s not like me. If I set a goal for myself, I’m going to do everything in my power to meet that goal. But for some reason, when sticking to this vegan diet, I was concerned about so many things.&nbsp;</p><p>&nbsp;</p><p>The following week, I was leaving for MIT for the leadership conference. I was worried if they’re going to have vegan options available for me. I was then traveling to Miami for a few days. All these worries started bubbling in my head and I was really wondering, can I stick to vegan this entire month?&nbsp;</p><p>&nbsp;</p><h3>My obstacles</h3><p>One of the first obstacles I ran into on the vegan diet was. Under eating calories. Now, I’m partially to blame here because I didn’t prep well.&nbsp;</p><p>&nbsp;</p><p>And even at the writing&nbsp;of this article, I said the healthy way to follow a vegan diet is to adequately plan your meals. For the first two weeks, I have to be honest; I didn’t have much of an appetite.&nbsp;</p><p>&nbsp;</p><p>I’m not a huge fan of just eating vegetables and rice and beans, so I didn’t have tremendous portions. And because of that, I was calorie deficient. I actually noticed some weight loss helped me tremendously to make up this calorie deficit is eating some of these snacks that Thrive sent over.&nbsp;If I didn’t have these snacks, I’d be under eating calories the majority of the time.</p><p>&nbsp;</p><h3>This Can’t be good...</h3><p>One of the biggest problems I ran into this is really embarrassing to say in the article. From day one until the last day of the diet, I was having tremendous gas and bloating.&nbsp;</p><p>&nbsp;</p><p>It’s so embarrassing to say. I mean, think about this. I fly on planes; I interact with patients for long periods of time. I sit at conferences. I can’t just be sitting there flatulent. I did try to isolate some ingredients to see which ones were causing this gas and bloating combination for me, but I couldn’t find out what it was.&nbsp;</p><p>&nbsp;</p><p>I normally eat brown rice. I normally eat vegetables and fruits and beans. I expect them to go away after four weeks, but no, they stuck around. I would have to say that the vegan diet probably won’t work for me long term.&nbsp;I just can’t sit there with my stomach going and me wanting to pass gas the entire time. God, that’s embarrassing.</p><p>&nbsp;</p><h3>&nbsp;A&nbsp;pleasant&nbsp;surprise</h3><p>What I didn’t know about veganism is that there are a ton of up-and-coming options for those who aren’t used to eating vegan.&nbsp;There are specialty restaurants that just offer vegan foods with no animal products that remind you of foods that you may have eaten when you ate animal products. And I thought that was really cool. On top of that, a lot of these restaurants and even some of the products I got from Thrive tasted delicious because of the sauces.&nbsp;Vegan sauces are on point.</p><p>&nbsp;</p><h3>I can’t even ...</h3><p>I’ve talked about on this channel of decision fatigue because you’re constantly making decisions and you’re using your willpower.&nbsp;It’s actually a finite resource. What I noticed while I was following the vegan diet was that I lost the drive to go to the gym. My work ethic actually suffered because I was putting such a strong emphasis on sticking to vegan when there were so many temptations and there were things I wanted to eat.&nbsp;</p><p>&nbsp;</p><p>I didn’t want to hop on my spin bike in my bedroom. I didn’t want to go to the gym with my friends. This is really unlike me, and it’s an obstacle I didn’t actually expect to face when I went to the gym.&nbsp;I lifted fine. Getting to the gym was the actual struggle.</p><p>&nbsp;</p><h3>I fail [Or Not]....</h3><p>At the time, I least expected it. Disaster struck. I got sick. I started coughing. I got a sore throat. I got a low grade fever. I went to see the doctor.&nbsp;</p><p>&nbsp;</p><p>I weighed the pros and cons of starting antibiotics, of stopping the vegan diet. I decided to stick with conservative treatment and treat it like a viral illness. One of my favorite hacks to treat viral illnesses.&nbsp;</p><p>&nbsp;</p><p>Actually, the symptoms of the viral illnesses are green tea with manuka honey. Patrol members, be advised. Apparently, honey is not vegan. What? I guess honey is an animal product, but, man; I didn’t force the bees to make the honey.&nbsp;</p><p>&nbsp;</p><p>They make it on their own. We didn’t have to milk them for it. Wait. If you want to disqualify my four-week vegan challenge because I ate honey, so be it.</p><p>&nbsp;</p><h3>Please don’t hate me …</h3><p>I got to say, at this point, I was rolling.&nbsp;I was starting getting into the vegan vibe. I was trying out new restaurants. I was sampling all the delicious foods that I got from Thrive, and I was excited. I was getting close to the finish line.&nbsp;</p><p>&nbsp;</p><p>But I will say, one of the hardest things with the vegan diet is peer pressure. I mean, when I went out to eat with my friends, they were annoyed, to say the least, that we had to choose the restaurant.&nbsp;Based on my eating preferences, I did a decent job at trying to pick out vegan options in not so vegan places.</p><p>&nbsp;</p><h3>In retrospect …</h3><p>Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself. &nbsp;</p><p>&nbsp;</p><h3>Five things I Learned to be vegan for 30 days ...</h3><p>In fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. <strong>One</strong>, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>Two</strong>, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that.&nbsp;</p><p>&nbsp;</p><p><strong>Three</strong>, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet.&nbsp;</p><p>&nbsp;</p><p><strong>Four</strong>, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual.&nbsp;</p><p>&nbsp;</p><p><strong>Five</strong>, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible.&nbsp;</p><p>&nbsp;</p><p>If you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.</p><p>&nbsp;</p><h3>My advice to you .....</h3><p>If you’re curious or interested in starting a vegan diet, I don’t want to dissuade you.&nbsp;In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process.&nbsp;</p><p>&nbsp;</p><p>And please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy.&nbsp;</p>"}}}]},"__N_SSG":true}