{"pageProps":{"lifestyle":[{"id":7,"attributes":{"title":"Giving up These Three Things Could be the Key to Becoming a Millionaire","slug":"why-giving-up-these-three-things-could-be-the-key-to-becoming-a-millionaire","img":"https://images.pexels.com/photos/5647612/pexels-photo-5647612.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"You watch every single productivity YouTube video, your “For You” page on TikTok is filled with motivational David Goggins videos and you have read every single self-help book and you can do all of these things. \nBut at the end of the day, it means jack shit. Unless you unshackle yourself, everything you do is futile, all of it. It’s pointless. Because, yes, you may take one step forward, but you just take two steps back. \nUnless you let go of these three things that I’m going to reveal in this article, you can wave goodbye to ever seeing a million dollars sat in your bank account. Because life is all about offense and defense. ","tags":["financial goal"],"readTime":14,"createdAt":"2023-04-20T18:23:18.151Z","updatedAt":"2023-04-20T18:23:19.383Z","publishedAt":"2023-04-20T18:23:19.382Z","category":{"data":{"id":8,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-03-28T21:53:38.227Z","updatedAt":"2023-03-28T21:59:45.856Z","publishedAt":"2023-03-28T21:53:43.328Z","img":"https://images.pexels.com/photos/1034940/pexels-photo-1034940.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"}}},"author":{"data":{"id":9,"attributes":{"username":"Caleb","email":"caleb@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-03-29T20:08:43.081Z","updatedAt":"2023-03-29T21:45:51.177Z"}}},"body":{"id":282,"content":"<p data-pm-slice=\"0 0 []\">You watch every single productivity YouTube video, your “For You”&nbsp;page on TikTok is filled with motivational David Goggins videos and you have read every single self-help book and you can do all of these things.&nbsp;</p><p>&nbsp;</p><p>But at the end of the day, it means jack shit. Unless you unshackle yourself, everything you do is futile,&nbsp;all of it. It’s pointless. Because, yes, you may take one step forward, but you just take two steps back.&nbsp;</p><p>&nbsp;</p><p>Unless you let go of these three things that I’m going to reveal in this article, you can wave goodbye to ever seeing a million dollars sat in your bank account. Because life is all about offense and defense.&nbsp;</p><p>&nbsp;</p><p>Just look at Floyd Mayweather. I mean, he became the highest paid athlete in terms of actual career earnings from the sport by mastering the art of defense. Or just look at Warren Buffett. His number one rule of investing is don’t lose money.&nbsp;</p><p>&nbsp;</p><p>So the reason I’m saying that is that when you give up these three things, your defense is stronger, you make yourself stronger. And what that means is you have to do less fancy things. You have to be less smart, less talented, less hardworking.&nbsp;Because if you give up these three things, you’re already at such a massive advantage.</p><p>&nbsp;</p><p>Now, one little caveat that I do want to make is that once you reach a certain level of success, you can actually indulge in the things I’m about to mention, except for point number three, that I’ll reveal in just a second.&nbsp;</p><p>&nbsp;</p><p>So the first thing you need to give up if you want to become rich is drinking. Now, before you click away and you think, ah, these are very obvious points, listen, most of success is very obvious, but yet you still don’t do it.&nbsp;</p><p>&nbsp;</p><p>So it’s not about hearing unique ideas. It’s about hearing the ideas you’ve always heard, but having someone that you trust explains it to you in a logical manner. You need to understand that drinking is literally the devil.&nbsp;It puts a cloud over your mind. It ruins your sleep. It leads to bad decisions, as well as very illogical and sometimes very emotional decisions.</p><p>&nbsp;</p><p>Quite simply, you need to understand that if you drink and someone else doesn’t, they have a competitive advantage. They will destroy you in the marketplace.&nbsp;</p><p>&nbsp;</p><p>So, ladies and gentlemen, until you see a million in the bank. And by the way, if that’s your goal, because for some of you, your goal is to make 3000-4,000$ a month, live in Thailand, have a very happy, chill, relaxed life, and if that’s what you want, that is beautiful, that’s incredible, and go for it.&nbsp;</p><p>&nbsp;</p><p>I’m speaking specifically to the people who want to become millionaires, multimillionaires, retire, their parents, give back to the community, do all of these things. Until you see a million dollars in your bank account, don’t drink.&nbsp;Give up drinking.</p><p>&nbsp;</p><p>Because, listen, if you are a male under the age of 30, what is more important in your 20s than having a strong body and having strong finances? You need to understand the things you do in your 20s in terms of your physique, your strength, your agility, your speed, your capability, as well as what you do from a financial and income perspective that will set you up for the rest of your life.&nbsp;</p><p>&nbsp;</p><p>If you get to the end of your 20s with a solid foundation in those two things, it is really, and I mean really hard to fuck up the rest of your life, because you’ve built such strong roots and you’ve given yourself such an advantage as well as the right habit stack to carry through for the rest of your life.&nbsp;</p><p>&nbsp;</p><p>Quite frankly, if you get the ship right in your 20s, you basically play easy mode for the rest of your life. So, as I said, until you see a million in your bank account, just stop drinking. What’s the point?&nbsp;</p><p>&nbsp;</p><p>Especially if you are in your 20s, because you need to focus on strong body and strong finances and drinking alcohol, well, of course there is the financial side of it actually costs a lot of money. And then, more importantly, there is the cognitive side of it.&nbsp;</p><p>&nbsp;</p><p>And by the way, I pretty much followed this path to tea. I don’t think I’ve ever told this story on an article, but it was New Year’s 2017. So some of you guys know my story, some of you guys don’t.&nbsp;</p><p>&nbsp;</p><p>Without getting too into detail, I had a very difficult upbringing in my younger years,&nbsp;from the age of 14 to 16. I dabbled in alcohol, drugs, pretty much tried everything while also being into reading books and going to the gym.&nbsp;It was a very weird childhood.</p><p>&nbsp;</p><p>But I remember on New Year’s 2017, I wake up at 02:00 p.m.. I go downstairs. My mom is in the kitchen. She was like, Where were you last night? Because it was New Year’s.&nbsp;</p><p>&nbsp;</p><p>I didn’t even say Happy New Year to her. And as I was about to explain myself, I turn around and I throw up everywhere in the sink. I turn back and my mom has just stood there crying. And she’s like, I don’t even know who you are anymore.&nbsp;</p><p>&nbsp;</p><p>And it’s funny, from that moment, maybe except for&nbsp;two or three times&nbsp;for the next two years, I did not drink. And over the next two years, I made my first million dollars. And because I didn’t drink, going clubbing was not that appealing to me.&nbsp;</p><p>&nbsp;</p><p>Partying was not that appealing to me. I basically just stayed at home, locked in, and worked on my business. And that is when I went from having one client in my business on the morning of 2017 when I looked at my mom’s face, and she was just disgusted by me all the way to two years later making 70000 to 80,000 month’s profit from my business.&nbsp;</p><p>&nbsp;</p><p>By the way, you can ignore these big numbers of $80,000 and $70,000 and stuff like that. I know for some of you guys, you just want to make your 1st, 3000, 5000, maybe even $10,000 a month from your business.&nbsp;</p><p>&nbsp;</p><p>So I’m not going to touch too much on that in this article&nbsp;if you want to see that. I recently wrote&nbsp;one of my most popular articles. You guys went crazy about it. It’s a full breakdown of how you get rich in your 20s, step by step.&nbsp;</p><p>&nbsp;</p><p>So, point number one, give up drinking. Now, the one thing I will say is you get to a certain stage in life where you should drink.&nbsp;</p><p>&nbsp;</p><p>Obviously, if you’re not drinking for religious purposes, that’s very different. But I can tell you right now, in my position, where I make tens of millions of dollars a year for my software companies as well as my various other ventures, I have not met a person who makes eight figures a year plus that doesn’t drink.&nbsp;</p><p>&nbsp;</p><p>That’s just a pattern I’ve spotted. Do with that information as you will. I’ve just noticed that in the higher echelons of society, people drink fine wines. They like their fine whiskeys. I personally hate whiskey.&nbsp;I can’t stand it. So for that reason, I don’t drink whiskey, even though wealthy people do. So I’m not saying drink if you don’t want to drink. I’m just saying it’s a pattern I’ve spotted because over a glass of wine or a drink, deals are done, relationships are formed, friendships are formed.&nbsp;</p><p>&nbsp;</p><p>So I’m not saying give up drinking for the rest of your life. I’m saying for your first million. It’s honestly a lot less about who you know, and it’s more of about picking the right business model and sticking to it.&nbsp;</p><p>&nbsp;</p><p>Now, the next thing to give up if you want to be rich is women. I have a 90% male audience, so I’m speaking to you guys directly. The way that I was raised is, as a man, if you take a woman out to dinner, you pay for it.&nbsp;</p><p>&nbsp;</p><p>There’s no questions. I was raised very traditional with an Eastern European, even Middle Eastern mother. So for that reason, until the age of 25, don’t even worry about women.&nbsp;</p><p>&nbsp;</p><p>Now, also, don’t be scared of women. Interact with women. Don’t be a weirdo or a creep. In your day to day life, you can interact with women. Of course, if you find someone attractive, go up, speak to them, compliment them.&nbsp;</p><p>&nbsp;</p><p>But what I’m saying is serious dating. You are not in that position right now. And this goes hand in hand with drinking, because obviously, most of the time when you’re on dates, you’re drinking as well.&nbsp;</p><p>&nbsp;</p><p>You need to understand that as a man, your glory years are from the ages of 28 to 38. That’s really the years where women find you the most attractive. You know, it’s funny, I even have friends that would never even go near a guy if he’s under the age of 30.&nbsp;</p><p>&nbsp;</p><p>You could take the exact same guy and change his age from 32 to 24 and you just would simply not find him attractive anymore. Of course, in general, women are looking for older men because usually they bring more stability, more guidance, more wisdom, more direction.&nbsp;</p><p>&nbsp;</p><p>So as a man, if you know that, why not spend all of your younger years work on yourself, make something of yourself, become the man that you want to become, and then go present yourself to the world.&nbsp;</p><p>&nbsp;</p><p>Because listen, I’m going to be very honest with you right now. If you really painted out like your dream, dream, dream girl, not the girl that you would settle for like your dream girl, you probably can’t get her right now.&nbsp;</p><p>&nbsp;</p><p>So what’s the point in going out there on dates, on tinder, getting drunk, all of this bullshit, to settle for a woman that is subpar from the vision of who you want to be with? Why not just lock yourself away, work on yourself as a man for a few years in every area of your life, and then in three years, five years, eight years, present yourself to the world and you will be able to get your dream woman like this.&nbsp;</p><p>&nbsp;</p><p>Because, let alone being a high value man, you are a high value person. You can sit here and you can bitch and you can complain that things are unfair for men. And we have to sit and work our way through our 20s&nbsp;and literally like a sculpture shape and morph ourselves to become the right man in order to attract our dream woman.&nbsp;</p><p>&nbsp;</p><p>Whereas, let’s just be very honest. A lot of women, all they need to do is just be beautiful, polite, respectful, have good feminine energy. That’s not something that takes ten years of work to accomplished. So you can sit here and you can bitch and you can complain, but that’s just the way life is.&nbsp;</p><p>&nbsp;</p><p>So if you are not where you want to be, cut the women. There are distractions. What is the point in settling for a subpar version of the woman who you want to be the mother of your children, lock yourself in your house, fucking work on yourself and present yourself to the world in five years and you’ll get her like this.&nbsp;</p><p>&nbsp;</p><p>Now, the last thing you need to give up if you want to be rich is keeping up&nbsp;appearance is and no matter what position you get in life, because unlike drinking and unlike women, I think that once you get to a certain place in life, it does make sense to incorporate those into your life again if that’s something you want.&nbsp;</p><p>&nbsp;</p><p>By the way, everyone is wired differently. Everyone wants different things from life. But keeping up appearances is something that you should never, ever divulge in.</p><p>&nbsp;</p><p>I can tell you right now that so many of you are stuck because you are paying for a car you cannot afford.&nbsp;You’re buying all this gucci, balenciaga, all this fucking bullshit, even though you cannot afford it. You’re taking trips to Dubai when you can’t afford it. You’re flexing, you’re stunning on the gram even though you are broke.&nbsp;</p><p>&nbsp;</p><p>And you need to understand that that is a sad existence because every single night you’re going to look at yourself in the mirror and understand that I’m not that guy. And by the way, I know of people who make $20 million a year and spend $30 million a year.&nbsp;</p><p>&nbsp;</p><p>I know that sounds ridiculous to you. I know that sounds crazy. But there are some people that simply get all of their worth from the money they spend, the lifestyle that they present. That’s it.</p><p>&nbsp;</p><p>Now, I have a very pragmatic approach.&nbsp;I save and invest 70% of everything I make. And I know that a lot of people look at my lifestyle and think it’s crazy that sometimes I spend upwards of half a million dollars a month. But for me, it’s just percentages.&nbsp;</p><p>&nbsp;</p><p>And when I had no money when I was broke, I was very cognizant and I was very aware of the fact that when I make money, that dangerous place to be, because that is where you stop keeping track of money.&nbsp;</p><p>&nbsp;</p><p>That’s where you just spend willy nilly. And the empire that you built can collapse in a second. So keeping up appearances, no matter what position you get to in life, is something you need to let go of if you want to become rich and also stay rich.&nbsp;</p><p>&nbsp;</p><p>Now, one thing I will mention is it’s something that you will get out of your system. You know, it’s funny, there’s no playbook on what to do once you get money. Like, there’s no one who has a guide that tells you, hey, spend money on this because it’s worth it.&nbsp;</p><p>&nbsp;</p><p>Don’t spend money on this. There’s not really that much advice out there. So I will say as you start to make some money, you will probably need to get it out of your system. You will probably need to flex a little and stunt your money and throw it around.&nbsp;</p><p>&nbsp;</p><p>But then you’re going to get to a point where you’re very comfortable with your wealth. And for me, comfortable with your wealth does not mean that you have to be humble. So that way other people think you’re humble.&nbsp;</p><p>&nbsp;</p><p>If you want to fly private or you want to spend money on this or you want to spend money on that, do it. It’s your money. As long as it’s reasonable, as long as you’re saving and investing a good chunk of your money.&nbsp;</p><p>&nbsp;</p><p>I think comfortable with your wealth is when one is expensive and a lot of people will be jealous or envious of it, and the other may be cheaper, but you like the cheaper thing and you’re not going to get as much recognition for it, but you still go for it.&nbsp;</p><p>&nbsp;</p><p>I’ll give you an example, and this recently happened to me. If there’s two cars, and by the way, you can totally afford both cars, and one car you can flex on the gram with. Another one is a nice car, but it’s not a head turner.&nbsp;</p><p>&nbsp;</p><p>If you simply just like this car more. For example, if it’s a Tesla compared to you could buy yourself a Rolls Royce and you could do that very comfortably. For me, comfortable with your wealth is I like the Tesla, so I’m just going to buy the Tesla.&nbsp;</p><p>&nbsp;</p><p>So the reason I say all this is because you’re going to go through an arc and you’re going to get to a point where eventually you settle into your money and you don’t feel like you need to keep up appearances.&nbsp;</p><p>&nbsp;</p><p>You don’t need to feel like you need to constantly upgrade your life style for other people. You just do things because you like it. And by the way, there’s a lot of people who have a lot of money, but they’re so caught up with keeping up appearances that they’re simply a slave to their money.&nbsp;</p><p>&nbsp;</p><p>They’re a slave to keeping up this facade that they have. So, ladies and gentlemen, those are three things that you need to give up if you want to get rich. And by the way, if you want to stay rich, because this whole process of getting rich and staying rich, it’s not for one year or two years.&nbsp;</p><p>&nbsp;</p><p>This is a ten years plus journey. And by the way, you can look back in 2015 when I was a broke kid starting my first business to take care of me and my single mom, read&nbsp;my blog, see the journey, see the process.&nbsp;</p><p>&nbsp;</p><p>You need to remember that you’re going to put 1ft forward in front of the other for years and years and years. And as I said at the beginning of this article, life is just as much about defense as it is offense.&nbsp;</p><p>&nbsp;</p><p>So protect yourself. Make sure you’re strong. Make sure there are no leaks in your vessel. And on that note, I’ll be watching you from afar. And I’m rooting for.&nbsp;</p>"}}}]},"__N_SSG":true}