{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"The past two years\"\n      }), \" have brought a shift in the way we work and interact with our colleagues. Remote work has become the new normal, and many companies are opting for a distributed workforce to cut costs and gain access to a wider pool of talent. However, the remote work trend is not yet prevalent in India, and on-site jobs still dominate the job market.\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"In this article, we will compare the job opportunities and pay scales for working on-site versus working remotely in India.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Ease of Getting Hired\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Big tech companies and finance firms in India tend to hire in large numbers and filter out the best performers. They hire a pool of talented individuals, give them basic packages, and provide opportunities for growth and career advancement based on their performance. Most of these companies have back offices in India, and they hire more people locally because it is cheaper. As a result, it is relatively easier to get an on-site job in a big tech company or finance firm in India compared to getting a remote job.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Remote jobs are still uncommon in India, and there is no standard practice on how to get hired. To find remote jobs, you have to be exceptionally good at a specific niche technology or have a lot of experience in open source projects. Companies in the US also find it hard to find skilled talent in India. Therefore, you must be proactive and search for opportunities and reach out to companies yourself. In contrast, on-site jobs are easier to find because companies have back offices in India and are continually hiring new talent.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Money\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The pay scale for on-site jobs in India is relatively lower than that of remote jobs. On-site jobs typically pay lower than remote jobs because companies consider purchasing power parity (PPP). Additionally, these companies have a pool of talented people to choose from, and they can pay lower salaries to new employees. However, as the trend for remote jobs grows, companies are starting to raise their salary bands to keep up with their competitors.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Remote jobs pay more than on-site jobs because you are being hired based on your skills and expertise in a particular field. You are not competing with a large pool of talented individuals. In most cases, you have been hired for your specific skills, and the company knows that you can hit the ground running from the get-go. Therefore, the company saves on the downtime and training period for a new employee. Remote jobs in India pay more than on-site jobs, but slightly less than remote jobs in developed countries.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Skills Required\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To get an on-site job in a big tech company or finance firm in India, you need to have a strong grasp of data structures and algorithms. However, for remote jobs, you need to be an expert in a specific niche technology. Companies that offer remote jobs are usually startups that are not actively hiring. Therefore, you must have a lot of experience in a specific field and have to be exceptionally good at what you do.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you are looking for a remote opportunity today, you should focus on two technologies - Web 3 (Blockchain) and AI/ML. These are two fields that are very niche, have a lot of funding, and require experts to build scalable systems. Therefore, if you become an expert in either Web 3 or AI/ML, you can actively start reaching out to companies in these fields for remote opportunities.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Conclusion\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In conclusion, working for an onsite job in India in a big tech company or in finance has its advantages, such as the ease of getting into the company and the potential for career growth. However, remote job opportunities in India are also on the rise, and they offer the benefit of higher salaries and the flexibility to work from the comfort of your home. It’s important to note that remote job opportunities may require a higher level of expertise in niche technologies and proactive outreach to find opportunities. Ultimately, the decision between an onsite job or a remote job depends on personal preferences and priorities.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Working On-Site vs Working Remotely in India: A Comparison of Job Opportunities and Pay Scale","metaDesc":"The past two years have brought a shift in the way we work and interact with our colleagues. Remote work has become the new normal, and many companies are opting for a distributed workforce to cut costs and gain access to a wider pool of talent. However, the remote work trend is not yet prevalent in India, and on-site jobs still dominate the job market.\nIn this article, we will compare the job opportunities and pay scales for working on-site versus working remotely in India.","tags":["on-site vs remote jobs"],"slug":"working-on-site-vs-working-remotely-in-india-a-comparison-of-job-opportunities-and-pay-scale","readTime":4,"img":"https://images.pexels.com/photos/4238488/pexels-photo-4238488.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":4,"attributes":{"username":"Lynda","email":"lynda@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-03-24T18:26:29.905Z","updatedAt":"2023-03-29T21:46:22.119Z"}}}},"__N_SSG":true}