{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h2: \"h2\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"For many years, graduating from a top-tier college, such as the Indian Institutes of Technology (IITs) in India, was considered the key to getting a good job in the tech industry. However, with the increasing demand for tech jobs and the rise of remote work, the importance of college has diminished in the eyes of tech companies. Nowadays, your ambition and your will to learn is all that matters.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"This article will discuss the reasons why college is no longer a determining factor in getting a job in tech, and what you can do to increase your chances of landing a dream offer.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"The 5% Prodigies vs. the 95% Rest\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When it comes to tech, people can generally be divided into two parts: the prodigies and the rest. The prodigies are the 5% of people who have been passionate about computer science for a long time and are really good at it. For these people, college does not matter at all. They can get into any college and do really well in their lives because they love what they do. However, for the 95% of us who are not prodigies, the initial motivation for getting into tech comes from the desire to earn a good salary.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"The Privilege of Tier One Colleges is Diminishing\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In the past, being from a top-tier college like the IITs was a major advantage in getting a job in tech. Companies like Google, Amazon, and Facebook used to go to IITs for placements and hire the top talent from there. However, with the increasing demand for tech jobs and the rise of remote work, the advantage of being from a top-tier college is slowly diminishing. Nowadays, companies are open to hiring good software engineers from anywhere, irrespective of which college they are from.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"The Importance of Peer Groups\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"One of the advantages of attending a top-tier college is the opportunity to be surrounded by a strong peer group. These are usually a bunch of very ambitious people who are also looking for a job in tech. Spending time with ambitious people can make you more ambitious yourself. However, ambitious people can be found in any college, and all you have to do is find a group of people who want a job in tech eventually. It’s not the college that helps, it’s the people that are around you.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"The Importance of Self-Learning\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In the tech industry, what matters most is your skills and experience. College degrees, while important, are not the only way to acquire these skills. There are many resources available online that can help you learn programming languages, frameworks, and other skills. Online courses, coding bootcamps, and open-source projects are just a few examples of how you can gain the skills and experience you need to land a job in tech. It’s up to you to take advantage of these resources and build a portfolio of projects that demonstrate your skills.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Networking\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Networking is an important part of getting a job in any industry, and the tech industry is no exception. Attending meetups, hackathons, and conferences can help you meet people who work in tech and make valuable connections. These connections can lead to job opportunities and mentorship, which can help you grow your career. In addition, social media platforms like LinkedIn can be a great way to connect with people in the tech industry and showcase your skills and experience.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"In conclusion,\"\n      }), \" the importance of attending a tier one college for a career in tech has significantly decreased. While a good college may provide certain benefits, such as a strong peer group, good festivals, and better opportunities to network, ultimately, what matters is one’s ambition, dedication, and willingness to learn. Big tech companies are more interested in hiring specific talented individuals, regardless of which college they come from. Therefore, it is essential to focus on improving one’s skills, building a strong network, and pursuing one’s passion to excel in the tech industry.\"]\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Why College Doesn’t Matter for Getting a Job in Tech","metaDesc":"For many years, graduating from a top-tier college, such as the Indian Institutes of Technology (IITs) in India, was considered the key to getting a good job in the tech industry. However, with the increasing demand for tech jobs and the rise of remote work, the importance of college has diminished in the eyes of tech companies. Nowadays, your ambition and your will to learn is all that matters.\nThis article will discuss the reasons why college is no longer a determining factor in getting a job in tech, and what you can do to increase your chances of landing a dream offer.","tags":["tech jobs"],"slug":"why-college-doesn-t-matter-for-getting-a-job-in-tech","readTime":4,"img":"https://images.pexels.com/photos/5155218/pexels-photo-5155218.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":5,"attributes":{"username":"Ethan","email":"ethan@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-03-29T20:06:15.902Z","updatedAt":"2023-03-29T21:46:01.460Z"}}}},"__N_SSG":true}