{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h3: \"h3\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"What makes Green tea so good?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Tea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"I know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that \", _jsx(_components.strong, {\n        children: \"free radical\"\n      }), \" damage we always talk about. \"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Now, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of \", _jsx(_components.strong, {\n        children: \"antioxidants\"\n      }), \" found within green tea. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Have you got stinky breath ?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Second significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Gives stable energy.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. You’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Act as relaxing agent.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. Its benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Helps in fat burning.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Point number five: Green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. But there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Decrease the risk of you developing Alzheimer’s and Parkinson’s disease\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Point number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing \", _jsx(_components.strong, {\n        children: \"Alzheimer’s and Parkinson’s\"\n      }), \" disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Increase your lifespan\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Point 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Some studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Don’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Finally, don’t cheap out. Go for the good premium stuff, as it contains more of the healthy nutrients we’ve been talking about all along. I need you to know this. Don’t buy into the BS supplements that take green tea extract and claim that it has miracle health benefits. They do not.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The real thing is always healthier than the supplement form. As always, thanks for reading.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"7 Health Benefits of Green Tea & How to Drink it ","metaDesc":"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \n\nTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \n\nThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \n\nAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \n\nI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that free radical damage we always talk about. \n\nNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of antioxidants found within green tea. \n\nWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \n\nSecond significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \n\nIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\n\n Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. \n\nYou’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee. Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. \n\nIts benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \n\n Point number five: green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. \n\nBut there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \n\nPoint number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing Alzheimer’s and Parkinson’s disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\n\nPoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \n\nSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \n\nBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \n\nSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \n\nDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  ","tags":["health","lifestyle"],"slug":"7-health-benefits-of-green-tea-and-how-to-drink-it","readTime":5,"img":"https://images.pexels.com/photos/1417945/pexels-photo-1417945.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}