{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Have you heard of Edging? Well, today we’re going to talk all about it. Pros, cons and is it safe?\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"What is edging?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Edging is described as orgasm control or trying to essentially get to the point of climax and then preventing orgasm to delay the active orgasm. This can be done by yourself or with a partner and can be incorporated in many different kinds of sex, including oral, anal or penetrative intercourse.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"So why do people do Edging, and what are the benefits? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, number one is to potentially increase pleasure. So the thought of doing Edging is that as you delay orgasm, it builds up the tension and allows a bigger release when orgasm essentially does occur, causing increased pleasure.  \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Number two, \", _jsx(_components.strong, {\n        children: \"it can offer a way to kind of enhance your connection with your partner\"\n      }), \", if you’re doing it with a partner. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It allows you to kind of explore together and potentially even time your orgasms to occur at the same time, which may bring joy to a partner and allow for increased intimacy.  \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Number three, it can be a learning process.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So using Edging can allow you to really see what sort of stimuli are very pleasurable versus what are less pleasurable and allow you to understand your body better and really obtain more information about what causes you to reach orgasm and what you can do to help prevent it.  \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Next, it can allow you greater control.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So some people really want to have control over how long they can delay orgasm by allowing for a longer period of intercourse and potentially more pleasure for both themselves and their partner, as I described earlier.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And lastly, we often prescribe something similar to this for men with premature ejaculation. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’ve written several articles on premature ejaculation, so make sure you check those out. But essentially, premature ejaculation is ejaculating before you or your partner wants to causing distress and this usually happens within the first two minutes of intercourse.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So the stop start method is essential when you feel that you’re about to achieve climax, you stop for 30 seconds and then you resume. Sometimes you can also add a squeeze where the partner squeezes the glands or head of the penis to help kind of prevent reaching orgasm, and then you go back to it.  \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"So how well does it actually work?\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, the data we have is from the premature ejaculation data, hasn’t been studied really well in people using Edging for pleasure purposes or people who just want to try something new.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So there’s one really interesting study that looked at 36 couples and they divided them into two categories. One is the traditional stop start method, which is often discussed and described by Urologists to teach patients how to prevent premature ejaculation.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Another was other techniques to delay ejaculation without having to stop sexual activity to kind of allow it to continue, which is what I imagine many people are using when they’re doing Edging at home.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So they first explain what happens during sexual excitation. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are a few things that our body does when our bodies are getting excited prior to the point of no return or about to have climax. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"First of all, the tension in your muscles increases. That can be in your abdominal muscles, your pelvic floor muscles, your gluteal muscles. They’re all increasing in tension. Your respiration starts going more and more rapidly. Often, people are thrusting their pelvis more aggressively.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Often people are very focused on the sensations that they’re occurring that are causing sexual stimulation, as well as increasing the rapidity of their pelvic thrust and overall, just having more pleasure.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So the way to essentially prevent climax from happening is to increase the length of this sexual excitation phase. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"What can you do to stop the early climax?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And one of these is to actually do some abdominal breathing or belly breathing or diaphragmatic breathing. Essentially, because during sexual excitation, as I mentioned previously, there is an increase in how fast you’re breathing and usually you’re using kind of your chest rather than your belly.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So focusing on abdominal breathing will also relax the muscles a bit so they’re not so tense all the time. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, trying to focus on extending the pleasure with moderate intensity rather than going hard and fast, trying to kind of slowdown and appreciate what you’re feeling and enjoying the journey, and not just focusing on reaching climax.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And they really stress that you shouldn’t try to distract yourself from the sexual stimulus by thinking of something not sexual because that can really cause a lot of discomfort and anxiety during the sexual encounter and is really not actually adding to the experience.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In this, 36 couples, they measured their time to ejaculation or intra ejaculatory latency time by using a stopwatch. They asked the female partner to measure the start of intercourse till the ejaculation time. And they did it before the treatment, then after the treatment, and then three months later. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And what they found was that pretty much before, they were all less than a minute to ejaculation. And what they found was that after doing these exercises or doing the stop start method, people were able to extend their intra ejaculatory latency time up to seven minutes, meaning they were able to go from less than a minute to seven minutes before reaching climax. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So certainly it does work and certainly offers some potential for increased pleasure. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Cons of Edging\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, some of these I’ve talked about in my last video on masturbation techniques that might be ruining your sex life.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"One of these is it may cause blue balls. So blue balls are what we call epididymal hypertension. And the reason for this is that when you’re having arousal, blood flow increases to all the pelvic floor muscles, including those that are near the testicles.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And all this increased blood flow usually is released when you reach a climax. But when you don’t reach a climax, the blood flow hangs around and then causes this heavy pressure discomfort feeling, which many people call blue balls. And so this certainly can happen when you’re edging. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"The second thing is idiosyncratic masturbation.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if you’re doing a lot of edging, specifically with masturbation, it can lead to you getting really used to that specific form of stimulation.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A hand, or even for women, using toys, can become your preferred way of masturbation. So this can make it more difficult to climax when you’re with your partner, because a vagina may not cause as firm of a grip as a hand or a penis may not offer the same sort of stimulation that a vibratory sex aid would.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so, lastly, the other problem is this can lead, lead to some delayed ejaculation, difficulty reaching climax, or just overall dissatisfaction. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So when you’re trying to reach climax right, you’re aroused, you’re into it.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And if you stop doing whatever that activity is, it can reduce arousal, making it more difficult to then reach that same level of arousal again for some individuals. And so in that case, it can lead to frustration, discomfort and essentially a lot of pressure because now you feel this pressure to perform and climax at the time where your partner is waiting or when you’re trying to reach climax. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s really important, of course, if you’re going to participate in Edging with a partner that you talk about it, make sure you’re both on the same page and you’re both consenting adults and want to proceed that way.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And lastly, I want to cover a couple of small questions that people ask me about Edging. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"So how long should you edge for?\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, I think really it depends on you individually. There’s no right or wrong time.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As I mentioned previously and other studies that have looked at forms of Edging for premature ejaculation, they’ve seen that it extends intercourse by about seven to nine minutes. So is that a reasonable amount of time?  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Certainly most people, I would say, probably go to the half an hour mark. If you’re spending lots and lots of time edging to enhance your pleasure, as long as it’s not starting to interfere with your daily life, your quality of life, your overall happiness, there’s really no problem in doing whatever you enjoy.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But if you find that you are constantly engaging in Edging or you’re starting to have discomfort or feeling sort of tension all the time in the pelvic floor while this is extremely rare, I’d certainly see some people who come in who just have chronic pain down there because they’ve been doing a lot of Edging.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so I would say, if you’re feeling okay and you’re living your life and you’re happy and you and your partner are happy, there’s really no harm in engaging in it. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"What happens to that semen if you don’t ejaculate? Is it going to back up in your body? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And the answer is no, nothing’s going to happen if you don’t ejaculate. Either your body will reabsorb the semen or you will ejaculate at nighttime and having nocturnal emission.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you want to learn more about nocturnal emissions, I’m an entire article about that, so make sure you check it out. As always, I hope you found this article helpful.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"A Urologist explains what edging is and whether it is SAFE!","metaDesc":"Edging is described as orgasm control or trying to essentially get to the point of climax and then preventing orgasm to delay the active orgasm. This can be done by yourself or with a partner and can be incorporated in many different kinds of sex, including oral, anal or penetrative intercourse.  \n\nSo why do people do Edging, and what are the benefits? \n\nWell, number one is to potentially increase pleasure. So the thought of doing Edging is that as you delay orgasm, it builds up the tension and allows a bigger release when orgasm essentially does occur, causing increased pleasure.  \n\nNumber two, it can offer a way to kind of enhance your connection with your partner, if you’re doing it with a partner. \n\nIt allows you to kind of explore together and potentially even time your orgasms to occur at the same time, which may bring joy to a partner and allow for increased intimacy.  \n\nNumber three, it can be a learning process. \n\nSo using Edging can allow you to really see what sort of stimuli are very pleasurable versus what are less pleasurable and allow you to understand your body better and really obtain more information about what causes you to reach orgasm and what you can do to help prevent it.  \n\nNext, it can allow you greater control. \n\nSo some people really want to have control over how long they can delay orgasm by allowing for a longer period of intercourse and potentially more pleasure for both themselves and their partner, as I described earlier.  \n\nAnd lastly, we often prescribe something similar to this for men with premature ejaculation. \n\nI’ve written several articles on premature ejaculation, so make sure you check those out. But essentially, premature ejaculation is ejaculating before you or your partner wants to causing distress and this usually happens within the first two minutes of intercourse.  \n\nSo the stop start method is essential when you feel that you’re about to achieve climax, you stop for 30 seconds and then you resume. Sometimes you can also add a squeeze where the partner squeezes the glands or head of the penis to help kind of prevent reaching orgasm, and then you go back to it.  ","tags":["Edging"],"slug":"a-urologist-explains-what-edging-is-and-whether-it-is-safe","readTime":8,"img":"https://images.pexels.com/photos/4009368/pexels-photo-4009368.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}