{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [\"There are five things that you must know about the \", _jsx(_components.strong, {\n        children: \"Epstein-Barr virus\"\n      }), \". Now, why is it so important to know more about this virus? Well, simply because the chances are pretty great that you have this virus, and it could potentially create a problem in your life. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so the more you know about it, the less you are going to be adversely affected by it. Roughly 95% of the population has this virus, so that’s greater than nine out of ten people. So this virus definitely pertains to you, and having this information can greatly protect you against a problem with this virus. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Epstein-Barr virus\"\n      }), \" is called the Kissing virus, because a lot of times people get it in their teenage years, but even children can get it as well. But they are usually asymptomatic. And probably because the \", _jsx(_components.strong, {\n        children: \"Epstein-Barr virus\"\n      }), \" primarily attacks a certain immune cell called the B-cell (b-lymphocyte). \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And that’s part of the acquired immune system that develops as you get older. But that’s just my theory. It could be another reason. But this information is based on this new book that I’m reading called “Latency strategies of Herpesviruses”. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But this book is all about the strategies that the herpes viruses used to go underneath the radar and survive and live in your body. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And this term, latency means that the virus goes in a dormant state. It hides in your body, and it’s very difficult for your immune system to detect, if not impossible. So there are certain viruses that when you get infected, they stay in your body. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And they can potentially come out in certain environments. Other viruses are killed, and they can be eliminated from the body. The latent viruses stay in your body. So number one, and we’re going to get to five things. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"The \", _jsx(_components.strong, {\n        children: \"Epstein-Barr virus\"\n      }), \" is in the family of the Herpes virus, and it’s one virus that can go into this latent phase. So you get infected, it creates a lot of problems with your throat glands. It can create severe fatigue and achiness of the joint. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And I had it when I was in 10th grade, and it was terrible. I couldn’t breathe because my throat was so close down, and I just had to wait it out and kind of get through it. But it can be pretty nasty. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And then after a period of time, it can fully kind of go away. Usually it could take two, three to four weeks. And then in your mind, you’re like, okay, that’s gone. I’ll never get that again. Right?\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Well, here’s the thing about the \", _jsx(_components.strong, {\n        children: \"Epstein-Barr virus.\"\n      }), \" You can never get rid of it. You have to just focus on keeping it in remission, which has everything to do about understanding the sneaky little tricks and strategies that this virus uses to survive, and then what you can do to help your own immune system keep this thing at bay. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Once you get this virus, you cannot get it out of the body. Well I lied. There is one way that you can get it out of the body, and I learned that in this book. You can get rid of all your bone marrow and replace it or transplant it with a new bone marrow from someone who does not have this virus. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But that might be a little impractical. So the first thing to know is that we can’t get rid of it. So the goal should be to keep it in remission. What’s so wild about viruses, especially this virus, is the sophistication of strategies that it has developed over a long period of time to stay alive and do its damage. When viruses really are supposed to be not alive, they’re just this genetic material wrapped in the sack. But it’s very, very mysterious and how they can be dead, but live off your cells and develop all these wild strategies, which I’ll get into a few.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The second thing you need to know is the Epstein Bar virus is associated with the increased risk of certain cancers, autoimmune diseases, rheumatoid arthritis is associated with Epstein Barr virus, chronic fatigue syndrome, as well as fibromyalgia. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So when the virus gets reactivated, it doesn’t necessarily exhibit all the full-blown symptoms that maybe you had when you first got it. It may manifest in fatigue, soreness, lethargy, brain fog, achy joints and achieve muscles, maybe a headache, maybe your glands are a little bit swollen.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And number three and this is very interesting. This sneaky virus blocks through various mechanisms the key immune nutrients that your cells depend on to keep them functioning correctly. Okay, the first vitamin that we’ll go after is vitamin D. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I mean, it has the ability to take your receptors for vitamin D and downgrade them. So it would be like sticking an earplug in your ear so you can’t hear as much. So it affects the receiving end of vitamin D because somehow this virus knows that vitamin D keeps your immune system strong and it’s intimately involved with every part of your immune system. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if it can block that, it has an advantage,so it downgrades the receptor vitamin D. It also interferes with the metabolism of vitamin D. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So now you can’t go from the inactive to the active vitamin D and it affects the absorption of vitamin D in your gut. Now the second nutrient that it interferes with is zinc. It interferes with the zinc transporters, not allowing zinc to be be transported to the different parts of the immune system. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if your immune system is deficient in zinc, it can’t release the weapons that the immune system needs to destroy viruses. There’s a lot of research of using the active form of vitamin A retinol to inhibit the Epstein-Bar virus. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So it blocks the absorption of vitamin A. And this is really important to know because vitamin A is essential in mucus membranes in producing the mucous barrier to prevent this virus from invading the tissues. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"And so this is just another reason why making sure you have enough vitamin A, vitamin D, and zinc in your diet is so important. And on top of that, remember when I mentioned that the \", _jsx(_components.strong, {\n        children: \"Epstein-Barr virus\"\n      }), \"  has a primary mechanism of attacking the B lymphocytes? \"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Well, it just so happens that the primary nutrient that the B lymphocytes need is vitamin A retinol. All right? So now that you have that, there’s another thing that the \", _jsx(_components.strong, {\n        children: \"Epstein-Barr virus\"\n      }), \" does to survive. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It has the ability to bypass your immune system regulation of temperature during a viral attack. So basically it can prevent you from getting a fever. So you might think that’s a good thing, but you have to realize that your immune system heats up to actually inactivate viruses. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So here you are. You have this reactivation of this virus and you’re tired, your brain fog, but maybe you don’t have a fever to help you get rid of it. So it just lingers on for week after week, month after month. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"This is kind of important information because if you start to feel maybe some of the symptoms or subclinical symptoms of \", _jsx(_components.strong, {\n        children: \"Epstein-Barr virus\"\n      }), \" infection, you should be going into the sauna, you should be taking a hot bath. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You should be trying to induce some type of fever in your body by maybe wearing a lot of clothes while you’re in bed to stay really hot and stay out of the cold temperature that may help you. The fifth thing that you need to know is emotional stress, and more specifically, things related to loss of a loved one, loss of money, loss of anything or any emotional stress. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"In practice, I’ve noticed nearly 100% of the time, people that had autoimmune diseases, people that had chronic fatigue syndrome and fibromyalgia always had emotional stress. Think about what stress does.\"\n      })\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Stress activates \", _jsx(_components.strong, {\n        children: \"Cortisol\"\n      }), \". What does \", _jsx(_components.strong, {\n        children: \"Cortisol\"\n      }), \" do? It suppresses the immune system. It opens up a door for these viruses to come out and create a lot of problems. The importance of this or the significance of this is for you to start to really focus more on dealing with the stress than any other factor, since if you can resolve the stress somehow, you can actually put this thing back in remission. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are other things that can also activate this virus out of remission. Certain toxins, pollution, chemicals, drugs, the contrast up to pill. Yeah. That can increase your risk of having it come out of remission. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Other infections like the cold, like flu, COVID, even certain vaccines like the COVID vaccine, can bring this thing out because of what it does to the immune system. And also steroids, like prednisone or certain medications that are steroid based can actually activate this virus. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Why? Because a steroid is cortisol, and cortisol suppresses the immune system. So yes, it gets rid of the inflammation and makes you feel better temporarily when a little bit later, all of a sudden now, you end up with more outbreaks. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"All right, the plan number one is to concentrate more on, on this very important factor of stress. Do whatever you can to resolve the stress, chronic stress, especially if you’re kind of stuck between a rock and a hard place with whatever that can be.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Probably the most important thing to do to keep this thing in remission. And of course, if there’s any other triggers, like you’re taking birth control pills and you notice that this virus comes out every time you take that pill, then you’re going to have to come up with a Plan B. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"All right, number two, make sure you’re getting enough vitamin D, zinc and retinol. It just so happens that there is one thing that has a really delicate balance of vitamin D and vitamin A, and that is COD liver oil.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And there are some natural herbs that can help suppress viruses, especially the Epstein-Barr virus. I put some research down below specifically on these herbs that I’m going to mention. I’m not recommending getting all of them, but one or two would be a smart thing. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"So we have elderberry, we have echinacea; we have olive leaf extract. Then we have Andrographis, which is an herb that has significant effects over that Epstein Bar virus. And then we have Astragalus, which is a Chinese herb, to help put this \", _jsx(_components.strong, {\n        children: \"Epstein-Bar virus\"\n      }), \" back into remission. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’ve written a lot of articles on how to reduce stress. Since that’s the most important thing related to this topic, I highly recommend you watch this article that I put out on what to do if you experience chronic stress. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Check it out.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Epstein-Barr Virus (EBV):5 Things You MUST Know about.","metaDesc":"Epstein-Barr virus is linked to autoimmune diseases, rheumatoid arthritis, chronic fatigue syndrome and fibromyalgia. Epstein Bar virus is associated with increased risk of certain cancers, autoimmune diseases. When the virus gets reactivated, it doesn't necessarily exhibit all the full-blown symptoms that maybe you had when you first got it. It may manifest in fatigue, soreness, lethargy, brain fog, achy joints and achy muscles.\n\n Epstein-Barr virus knows that vitamin D keeps your immune system strong. So if it can block that, it has an advantage,so it downgrades the receptor vitamin D. It also interferes with the metabolism of vitamin D in your gut. The second nutrient is zinc, not allowing zinc to be be transported to the different parts of the immune system.","tags":["stress","Epstein-Barr virus"],"slug":"epstein-barr-virus-ebv-5-things-you-must-know-about","readTime":9,"img":"https://images.pexels.com/photos/4226221/pexels-photo-4226221.jpeg","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}