{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"An ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Here’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"How to Control Stress in Real-Time","metaDesc":"An ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm. \n\nHere’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down. \n\nA signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up. \n\nThe opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume. \n\nThe sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down. \n\nSo if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous. \n\nThis doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV. \n\nBut all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time. ","tags":["health","lifestyle"],"slug":"how-to-control-stress-in-real-time","readTime":2,"img":"https://images.pexels.com/photos/321576/pexels-photo-321576.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}