{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Masturbation\"\n      }), \", solo-sex, self-love. What’s the deal with it? Is it good for you or is it causing all your problems in bed?\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’m going to talk to you about the pros and cons of masturbation. And debunk some of the biggest myths of masturbation that I hear every single day.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Over 90% of men and 75% percent of women report masturbating on a regular basis. So that’s not surprising because there’s lots of benefits to masturbation. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"In addition to pleasure, people report improved mood, better sleep, and even more focus. And why is that? And this is not surprising because when you masturbate, you release a number of feel good hormones, including dopamine, oxytocin, serotonin and even the feel-good endorphins.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And masturbation is the ultimate form of safe sex. It not only allows you to experience pleasure but also allows you to familiarize yourself with what makes you excited and gives you pleasure so that you can communicate that with your partner. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It also allows some people to experience pleasure without the added stress of intimacy or needing to perform under pressure.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The number one myth that I hear about masturbation is that ====>\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Myth:1 Masturbation will make you go blind or have hairy palms. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And this is just, in fact, not true. If almost 90% of the population is masturbating, well, then we’d have a lot of blind people and a lot of hairy palms. So basically, that is just not true. A lot of this is perpetuated by thought leaders that believe that masturbation is sinful or represents a person being out of control of their own body. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And while I’m not here to judge anyone’s religious convictions, these myths are just not true.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The next thing is something I hear all the time. I get messages all the time asking me;\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Myth:2 I Masturbate every day. Am I ruining my erections? Am I going to ruin my ability to have a normal sex life? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Masturbation does not cause erectile dysfunction. In fact, it’s quite the opposite. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Masturbation, when leading to orgasm, actually causes contraction of the pelvic floor muscles. And these pelvic floor muscles are super important for having orgasms and also being able to experience pleasure. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So when you’re actively exercising these muscles, you will have better orgasms and probably a better sex life.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"However, there are two caveats to this. The number one caveat is \", _jsx(_components.strong, {\n        children: \"pornography\"\n      }), \". So, there has been an increase in erectile dysfunction in young men, which correlates with the rise in accessibility to \", _jsx(_components.strong, {\n        children: \"pornography\"\n      }), \". \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Meaning that it’s everywhere. You can’t go anywhere without bumping into it if you wanted to find it. What does that even mean? Well, watching pornography can actually desensitize a person to normal sexual stimulation and lead to unrealistic expectations of what a sexual encounter should look like. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That can also lead to a significant amount of pressure and performance anxiety, which can lead to erectile dysfunction. I get a lot of young patients who have performance anxiety and have issues with erections. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And when you think about it, the stress of performing then leads to poor ability to have erections when you have sex, which then compounds that performance anxiety, and you keep going in this vicious cycle. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, actually, if you’re able to masturbate and get yourself to have erections, that can actually give you sex. Confidence so that when you are going forward with a sexual encounter, you will have the confidence to know that you are capable of getting an erection. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"And the next caveat is \", _jsx(_components.strong, {\n        children: \"guilt\"\n      }), \". If you experience guilt from masturbation because of your personal beliefs, then that can be really detrimental to your sexual function and, in fact, has been linked to depression and anxiety. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And it is totally okay to abstain from masturbation if it makes you feel bad. But if it’s something that you want to work through, you may seek a sex therapist to help you work through those issues of guilt associated with masturbation. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Myth:3 When you masturbate too much, it reduces your sensitivity.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And that’s not exactly true. So there are a couple of things that can happen. If you’re masturbating in a typical normal way. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Then if you use a certain device or a certain motion that your body can actually become habituated or get into a habit of feeling that particular sensation resulting in orgasm. And when you do something different, it can make it harder for you to orgasm. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So it’s important to use similar techniques to what you would do in a sexual encounter or consider using less pressure or less vibration if that’s not what you’re going to expect during intercourse.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, sometimes if you are using a significant amount of pressure, stroking or folding the penis one way or the other, this can affect the sensation of your penis or your clitoris in women. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So you do need to be careful and thoughtful about how you masturbate.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Myth:4 You can masturbate too much.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And in fact, this is not true for the large majority of people. Even if you’re masturbating daily for pleasure or for stress relief or enjoyment. That’s okay.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The times when it becomes problematic are if it’s interfering with your day to day life. If you find that you have a strong compulsion to masturbate that you can ignore, or you’re skipping out on normal activities to masturbate, or skipping out on being intimate with your partner just to masturbate, these are signs that you may be masturbating too frequently. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However interestingly, although there’s not a lot of data to support this, in some men with chronic pelvic pain or testicular pain, we will actually recommend that men masturbate a couple of times a week as kind of a stress relief mechanism. It sometimes does help people with chronic pain relieve that stress.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Myth:5 Masturbating means that you have a bad relationship.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is not true. Many people in partnered relationships masturbate separately or together, and this is not a reflection of the amount of love your partner has for you or vice versa. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is an activity that actually may improve your sex life overall and should have no reflection on your level of intimacy or bond as a couple.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Myth:6 Masturbation lowers testosterone.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And in fact, there is no data that suggests that masturbation lowers your testosterone level. In fact, when you orgasm or during masturbation, your testosterone level actually goes up. And after you complete the orgasm, the testosterone level goes back down to a normal level. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It does not actually deplete the amount of testosterone you have in your body. This myth has actually gotten a lot of traction.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Even in ancient Greek and Roman times, they found that men would hold off from having sex or master waiting before big tournaments because they thought they’d be more aggressive when they were sexually frustrated. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And similarly, athletes have done the same. But there’s not really a lot of data to support that. So there’s no reason to put yourself through that torture.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Thank you so much for reading. And always remember to take care of yourself.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Is Masturbating Daily makes you Sexually weak?! | 6 Masturbation Myths DEBUNKS by Urologist. ","metaDesc":"I’m going to talk to you about the pros and cons of masturbation. And debunk some of the biggest myths of masturbation that I hear every single day.\n\nOver 90% of men and 75% percent of women report masturbating on a regular basis. So that’s not surprising because there’s lots of benefits to masturbation. \n\nIn addition to pleasure, people report improved mood, better sleep, and even more focus. And why is that? And this is not surprising because when you masturbate, you release a number of feel good hormones, including dopamine, oxytocin, serotonin and even the feel-good endorphins. \n\nAnd masturbation is the ultimate form of safe sex. It not only allows you to experience pleasure but also allows you to familiarize yourself with what makes you excited and gives you pleasure so that you can communicate that with your partner. ","tags":["Masturbation"],"slug":"is-masturbating-daily-makes-you-sexually-weak-6-masturbation-myths-debunks-by-urologist","readTime":6,"img":"https://images.pexels.com/photos/5750395/pexels-photo-5750395.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":["https://www.tandfonline.com/doi/abs/10.1080/0092623X.2014.958790?casa_token=v6mYV3wbzRYAAAAA%3AnbXb-dY0ZWArAAA0p-nmUZyMkKckZHccyW5pkDATkEFT_BbCRjZ_uZmEe4RztGRP_LhNqlGq-RsASK8&journalCode=usmt20","https://www.tandfonline.com/doi/abs/10.1080/00224499.2018.1556772","https://onlinelibrary.wiley.com/doi/abs/10.1111/pere.12267"],"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}