{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Does the pull out method really work? \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"We’re going to answer does withdrawing or coitus interrupted or pulling out actually prevents pregnancy and is there actually sperm in the pre-⁠ejaculate fluid?\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"What happens during ejaculation?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"During ejaculation, men produce a fluid called pre-⁠ejaculate or precum and this fluid is secreted by these specific glands called the bulbourethral glands and they actually serve a purpose. One is to lubricate the passageway to help sperm pass.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It also helps the semen clump up appropriately or coagulate. And lastly it helps the sperm survive in a very acidic environment and both urine and the vagina have an acidic environment so it keeps them healthy so they can reach the egg without getting damaged and then create an embryo.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So that all sounds great, but there’s two things to realize. One is that you cannot control when it comes out or how much comes out that’s variable from person to person. Some people release a couple of drops, some people can release as much as a teaspoon.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"And secondly, and most importantly, does pre-⁠ejaculate or precum actually have sperm in it that could potentially create a pregnancy? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And the short answer is it doesn’t. The fluid itself won’t contain any sperm. However, if you’ve recently ejaculated or had sex recently, sperm can still be in the passageway or the urethra from where this pre ejaculate would go through and hence, this could then carry some sperm into the vagina and cause a pregnancy.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, sometimes it’s very difficult to pull out at the right exact time, in which case you also put yourself at risk for an unwanted pregnancy.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"How often do people have unwanted pregnancies when they do the pull out methods?  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Can you get pregnant when pulling out?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, researchers looked at surveys of over 2000 women. They found that almost a third of them used this method to prevent pregnancy. And of those, 21% actually had an unintended or unwanted pregnancy despite using the pullout method.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And they’ve estimated that, you know, somewhere between nine to 48% of people are using the pullout method. So should you use it? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are a couple of things. Certainly it has a failure rate, and you could end up with an unwanted pregnancy.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And second, and most important, is it doesn’t protect from any sort of sexually transmitted infection. In fact, they’ve looked at pre-⁠ejaculate fluids and they found HIV in HIV-⁠infected patients in the actual pre-⁠ejaculate fluid. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So it’s much better to use some sort of barrier protection if you’re concerned about sexually transmitted infections. And there are very safe and effective birth control methods available from the obstetricians and gynecologists to help you prevent unwanted pregnancies. Using those is going to be a much better and safer option rather than using the pullout method.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I hope this article answered your question.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Is pulling out a reliable method to avoid getting pregnant? Is Precum safe?","metaDesc":"If you do it correctly, pulling out is a pretty effective way of preventing pregnancy. But it can be hard to do it the right way every time. Pulling out also doesn’t protect against STDs, so using a condom is a good idea to help prevent STDs and add extra pregnancy prevention.","tags":["precum","pull-out"],"slug":"is-pulling-out-a-reliable-method-to-avoid-getting-pregnant-is-precum-safe","readTime":3,"img":"https://images.pexels.com/photos/4980313/pexels-photo-4980313.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":["https://journals.lww.com/greenjournal/Abstract/2013/09000/Use_of_Withdrawal_and_Unintended_Pregnancy_Among.16.aspx","https://onlinelibrary.wiley.com/doi/10.1002/ca.22655"],"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}