{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"There is definitely a myth that calcium is the main mineral that you need for osteoporosis to strengthen your bones. And unfortunately, so many menopausal women are just downing, like over a thousand milligrams of calcium.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Of course, it’s in the wrong form. It’s in an elemental form called calcium carbonate, which is basically limestone. You’d be better off chewing on the cement out there. But somehow we have in our minds that if we take this calcium, we’ll prevent osteoporosis. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And it’s absolutely not true.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Did you realize that the majority of bone, what makes up bone, over 70% of it, is not calcium. It is collagen, which is protein. And there is calcium in bone, for sure. There’s a good amount, but that calcium is tied up with phosphorus.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But you don’t hear people saying, well, you need to have more phosphorus for bone health. And they don’t definitely say, you need more collagen for bone health. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"In some pretty hardcore research and studies. I’m going to put the links down below. People that take calcium do not prevent fractures. \", _jsx(_components.strong, {\n        children: \"There is strong evidence that if you take calcium in supplement forms, this can increase your risk of cardiovascular accidents.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"So if calcium is not the main mineral that builds bone to prevent osteoporosis, what is?\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Well, it’s a combination of many things. Since bone is made out of protein, and that protein is activated by various minerals and trace minerals like cobalt, manganese, magnesium, and phosphorus and many other minerals.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Making sure you have all the trace minerals in the diet is going to help you. You also need vitamins. Vitamins help transport these minerals. And the most important vitamin for bone health is vitamin D and vitamin K2. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They both work together by making calcium available to make bone, as well as to help deliver the calcium that’s in the blood from the absorption of the intestine directly to the bone, that’s vitamin K2. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"So you need vitamin D3 and Vitamin K2 to build bone.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Other factors relate to hormones. If you’re deficient in, like estrogen, for example, that can lead to osteoporosis, or if you have too much cortisol. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To build bone, you just need to focus on creating a healthy body, because it’s not just one thing, it’s the whole package. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"People that have bone loss have an underlying metabolic problem that does not just focus on one loss of one mineral. It’s not that you’re just losing calcium, and that’s why you have osteoporosis. That is just a total myth. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, the question is, since we’re talking about calcium, what would be the best source of calcium to support one part of this puzzle to strengthen your bone? Should you do more plant based? Should you do more dairy? \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"The bioavailability of calcium in dairy is definitely better than plants. One reason is because some plants, like spinach, for example, and Swiss chard, have a very potent inhibitor of calcium called oxalates.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so oxalates block the absorption of calcium. Beans are high in oxalates. Almonds are high in oxalates. Eggplant and beets are high in oxalates.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"So a combination of plants and dairy, I think would be good to help support calcium.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But as far as dairy goes, raw milk cheese is an excellent source of bioavailable calcium.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now. It’s more difficult to find raw milk cheese in the US. If I’m correct, I think you have to buy this cheese that’s over 60 days, and there are certain other regulations, but in Europe, you can find raw cheese all over the place. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But this raw cheese supports the calcium complex. It supports the collagen, protein and other minerals and probiotics.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And since we’re on the topic of calcium, what are some of the problems when you become deficient in calcium? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, I’m going to go through them. But I do want to mention if you get your calcium tested in the blood, your serum calcium, that doesn’t necessarily tell you about the free available calcium. Serum calcium could be made up of the protein bound calcium that’s unavailable and not the ionize calcium that is active in your body. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if you really want to know if you have enough calcium that’s available, you want to get a test that measures the ionize calcium. That will give you a lot more information.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"So if you’re deficient in calcium, you can end up with muscle spasms.\"\n      }), \" \"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"You can end up with tetany,\"\n      }), \" which is a little twitching. sometimes, it’s on top of the left eyelid, the arm. It could be anywhere in the body. And by the way, tetany can also be caused from a lack of magnesium, from a lack of potassium, because your body is too alkaline. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And one cause of alkalinity is low potassium, and another cause is hyperventilation that can change your PH. And so if you can, imagine if someone has these panic attacks and they’re hyperventilating, and sometimes they get these little twitches, well, that’s why your heart rate can go up or down if you’re deficient in calcium. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Another deficiency of low calcium is numbness around your mouth or numbness and tingling pins and needles in your fingertips as well as in your feet.\"\n      })\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"You can also have a spasm in your larynx, that comes from low calcium that’s going to show up in, like, coarseness or kind of rough sounding vocal cords, or it can even feel like you have this lump in the throat.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Calcium is also needed for many different things, too. It’s a good thing, just not needed in large amounts. I recommend getting it from the food mostly, but if you get it from a supplement, make sure it’s on the lower amounts because of that darn problem or potential risk of increasing your risk of getting heart attacks. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And I’m not sure if that has only to do with the type of calcium people take, like calcium carbonate. But calcium actually does provide some good benefits to prevent against intestinal cancers as well. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When you’re low in calcium, okay, there’s a message sent to a gland that surrounds your thyroid. It’s called the parathyroid, and you have four little glands around this thyroid, and low calcium activates the parathyroid to increase vitamin D. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To thereby increase more calcium absorption in the intestine, as well as giving other signals to the bone to release calcium. So we can actually use calcium from the bone. The bone is kind of a reservoir of calcium. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"And one point to mention about vitamin D, if you’re deficient in vitamin D, which most people are, you’re going to have a hard time raising the calcium up to level it needs to be from the intestine to the blood\"\n      }), \". \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if you have vitamin D, you can increase this calcium by a factor of 20x. But if you don’t have that vitamin D, you’re going to have a problem with calcium. Another thing that’s needed with this absorption of calcium is magnesium, which is another factor.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A lot of people are deficient in magnesium. So if you don’t have enough magnesium, you’re not going to be able to have the levels of calcium that you need.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Other factors are involved in depletion calcium as well.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"For example, if you consume an excessive amount of protein, that can create some loss of calcium. But again, if you’re taking enough calcium in, it’s not anything to be worried about.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But I just want to point it out that there are things that tend to cause a loss of calcium, and that would be excessive amount of protein. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That would be excessive amount of sodium. And I’m not telling you to cut down your sodium. I’m just kind of giving you the relationship between these two minerals.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Another thing is if you drink a lot of coffee or caffeine in excess of mounts can deplete your calcium. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, if you are exposed to a lot of phosphorus, you can lose calcium from the bone.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Now, where do you get phosphorus from?\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, it’s actually in animal meats, but it’s also in soft drinks. It’s people that are drinking all these sodas all day long. They’re just depleting the calcium left and right.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Also, if you have refined sugar, that can also deplete your calcium levels.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Anyway, I wanted to bring up your awareness of this relationship between calcium and your bones and make sure you have all the information. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"And this is another reason why you should just eat healthy to create strong bones.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Since we’re on this topic of calcium, and I did mention this thing called oxalates, you should definitely check out my articles on oxalates if you haven’t already seen it, and I’ll put it up right here.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Myth of Calcium role in Osteoporosis: Osteoporosis prevention.","metaDesc":"There is a widespread misconception that calcium is the primary mineral required for osteoporosis bone strengthening. And, unfortunately, many menopausal women are simply consuming large amounts of calcium.\nOf course, it's in the incorrect format. It exists in the elemental form of calcium carbonate, which is essentially limestone. You'd be better off chewing on the concrete outside. But we somehow believe that if we take this calcium, we will be protected from osteoporosis.\nAnd it's completely false.\nDid you know that the majority of bone, more than 70% of it, is not calcium? It is collagen, which is a type of protein. And there is definitely calcium in bone. ","tags":["Osteoporosis"],"slug":"myth-of-calcium-role-in-osteoporosis-osteoporosis-prevention","readTime":7,"img":"https://images.pexels.com/photos/5554180/pexels-photo-5554180.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":["https://pubmed.ncbi.nlm.nih.gov/4046641/","https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8030811/","https://www.bmj.com/content/351/bmj.h4580","https://www.bmj.com/content/351/bmj.h4183"],"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}