{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Look down at your arm. They’re on you right now. In fact, they’re everywhere. On your skin, in your mouth, on your teeth just crawling, breathing and farting all over the place. Come on, relax. I’m just talking about bacteria.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And I know reflexively. You’re thinking, well, bacteria, that must be a bad thing. Not really. You have more good bacteria than bad bacteria in your body. Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Not only are these bacteria good for us, but they’re practically essential to our survival. This symbiotic relationship between us humans and good bacteria is known as mutualism. And it’s basically when both parties are benefiting from living together or existing together. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Have you ever seen a rhino with a little bird sitting on top of its back? It’s called an oxpecker bird. That bird is eating ticks and parasites off the rhino’s back. So the bird is benefiting because it’s getting fed, the rhino is benefiting because it’s getting fewer ticks and parasites on its back. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Everybody’s winning. The type of good bacteria I want to talk about today lives primarily within your gut. And you’ve heard the term probiotic. It’s become a mega-industry into the hundred billions of people selling supplements, selling foods that are probiotic rich. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But do we really know what the term probiotic means? Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In order for me to best explain how probiotics work, we need to understand how the gut works. Now, the job of the gut, when we’re talking about the small intestinal, large intestine, is to extract energy from foods, absorb certain nutrients like vitamins, minerals, and really get rid of the waste. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When you’re taking probiotics, most of the probiotics end up at the end of your intestinal system, also known as the colon. Scientists have discovered that what is within your GI tract, or your gut, they call it. Microbiome. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is the ecosystem that contains bacteria, fungi. Those things are actually essential to your survival because, unfortunately, your digestive system can’t extract all the nutrients from all the fresh foods you’re consuming. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So when we’re talking about the good bacteria within your gut, we’re actually talking about the bacteria that’s helping you get some nutrients from your food to improve your body’s immune function, to support the integrity of the wall of your intestines. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is the job of the good bacteria. I just wanted to say. Thanks, partner. Our knowledge and most of the research done on the microbiome is fairly new, with most of the studies popping up in the last 20 years. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Within this recent research, we found that the gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety, but it’s really a cause-and-effect dilemma. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Basically, the chicken or the egg. We’re not sure what came first, the irregularities of the microbiome or the illnesses themselves. The gut mind connection truly gets me excited. Just imagine this for a second. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even. That’s what preliminary research is showing. After hearing the links between all these serious diseases and the gut mind connection, you probably want to keep your microbiome healthy and diverse. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So how do we do that? Well, first, you want to focus on your diet. No surprise here. Focus on eating vegetables, whole grains, legumes. These are fiber-rich foods. Fiber someone basically known rich foods as prebiotics as they serve as food for the probiotics. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Next, you want to consume probiotic rich foods like yogurt, sauerkraut, kimchi. These foods naturally contain that good bacteria we’ve been talking about. I know some people resort to taking probiotic supplements. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But I’ll touch on that shortly. Now, there have been ways you can actually hurt your microbiome. Foremost is a diet rich in refined carbohydrates. I’m talking about white breads, white pasta, white rice, sugars, even artificial sweeteners. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Next up is poor sleep. If you don’t get enough sleep. I’ve talked about the consequences of that in the past, but it also hurts your microbiome. Because guess what? The bacteria in your gut also have a circadian rhythm. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They like for you to get quality sleep. Next is antibiotics. When you use antibiotics inappropriately or you overuse them, you actually kill off that good bacteria in your gut, and you can create an overgrowth of harmful bacteria. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Last but not least is stress. Yes, those folks who are more stressed out and experience chronic stress for an extended period have a disruption in their microbiome, both with higher amounts of bad bacteria and lower amounts of good bacteria. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Stop getting worked up over small things. Now. Probiotic Supplements multibillion dollar industry marketers are quick to make health claims about the benefits of taking their supplements. But in reality, the picture is so much more complex. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Like I said earlier, there’s seven to 90 different strains of good bacteria inside your gut. Increasing the number of a specific strain can have different effects depending on which condition you have. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Experts deem probiotics to be a safe supplement, yet potential risks exist, particularly for those with weakened immune systems or illnesses like cancer. There’s been a recent study that came out of Israel showing that taking probiotics can actually harm your microbiome depending on which probiotic you take. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"My recommendation for probiotic supplements is that the average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, the conditions where I have seen evidence to prove that there is a benefit are in traveler’s diarrhea antibiotic associated diarrhea, very specific conditions known as necrotizing enterocolitis in young children. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Last but not least, those who have inflammatory bowel disease like ulcerative colitis. Notice that these are very specific instances where I reach for probiotics as a workable treatment option. For those of you considering taking a probiotic foremost, please have a conversation with your doctor or health professional on whether you should be actually doing this. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Next, I want you to not skip proven treatments for your condition and instead go for unproven treatments. Make sure you pay attention to the label. There are a few things to look out for. One, the expiration date and storage instructions. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Second, look at the CFUs that’s the colony forming units. Look for a number bigger or at 5 billion. And finally, look to get inter-coded probiotics because those are less likely to get destroyed by the acid in your stomach. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The future of probiotics and even probiotic supplements is very interesting. The potential for unlocking so many new health secrets is really immense. I’m excited about it. You should be excited about it.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Myths and benefits of Probiotics.","metaDesc":" Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species. Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them. Most of the probiotics end up at the end of your intestinal system, also known as the colon.\n\n The gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety. The bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even.\n\n There’s seven to 90 different strains of good bacteria inside your gut. Experts deem probiotics to be a safe supplement, yet potential risks exist. The average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit.","tags":["health","lifestyle"],"slug":"myths-and-benefits-of-probiotics","readTime":6,"img":"https://images.freeimages.com/variants/HrnJrKhbkjAckDLNncuRs4TA/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}