{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    h2: \"h2\",\n    p: \"p\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.h2, {\n      children: \"Is getting testosterone from an online clinic safe and legit. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So these online clinics are offering services to patients who want to access them for things like erectile dysfunction, hair loss, and now even low testosterone.  \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"And are they good or bad?\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, I will say I am happy that people have more access to health care, right? If you feel uncomfortable or don’t have access to a doctor who can help you manage these things, it’s great to be able to access care online.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And these clinics are seeing an exponential growth of nearly 1500% from 2017 to 2019. That’s even before the pandemic. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"So that gets us down to the question, is it safe?\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What exactly is the online experience of the person going to get testosterone at an online clinic? And also, are these clinics following guidelines? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So they conducted what we call a secret shopper test.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So they essentially were secret shoppers. They actually got their testosterone blood work, and they had appointments with these providers at these different clinics. So, based on the American Neurological Association guideline, we define low testosterone as having a total testosterone of less than 300 nanograms per milliliter.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, it’s important to counsel patients on the risks of testosterone. Those include the risk of infertility, the risk of having polysypemia, or an increase in your red blood cell count, as well as possible risk of cardiovascular events.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So they reached out to seven online clinics, and the patient was a 34-year-old man with low energy, low libido, and a desire to have children in the future. And what did they find? So in none of these clinics did the patient see a doctor.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In six out of the seven clinics, they saw a nurse practitioner or physician assistant. And in the last clinic, they saw a non medically licensed individual. And the secret shopper patient had a testosterone of 675, which is well in the range of normal.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, despite having normal testosterone, he was still offered testosterone in six out of seven clinics. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Out of seven clinics had a threshold of 450 nanograms per ml where they would not give testosterone unless your testosterone was below 450. Again, the guidelines say 300. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And only one of the clinics asked about their cardiovascular history or discussed fertility issues. And only one clinic talked about the risk of polycybemia. But fortunately, they all suggested continued regular follow up.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Testosterone as a great supplement\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"While I’ll be the first one to tell you that testosterone is a great supplement for people who need it, because low testosterone has a lot of risks associated with it, including things like cognitive decline, low libido, decreased muscle mass, and even potentially cardiovascular risk.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you have a normal testosterone, giving yourself more testosterone is not better. In fact, it puts you at risk for all the risks associated with taking testosterone. And testosterone is not a magical treatment if you’re having issues with sexual function, it may or may not fix them.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A lot of people mistakenly believe that if they have erectile dysfunction, giving them self testosterone will help improve their erectile dysfunction. And while, yes, in a very small subset of people, they will see improvements in their sexual function, most people will only see an improvement in libido, not necessarily sexual function.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Take-away from accessing online clinics\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So my takeaway from this is we need to be careful where we’re getting health care and who we’re getting it from. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, again, like I said, I have no problem with having access to care online. I think a lot of these clinics are allowing men to access care when they need it and in a safe, secure environment.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I still do worry about people getting testosterone when they are not supposed to. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Of course, this is a small subset of clinics, only seven clinics, and it supports you guys. There are risks and it’s important to for yourself to be informed about what you’re taking and putting into your body.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I know that if you’re reading this; you are someone who cares about what you’ve put in your body. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As always, we’re take care of yourself.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Online Clinic for Testosterone? A Urologist Explains If It's Safe","metaDesc":"Do you intend to purchase testosterone from an internet clinic that offers this service? Do you have any doubts, nevertheless, as to its validity, safety, and efficacy?\n\nThese internet platforms have grown rapidly, enabling access to healthcare for conditions including erectile dysfunction, low testosterone, and hair loss among others.\n\nBut before you think of doing this, you should be aware of the following.","tags":["testostrone"],"slug":"online-clinic-for-testosterone-a-urologist-explains-if-it-s-safe","readTime":4,"img":"https://images.pexels.com/photos/10612242/pexels-photo-10612242.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}