{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\",\n    ul: \"ul\",\n    li: \"li\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"So the question is, what would actually happen to your body if you really gave up sugar? I mean, completely for two weeks? Let’s take a look at that.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"1. Lose appetite for sugar–\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Why? Because every time you consume sugar, a hormone comes in there and pushes your blood sugars down, causing a low blood sugar situation, hypoglycemia to some degree. And that is going to cause you to crave sugar. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, by getting rid of sugar, you get rid of the craving for sugar.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"2. Less hungry–\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Until you do this. You won’t really fully know, but I’m telling you, it’s the sugar that keeps you hungry all the time. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When you give up the sugar, you become a lot less hungry.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Why? Because you stabilize your blood sugars, and now your cells can be actually fed, because when you’re living in sugar, because sugar is toxic to the body, the body starts rejecting it. That’s called insulin resistance.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So the body is blocking insulin because that controls sugar. And what your body is really trying to do is limit the amount of sugar inside the cells. So the body doesn’t consider it a good thing, it’s a bad thing. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So when you give it up, this thing could reverse. And not only can you now absorb proper amounts of fuel, you absorb nutrients a lot better, too, because insulin resistance also blocks nutrients, minerals, vitamins. And that’s one of the functions of insulin.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"3. Less fatigue\"\n      }), \"–especially after eating a meal.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When you’re eating sugar regularly, you’re going to be tired after you eat, and that is a blood sugar thing. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But you’re going to find that you’re no longer going to be that tired after you eat. It just means that now you’re no longer having higher sugar, which basically makes the brain tired. It’s normal sugar, and now your brain can be awake. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"4. Lose excess water and fat–\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For the first week, you’re going to dump a lot of water and some fat, but after that, it’s going to be more and more fat. You’re going to be surprised at how much fluid you were keeping. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Some people within one week can lose about 13 pounds of fluid. They’re holding that fluid around, and that can’t be that healthy for the heart. Of course, you’re going to see your clothes loosening, especially in the mid-season infection. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your gut, your waist, is one of the best indicators to tell if you’re doing too much sugar. If you reduce the sugar, the stomach shrinks. If you eat the sugar, your stomach will expand.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"5. Enhanced mood and improved cognitive function —\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if you were grouchy before, you’re now going to be a lot calmer, less stressed, and you’re going to be actually nice to be around. Okay, that’s good. Also, your cognitive function will improve, so you’re going to feel more focused. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You’re going to have more concentration. You’ll be less add more attention to focus on your projects.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"6. Skin looks better —\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You’re going to have less acne. Your skin is going to glow. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And that’s just a reflection of what happens when you consume sugar. Your insulin goes up and also the hormone androgens and we’re talking about females androgen will go up, and that’s going to create acne.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In a male body, the increased insulin will lower testosterone. So you’re going to have other problems that are associated with low testosterone.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"7. Less stiffness –\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So you’re going to have less inflammation. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You’re going to have less pain. So what’s happened is all we’re doing is we’re converting your fuel from sugar to fat. It takes three days of cutting down the carbohydrates in the sugar. You may have a worsening of the symptoms for three days. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Anyone can actually handle three days. And if you took some B vitamins from nutritional yeast and some potassium. You probably won’t have any symptoms, so it’s going to be relatively easy.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"At the cellular level, you’re building new enzymes to run your body off fat fuel. That’s what’s happening. You have little machines that are literally changing over to a different fuel source. That’s what’s happening over these two weeks.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You’re getting decreased inflammation in your arteries. It’s going to help you, in the long run, prevent a clot or plaquing and help reduce the risk of a stroke and a heart attack. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, you’ll start growing brain cells.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Why? Because when you reduce sugar, then you run your body in a different source of fuel called ketones. And ketones support the growth of nerve cells. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Next one, the liver. You’re going to start dumping some of this fat that’s been accumulating in your liver, and you’re going to use that as fuel. So you’re on your way to cleaning out the liver. So it’s no longer fatty as a side dump. If you have a large belly, chances are you have a fatty liver. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So by doing this, you will reduce the fat inside your liver.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And last, you’re going to have better kidney function. Take a look at a diabetic. The kidney is the target for problems. When you actually cut down the amount of sugar, reduce the carb, you can improve kidney function greatly. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All right, thanks for reading.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Summary:—\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Advantages of quitting sugar include:\"\n      })\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Developing new enzymes to allow the body to run on fat fuel\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Less artery inflammation\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"increased brain cell growth\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Remove a fatty liver\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"improved kidney function\"\n      }), \"\\n\"]\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Quitting Sugar benefits : 14 Days no Sugar Challange.","metaDesc":"So, what would happen to your body if you completely stopped eating sugar? I mean, for the entire two weeks? Let's look into that.\n1. Reduce your sugar cravings-\nWhy? Because every time you consume sugar, a hormone enters your body and lowers your blood sugars, resulting in a low blood sugar situation, or hypoglycemia to some extent. And this will cause you to crave sugar.\nSo, by eliminating sugar, you eliminate the desire for sugar.\n2. Feeling less hungry-\nUnless you do this. You won't fully understand, but I can tell you that it's the sugar that keeps you hungry all the time.\nWhen you stop eating sugar, you become much less hungry","tags":["sugar"],"slug":"quitting-sugar-benefits-14-days-no-sugar-challange","readTime":5,"img":"https://images.pexels.com/photos/6823457/pexels-photo-6823457.jpeg","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}