{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Do you groom your hair down there? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Why do people have pubic hair? And when did genital grooming become a thing?  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"How many people do it? What are the risks? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And how can you protect yourself? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And lastly, what happens if you get those pesky ingrown hairs or rash bumps? What do you do with them? \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"So why do humans have pubic hair?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, number one, it’s because it allows us to know that you’re ready to have babies. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So essentially, you don’t get full grown pubic hair until you go through puberty, which means you’re able to reproduce. So it’s a signal for people to realize that, okay, you are of age and able to reproduce, which is evolutionarily important. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The second reason is it offers some protection from friction. So that’s why we have it in our groin, to kind of protect from friction during sex.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And number three is that they secrete pheromones. And that’s specifically because the hair bearing area, specifically in the pubic region, as well as the armpit, secretes certain lipids proteins and pheromones.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Pheromones are essentially chemical substances that are released by the body that are actually meant to signal another person to have a social response. So, for example, maybe smelling the pheromones in someone’s pubic hair may get somebody aroused and interested in having intercourse, particularly if they’re in the time of ovulation, where their pheromones may change.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"History of pubic hair removal\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Interestingly, in ancient Egyptian art, females were depicted as having small triangles of pubic hair, as well as little golden razors were buried with them to take with them to the afterlife. In the Middle Ages, pubic hair removal was actually encouraged to prevent the spread of pubic hair life. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It wasn’t until 1866, when a vulva and pubis were depicted full of hair in a painting called Lorgen Dumont. Then, in the 1950s and 1960s, it speculated that perhaps people stopped showing pubic hair in pornography to avoid censorship.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And the reason being is that they were told that pubic hair makes it clearly pornography. And so, in order to try and avoid that, they kept people’s pubic hair trimmed or groomed. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Who’s removing their pubic hair?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, when you look at college studies, upwards of 88% to 90% of both men and women are grooming their pubic hair, whether partially or completely.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you ask women why they remove their pubic hair, sometimes it’s because they want to increase their sexual attractiveness. They want to improve their femininity. They feel like it’s cleaner or more hygienic, or they even feel like it enhances their sexual experience.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And for men, similarly, they felt like cleanliness was the top reason, followed by sex appeal. And lastly, for body definition. And for many men, you may notice that if you shave your pubic hair, your organ looks a little bit longer.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"How often are people having issues after doing some sort of pubic hair removal? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In fact, shaving on multiple studies has been shown to be the number one way people remove pubic hair. And that makes sense because it’s cheap, it’s easily accessible, and everyone probably has a razor in their house.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, using a non-electric razor in multiple studies has been shown to be associated with the most number of complications associated with shaving. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"So how can you hurt yourself from removing pubic hair?  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, there are a few ways. One is you can get genital burns from waxing, you can get severe skin irritation, and even sometimes what we call post-inflammatory hyperpigmentation. So change in color of the skin that’s usually darker or redder.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You can also get cuts. On the skin, which can lead to sexually transmitted infections, if you are going to have intercourse with someone and you have a cut on the genitals. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Most commonly, what we see are cuts and rashes and sometimes pain.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In one study, looking at presentations to the emergency room for genital grooming issues, they found that actually these issues increased five folds between 2002 and 2010. And this has probably linked to the increase in grooming in the US population. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What they found was that 83% of injuries were related to shaving with a non-electric razor. So, like a regular razor that you’d have at home. Interestingly, in a quarter of women, they found that these injuries were due to wax, burns, cuts and even injuries to the inside of the vagina.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In men, scissor injuries were actually more common, and men were the only ones who had injuries from hair clippers, and women were more likely to have them due to wax use or shaving cream. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In another study, however, they found that while there were several injuries, only 3% of them were serious.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So that’s good news. As long as you’re using good technique, you should hopefully avoid having any serious injury. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I will have one caveat, though. If you are diabetic and you have not really controlled your diabetes, well, I would 100% avoid shaving.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The reason being is because shaving can lead to a seemingly small injury. But in patients who have poorly controlled diabetes, they’re at high risk for a very serious, life-threatening condition called Fournier gangrene.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And that’s essentially like a flesh-eating bacteria that grows rapidly. And so if you get that, you can get very sick quickly and required emergent surgery to debrie any tissue that’s affected and that can be quite extensive and quite dangerous.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So I strongly encourage anyone who’s immunosuppressed or diabetic to avoid doing any sort of shaving where they might actually get a break in the skin. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Ingrown hairs\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So let’s talk a little bit about ingrown hairs. Why do we get them and how can you prevent them? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, ingrown hairs can happen one of two ways. One way is you have the hair and you shave it. Particularly if you shave against the grain, you can get a very angular shape to the hair that’s there.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And as it grows out, particularly if it’s curly or has some wave to it, it can actually turn back and go towards the skin and get embedded into the skin. And hair is not supposed to grow just anywhere. It has actual follicles, where the hair grows from. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So when it goes into the skin there, your body sees this hair growing in the wrong place and it starts creating a foreign body reaction. So you start getting this raised area and lots of inflammation that can be uncomfortable and painful.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The other type of ingrown hair is after you maybe wax or tweeze or pluck a hair, then the hair underneath starts growing out. But for some reason, if there is a lot of dead skin covering that area and the hair can’t get out, then it tries to go out of the follicle to grow, and then that causes the same sort of inflammatory reaction.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The thing about these inflammatory reactions is some people, after you have them, they can create post inflammatory hyperpigmentation or they can darken in color. And so it can be very annoying and very uncomfortable.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The way to really prevent these is to shave with the grain rather than against the grain. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And there are a few other best practices that will share with you in just a moment. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So the next type of infection that you might see is called actual folliculitis.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And this is not necessarily due to an ingrown hair. It’s when there’s actual true inflammation or infection of the hair follicle. And this sometimes you can see maybe like what looks like a pimple or maybe even have seen some puffs. And that may actually require some true antibiotics. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"How do you manage your pubic hair removal safely? And then what do you do if you get one of these pesky ingrown hairs or rushes? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Whether you’re shaving your pubic hair, your legs, your underarms, you always want to get wet first.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And then you want to make sure you’re using a clean razor, not one that’s been sitting on the shower ledge getting moisture all over it. Because that can actually, one, dull the razor and rust it, but two, it can also put it at risk for getting mold or other kind of nasty bacteria in it, which you don’t want to be using to shave your pubic or underarms or anything like that.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You want to use some sort of lubricant. Now, that can be soap, that can be shaving cream, but you want to use some sort of lubricant when you shave, and you want to shave with the grain of the hair to avoid getting those ingrown follicles.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And also, if you are prone to ingrown hairs, it’s a good idea to moisturize the area. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ideally, you want to change your razor every week or so, especially if you’re shaving every day, to avoid having a dull razor that can put you at higher risk of getting uneven shaves and then being at higher risk for those pesky ingrown hairs. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Whatever sorts of moisturizers or gels you’re going to use, make sure you test them on an area that’s not so sensitive.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"First, try to avoid things that don’t have scents or smells. Use sort of sensitive skin type stuff which will be less likely to have any irritation related to it. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For waxing, make sure you either go to a professional or if you’re going to do it yourself buy proper wax kits, don’t try to do it yourself at home.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If your hairs are too long, you do want to trim them so they’re about half an inch or so. And then always test a little bit of wax elsewhere before you start down there with hair removal creams. While these are very effective, again, you want to spot test this first on your hand or somewhere else to make sure that you’re not going to have an allergic reaction. These can have a lot of irritating substances in them, and so that can be a problem. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are some other options that are available, including laser hair removal or IPL, which is an intense pulse light hair removal.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"What do you do if you get an ingrown hair? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, first and foremost, you want to stop any hair removal options for at least about a month, which I know is a long time, but you need that area to stop irritating the area with shaving, waxing, tweezing, whatever it is you’re doing. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And then using warm compresses daily can be helpful. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you’re concerned about folliculitis, make sure you see your doctor to get antibiotics maybe.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you’re seeing pus or things like that for a rash or if it’s very itchy, you can get some over-the-counter hydrocortisone cream and just apply little spot areas on where it’s itchy to help you get through that short period of time.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And lastly, consider changing the way you’re managing your hair removal. If you’re getting a lot of recurrent ingrown hairs or bumps or things like that, consider trying something else or take a break and stop hair removal for some time.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All right, I hope you guys found this helpful. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Thank You.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Shave VS Wax VS Trim: How to Remove Pubic Hair Safely by an Urologist","metaDesc":"Some people like their pubic hair to look or feel well-groomed. Some others prefer to remove it all.\nThere are a variety of popular ways to trim or remove pubic hair at home. Each method carries some risk, but most are generally safe.","tags":["Pubic hair"],"slug":"shave-vs-wax-vs-trim-how-to-remove-pubic-hair-safely-by-an-urologist","readTime":10,"img":"https://images.pexels.com/photos/1758144/pexels-photo-1758144.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":["https://www.ajog.org/article/S0002-9378(14)00065-9/fulltext","https://www.goldjournal.net/article/S0090-4295(12)00940-5/fulltext","https://academic.oup.com/jsm/article-abstract/18/12/1945/6955951?redirectedFrom=fulltext&login=false","https://www.sciencedirect.com/science/article/abs/pii/S1743609515326242?via%3Dihub","https://academic.oup.com/jsm/article-abstract/12/1/48/6966708?redirectedFrom=fulltext&login=false"],"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}