{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"So today we’re going to talk about some really, really stupid advice. It’s eating everything in moderation. I’m not sure who came up with it, but the definition of moderation is you’re avoiding extremes.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You’re consuming a reasonable amount of something, something that’s kind of rational, something that’s more balanced. And of course, many people will say that keto is unbalanced. It’s too extreme to lower these carbohydrates.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And of course, there is no bad food group. It’s about just eating everything in moderation. So let’s go through the reasons why this is a really stupid idea. The first thing is that low carbs really are not low carb unless you compare them to what everyone else is doing. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The average person consumes at least 65% of their calories being carbs. And of course, if you compare the keto to that, which is 5% of your calories being carbs, yeah, that would be extreme. That would be considered a low carb.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But even when we talk about moderation, it’s so subjective. Is it 50% or is it 70%? Is it 80%? What is a moderate amount of carbohydrate? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If we compare normal blood sugar, this is a good reference. What is normal blood sugar? Well, I would say about 80 milligrams per deciliter. That would be considered normal. Now, there’s a little range, a little higher, a little lower, but I would say 80 would be a good average.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Now, how much sugar does that mean in your blood?\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, if you take 80 milligrams per deciliter, that really only comes down to one teaspoon of sugar. One teaspoon of sugar. That is only for 4.2 grams of carbohydrate.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That’s pretty down low, because in keto, we’re allowed up to 50 grams of carbohydrate. It almost sounds like keto is kind of high carbs if you compare it to your blood sugars. And then we have insulin resistance.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, a much more scientific name for that would be Carbohydrate intolerance. If you were lactose intolerant,or glucose intolerant, would it be okay to consume milk sugar, or gluten in moderation?  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you had an allergy to something, would it be okay to expose yourself to that in a certain moderate amount? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, if the majority of population is truly insulin resistant and then allowing people to eat a moderate amount or much greater than the 50 grams per day, that is going to lead to a lot of problems with all sorts of things.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Because the person is already carb intolerant, they already have insulin resistance. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So what we’re going to do is we’re going to make it worse. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"And that’s going to produce more insulin.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"It’s going to produce more belly fat.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"More liver fat.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"More blood sugar problems.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"More bad lipid profile problems.\"\n      })\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"High blood pressure and the list goes on and on.\"\n      }), \"  \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, there are people that can tolerate carbohydrates. It’s not the majority of the population, but certain people can. And for those people, I’m not necessarily talking to them, but they can tolerate more carbs.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I mainly focus on the majority of the population, which probably includes you reading this article right now. The other point about insulin resistance, if you have insulin resistance, which probably you do, your ability to absorb nutrients is going to be less.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your ability to absorb potassium and B vitamins and calcium and magnesium and zinc is going to be less because of those receptors involved with insulin. Which means you’re going to be less satisfied because it’s the nutrients many times that will satisfy us and tell us to stop eating.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Any time that we’re eating something that we don’t get these nutrients, the turn off switch is not going to be there. And this can cause you to overeat. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Let’s move on to the next point, which is your genetics.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, when I had my DNA tested, there was a very specific gene that showed up that I had a problem with and that they call it the sweet tooth gene, which is called TAS1R2. If there’s a problem with this gene, I’m going to keep this really simple. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your ability to be satisfied with sugar is a lot less than someone else’s. So this means as soon as you start eating sugar, you have a difficult time stopping. And that is totally me my entire life like once I start, I can’t stop. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I mean, I remember Halloween, right? I would collect huge bags of candy, and I would literally eat the whole thing in one sitting. There’s also 38 additional genes related to diabetes.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And if you have a mutation with those genes, you’re more susceptible to eating more sugar and developing diabetes. So if someone has a kind of genetic issue, not only will they gravitate to eating more sweets, they’re at much higher risk for cavities because they’re eating more sweets.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But that’s just the tip of the iceberg, okay? There are lot more health problems than just a cavity. You’re talking about heart problems, you’re talking about liver problems, you’re talking about brain problems.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And then we get into another topic of addicting foods. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Because when we’re talking about eating everything in moderation, we’re mainly talking about junk foods, maybe alcohol, maybe pleasure foods, sweets. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you give me permission to eat a moderate amount of doritos, I will not be able to do that. As soon as I start eating doritos, I have to consume the entire bag, no matter how big it is? Obviously, you have a combination of these incredibly flavored corn chips with these great spices, but with no nutrition at all.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"With certain chemicals like Monsota and Glutamate that stimulate hunger and it just doesn’t satisfy you. As soon as you eat this, it tastes great, but there’s no actual nutrition to turn off that switch.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So I will just keep eating more and more and more. I mean, try to eat just one Oreo cookie, just a small amount, yeah everything in moderation and see what happens. Again, this is really bad advice. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And then you have just refined foods where you have the pizza and the chips and the candy and the cookies because they’re not nutrient dense.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s very difficult to moderate that amount that you’re eating because your body will never get satisfied. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And this relates to the next part, which is eating anything will stimulate insulin and insulin tends to increase hunger.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So just having a little bit of something which is going to make you more hungry. And now you’re actually going round and round, round. You can’t go for any period of time without the need for food. It’s a never ending cycle. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s a trap because once you’re in it, then you just have to constantly eat every hour and a half. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So this idea of everything in moderation is just really stupid across the board. It’s really hard to have willpower when your physical low blood sugar issue is causing you to want it more and more. You will not be rational. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In fact, do an experiment. Take your kids to the grocery store unfed and just go past the chip aisle or the junk food oil and see what happens. They’re going to be demanding that refined carb. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The only door to burning off your fat is through bringing your carbs down below 50 grams or less. That is the only way you’re going to shift your metabolism into burning off the fat that you need to burn off.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And also it’s the only way to being able to rely on your fat as your primary fuel source and not have the hunger. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When you burn fat, the hunger goes away. It makes everything work. It’s easier to follow a program when you don’t need sugar, when you are not hungry, when you’re satisfied, when you’re not eating, your body is eating your own fat, but only if you drop your carbs below 50 grams.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So this low carb thing really solves a lot of problems health-wise.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Why eating everything in moderation doesn’t work for weight loss or creating a healthy body?","metaDesc":"So today we're going to discuss some really, really bad advice that is everything should be consumed in moderation. I'm not sure who coined the term, but moderation is defined as avoiding extremes.\n\n\n\nYou're consuming a reasonable amount of something, something that's more rational and balanced. Of course, many people will argue that the keto diet is unbalanced. Lowering these carbohydrates is too extreme.\n\n\nAnd, of course, there is no such thing as a bad food group. It's simply a matter of eating everything in moderation. So let's go over the reasons why this is a terrible idea. The first point to make is that low carbs are not truly low carb unless they are compared to what everyone else is doing.\n\n","tags":["healthy eating"],"slug":"why-eating-everything-in-moderation-doesn-t-work-for-weight-loss-or-creating-a-healthy-body","readTime":7,"img":"https://images.pexels.com/photos/1153367/pexels-photo-1153367.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":["https://pubmed.ncbi.nlm.nih.gov/18349384/"],"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}