{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Billions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And while those are powerful, the problem is they require that people step away from the stress inducing activity. My lab and other laboratories have been very interested in developing tools that allow us to push back on stress. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Feel more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh is a pattern of breathing that involves two inhales followed by an extended exhale. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Physiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Anytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Typically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout your mouth or throughout your nose. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Reduce Anxiety & Stress with the Physiological Sigh ","metaDesc":"Billions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life. \nAnd while those are powerful, the problem is they require that people step away from the stress inducing activity. My lab and other laboratories have been very interested in developing tools that allow us to push back on stress. \nFeel more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh is a pattern of breathing that involves two inhales followed by an extended exhale. \nPhysiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe. \nThere are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily. \nAnytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale. \nTypically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout your mouth or throughout your nose. \nThe second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court. \nAnd that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide. \nSo if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm. ","tags":["health","lifestyle"],"slug":"reduce-anxiety-and-stress-with-the-physiological-sigh","readTime":3,"img":"https://images.pexels.com/photos/3094215/pexels-photo-3094215.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}