{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h2: \"h2\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"The tech industry is going through a recession, and many big companies have been laying off employees, causing college students and aspiring tech engineers to feel doubtful, scared, and depressed. However, as history shows, bear markets come and go, and the people who end up winning are those who constantly upskill themselves.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"This article provides insights, tips, and strategies for aspiring engineers to weather the recession and come out stronger and better.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Upskilling is Key to Success\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"One of the most critical factors in surviving a recession is upskilling. Tech is not going away, and there will always be a demand for talented engineers. Therefore, keeping yourself ahead of the competition is essential. When there is a lot of fear in the market, if you put your head down and focus on upskilling yourself, you might be able to get ahead of everyone.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Start with Data Structures and Algorithms\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The most critical factor in getting a job in tech is mastering data structures and algorithms. Most companies use it as a primary filter before you make it to the interview. Therefore, start with a basic course on data structures and algorithms and practice, practice, practice. There are platforms like LeetCode, which can help you filter problems based on difficulty. Start from the bottom and keep going to the top. Spend no more than 30 minutes on each problem. If you can’t do it in 30 minutes, look at the solution and move on.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Projects Can Make a Difference\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Projects are not crucial when it comes to college interviews, but they can make a difference. It’s good to have AI, ML, or web development projects in your portfolio. It doesn’t have to be extremely complicated. It could be a hackathon project or a college project. But just list out a few of them in your resume because you need to have something that differentiates you from the others.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Open Source Contributions are a Plus\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Open-source contributions are a plus, but they are not the best metric for standard tech companies. Every company’s stack is different, so you’ll most probably have to relearn everything you’re doing. Hence, open-source contributions and projects are usually not the best metric for standard tech companies.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Soft Skills are Also Important\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Soft skills are also crucial. These skills are the intangible qualities that make a good engineer great. Soft skills include communication skills, time management, teamwork, adaptability, and problem-solving skills. These skills can differentiate you from other candidates and make you a more attractive candidate.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Networking is Key\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Networking is crucial in the tech industry. Attend career fairs, join tech clubs, and participate in hackathons. These activities can help you connect with other people in the industry, including recruiters and hiring managers. Networking can give you a competitive advantage and help you get your foot in the door.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Don’t Give Up\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Finally, don’t give up. The tech industry has been through multiple bear markets, and we’ve recovered from each and every one of them. The people who will end up winning are those who constantly upskill themselves, network, and persevere through difficult times. Be fearful when everyone’s greedy and greedy when everyone’s fearful. The current recession is an opportunity for you to get ahead of everyone by putting your head down and focusing on upskilling yourself.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Conclusion\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The recession in tech is a challenging time for college students and aspiring engineers. However, by upskilling yourself, mastering data structures and algorithms, working on projects, developing soft skills, networking, and persevering through difficult times, you can weather the storm and come out stronger and better. The tech industry is not going away, and there will always be a demand for talented engineers. Therefore, keep upskilling yourself and stay ahead.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"There are many great programming courses available online that can help you upskill during a recession. Here are a few suggestions:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Udemy:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Udemy offers a wide variety of programming courses in different languages and frameworks, ranging from beginner to advanced levels. Some of the popular courses include “The Complete Web Developer Course,” “The Complete Python Bootcamp,” and “The Complete JavaScript Course.”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Coursera:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Coursera partners with top universities and organizations to offer online courses in various fields, including programming. They have a wide range of courses from beginner to advanced levels, and some of the popular courses include “Programming for Everybody,” “Java Programming and Software Engineering Fundamentals,” and “Python Data Structures.”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"edX:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"edX is a non-profit platform that offers online courses from top universities and organizations, including programming courses. They have a range of courses from beginner to advanced levels, and some of the popular courses include “Introduction to Computer Science,” “Python for Data Science,” and “Full-Stack Web Development with React.”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Codecademy:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Codecademy is an online learning platform that offers interactive coding lessons in various programming languages. They offer both free and paid courses, and some of the popular courses include “Learn Python 3,” “Learn HTML,” and “Learn JavaScript.”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Treehouse:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Treehouse is an online learning platform that offers courses in web development, mobile development, and game development. They offer both beginner and advanced courses, and some of the popular courses include “Web Development,” “Front End Web Development,” and “Full Stack JavaScript.”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These are just a few suggestions, but there are many more programming courses out there that can help you upskill during a recession. It’s important to research and find the courses that best fit your needs and goals.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"Surviving the Tech Recession: A Guide for College Students","metaDesc":"The tech industry is going through a recession, and many big companies have been laying off employees, causing college students and aspiring tech engineers to feel doubtful, scared, and depressed. However, as history shows, bear markets come and go, and the people who end up winning are those who constantly upskill themselves.\nThis article provides insights, tips, and strategies for aspiring engineers to weather the recession and come out stronger and better.","tags":["Recession"],"slug":"surviving-the-tech-recession-a-guide-for-college-students","readTime":5,"img":"https://images.pexels.com/photos/3861972/pexels-photo-3861972.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":4,"attributes":{"username":"Lynda","email":"lynda@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-03-24T18:26:29.905Z","updatedAt":"2023-03-29T21:46:22.119Z"}}}},"__N_SSG":true}