{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    strong: \"strong\",\n    h3: \"h3\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [\"Let’s discuss the absolute best remedy for \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \". I’m also going to talk about how to prevent \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \", but I first want to help you understand what Candida really is. And there’s some information that many people just don’t realize.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In your gut, we always talk about the microbiome, right? All the friendly bacteria Well, a good portion of the microbes in your gut are fungi. Candida is a type of fungus, and the microbiome Myco is made up of all the different funguses.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That is the friendly fungi family. And just so you know, the great majority of these fungi are not unfriendly. They work together with the bacteria to help you in many ways—for the immune system, for digestion, for other nutrients to be absorbed.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"We don’t have a fungus problem until we change these bacteria, the microbiome, okay?because it changes the environment. And I’m specifically talking about an antibiotic. One of the biggest side effects from taking antibiotics is an overgrowth of \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \", other types of yeast, or even mold.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now this is interesting because in the soil, you also have fungi and bacteria. And having this optimum ratio really supports plant growth. If you have a ratio that is not correct, you’re going to have a difficult time growing vegetables.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It may be effective against weeds but not against other plants.So in our bodies, bacteria release certain chemicals and other things that keep this fungus friendly and prevent it from turning unfriendly and becoming pathogenic.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so, if the environment changes, this fungus starts to change its relationship with us. No longer is it helping us; now it’s going to hurt us. As a result, there are five major categories of things that these bacteria produce to help keep the fungus and Candida at bay.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They make short-chain fatty acids. One of them is called butyrate. These fatty acids are produced as a byproduct of your consumption of things like vegetable fiber. From the fiber, it changes into these fatty acids, and then the colon uses them for energy.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They’re good for regulating your blood sugars, but they’re also really good as an antifungal. These bacteria also produce medium-chain triglycerides. You’ve probably heard of something like MCT oil, and that can actually help someone generate ketones, right?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, medium-chain triglycerides are also a byproduct of your own bacteria. In fact, they have antibacterial properties. They kind of keep everything friendly, and they prevent an overgrowth of the pathogens.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"That’s pretty interesting. And one unique thing about this \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \", or an overgrowth of any fungus, is that it prefers a more alkaline environment. Because ammonia is a byproduct of this fungus, or Candida.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Okay? Ammonia is extremely alkaline. On the PH scale, it’s like 11, which is super, super alkaline. And normally, the gut PH should be about 5 or 5.5. And so, understanding the PH is very important to having this balance between the good guys and the bad guys.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, if you get a Candida infection, also known as a yeast infection, or if you get this thing called the white tongue, or if it can grow in your private parts, and so on, you’ll notice that the person’s breath smells a little like ammonia, which is caused by the Candida.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"And that also tells us what the PH of the large intestine is, which should be slightly acidic, but now is alkaline, so it’s a kind of breeding ground for more \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \". Now, another thing that the bacteria produce to keep this fungus in check is bile salts. \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So bile salts are another inhibitory factor for this fungus, but not Tutka, which is another bile salt that I’ve mentioned. That’s not the one you need. You want to take a regular dose of bile salt, and you want to take that on an empty stomach.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And the bacteria make other things that keep this fungus in check, like antimicrobial peptides, and there are several others. When we take an antibiotic, we wipe out the bacteria, and now the fungus has free rein to start to do whatever they want. They take advantage of the situation and they overgrow.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"And the normal \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \" then starts developing filaments and mould-like projections and becomes the pathogenic version of this \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \" simply because we no longer have the controlling buffering factors from the bacteria.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so we talk about dysbiosis, which is an alteration in the diversity and type of bacteria. You also have dysbiosis of the fungus as well, so you can have a big problem, and now they develop as a side effect—unfriendly bacteria, not to mention resistance to the fungicide, but other problems too.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so it’s really a circular thing. One thing creates another problem, which creates another problem, and you’re trying to treat it around and around, and that’s why I want to give you the big picture so you can understand it and not get stuck in the treating of symptoms.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And if you take an antibiotic, make sure you take a probiotic at the same time so you can at least minimise the damage because it will take about 40 days to reestablish these microbes.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"And sometimes people are on antibiotics a lot longer. Get to a point where it’s going to be really hard to reestablish the normal flora that you once had. And when you have this unfriendly \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \", you greatly increase inflammation in your gut; your PH changes; you get inflammation in the gut; you get ulcerative colitis; you get irritable bowel syndrome.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It increases your risk for a lot of additional problems in your gut. Not to mention the bloating, the sugar craving (which I’ll get to later), the itchiness in the private parts, the white tongue, the fatigue, and everything else.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, I found an interesting research paper on colorectal cancer. There is a high prevalence of dysbiosis with the microbiome, the fungus family, that may predispose you to colon cancer.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I mean, if you think about it, it makes sense because both the friendly fungus and the friendly bacteria help you with your immune system. And I’m talking in a major way. Reports indicate that these other entities growing in our digestive system compose up to 80% of our immune system.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Now let’s talk about how to get rid of\"\n      }), \" \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \". Of course, the best way is to prevent it. And you can use what I’m going to tell you to prevent But if you have Candida, here are some things that will be very effective.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"The top home treatments for candida:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"1. Take a probiotic and eat foods that contain it.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"2. Avoid dairy and sweets.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"3. Cut out carbohydrates (use Healthy Keto®)\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"4. Stay clear of sugar alcohols\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"5. Use capric acid as food (coconut oil or MCT oil)\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"6. Take vegetable fibre in.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"7. Use organic herbal antibiotics (garlic, oregano oil, thyme, sage, or turmeric)\"\n      })\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"The first step is to take a probiotic, a good probiotic, to replenish the flora and keep Candida at bay.\"\n      }), \" That’s the most important thing. And you need to start on something immediately.\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"But one thing that feeds \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \" is sugar, and milk sugar is definitely sugar. So let’s talk about dairy, right? Can you make something similar to yoghurt or a Kiefer? Well, it has some lactose, unless you can find some Kiefer without lactose.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I would stay away from dairy at this point. Instead, you should probably consume some good probiotics as well as probiotic foods such as sauerkraut, kimchi, pickles, fermented vegetables, and the like.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"And also, those things are very acidic. And it’s going to change the PH, making the environment unfriendly to this pathogenic \", _jsx(_components.strong, {\n        children: \"Candida\"\n      }), \". \", _jsx(_components.strong, {\n        children: \"The other point about sugar is that candida cannot exist without glucose and other sugars.\"\n      })]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"What does that mean? \", _jsx(_components.strong, {\n        children: \"It means that if you starve this candida off by going on keto, low carb, and no sugar, it’s going to go away.\"\n      }), \" Glucose is the worst sugar, but a lot of carbs turn into glucose. So we just want to avoid carbohydrates unless they’re vegetable carbohydrates.\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"There are also other types of sugars, like sugar alcohols. If you’re on keto, you know about sugar alcohols like Xavatol. There’s also sorbitol, which I don’t recommend, and mannitol. Well, apparently those can also feed \", _jsx(_components.strong, {\n        children: \"candida\"\n      }), \", not to the same extent as glucose, but by 100%, which is like one 10th of a thousand, but still, I would avoid sugar alcohols.\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"If you’re trying to get rid of \", _jsx(_components.strong, {\n        children: \"candida\"\n      }), \". Now that you’re reducing your sugars down to zero and your carbs are going down, this means that your body is going to go into a state of ketosis. And certain ketones are in the family of butyric acid, so that can help suppress this fungal infection.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"In fact, ketones are acidic. So now we’re going to change the PH back to where we need it. and that can help as well. That’s why the ketogenic diet is so important. And capric acid in coconut oil and MCT oil can be very beneficial as an antifungal.\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"So that’s something else you could include in your diet. As far as other things that can help you, vegetable fiber. So you can have, like, salads and vegetables. It’s going to be totally fine. Have your protein, but don’t get into the sugar, alcohol, other carbs, or even fruit.\"\n      })\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"You can also include things like natural herbal antibiotics.That’s the icing on the cake. Garlic, oregano, oil, thyme, and sage are all options.Turmeric, for example, is another one.\"\n      }), \" All right, so now I think you have enough information to turn things around really fast.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But since we’re on the topic of antibiotics and natural antibiotics, if you haven’t seen this article, check it out.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"The top home treatments for candida fungus:NEVER AGAIN GET CANDIDA","metaDesc":"Today we'll talk about the best candida treatments.\n\nFungi make up a large portion of the microbes in your gut, and candida is one type of fungi. Friendly fungi help the body in a variety of ways.\n\nIt is only when we alter the environment in which our friendly bacteria and fungi live that they become a problem. Candida overgrowth, for example, is one of the most serious side effects of antibiotics.\n\nIf the candida-to-bacteria ratio is off, it can cause health problems. However, bacteria produce certain substances that aid in the control of candida.\n\nIf Candida becomes hostile, you need to know what you can do. Taking probiotics is an important step in maintaining a healthy microbiome.","tags":["candida albicans","fungus infection"],"slug":"the-top-home-treatments-for-candida-fungus-never-again-get-candida","readTime":8,"img":"https://images.pexels.com/photos/6436310/pexels-photo-6436310.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}