{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h2: \"h2\",\n    img: \"img\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Is my penis normal? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I can’t tell you how many times people ask me this in the clinic.  \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"So what determines penile length?  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, penile length is primarily determined by genetics, but there’s also factors from the environment or hormonal factors that can play a role. You could check out my article on how to increase penile size, but there’s not many things that are effective and safe that you can do easily.   \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But at the end, I will share some really simple, easy things that can help your penis appear a little bit longer. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"What to know if you’ll be measuring your penis?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And it’s important before I get into the numbers, if you are going to measure your penis or get your penis measured, realize that it is variable, even person to person.   \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It can vary depending on the state of arousal, how cold you are, how anxious you are, and it can change over a lifetime due to loss of testosterone or loss of blood flow, due to conditions like high blood pressure, diabetes, or other things that can affect blood flow to the penis.   \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"What is the average penis length?  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, when you ask that question, you have to specify, do you mean erect? Do you mean flaccid? And how was it measured? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So the largest study we have compiled data from 20 different studies looking at over 15,000 men. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When they measure both flaccid and stretched or erect and actually they’ve looked at studies and found that when you stretch your penis maximally, that’s also similar to the size you’re going to get when it’s erect \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"https://penissizestudies.files.wordpress.com/2013/12/flaccid-diagram.gif\",\n        alt: \"\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They measured it from the tip of the gland, so the very tip of the penis to the, what we call the pupil penile junction where the penis hits the bone and that’s after pushing in the fat a little bit. And so you measure it on the top side when you look down, that’s called the dorsum of the penis. And that’s where you measure it.   \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They measure it both flaccid and stretch and in some circumstances, erect. They can also measure the flaccid or erect circumference, so that means the size around the penis. And they either take that measurement at the base of the penis or at the mid-shaft of the penis. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And specifically, they only include studies in this review that had measurements done by a physician or healthcare provider, because you can imagine if someone’s measuring themselves, they’re going to have a tendency to over-inflate those numbers.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"They also didn’t include patients who had problems with their penis, like Peyronie’s disease or plaques or curvatures or anything like that. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So what they found the average flaccid length was about 3.6 inches or 9.1 cm.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When they looked at both stretched and erect length, that was between 5.1 and 5.2 inches or 13.1 or 13.2 cm. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When looking at the erect circumference or measurement around, they found it to be between 3.6 and 4.6 cm or 9.3 to 9.6 inches.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But if you look at what men think is average, most men think that six inches is the average length of the penis.   \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Misconception about the average size of the penis\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so most people think that they should be longer than the average person. If you take anything away from my articles, you should realize that penile length is not be all, end all for pleasure. I’ve written tons of articles talking about pleasure and female anatomy. And if you’ve read those, you know that women derive the majority of their pleasure from the clitoris, which is the homolog or analogous to the penis of the man. And so they get a lot of pleasure from the clitoris, which actually anatomically looks very similar to the penis, but it’s all on the inside of the vulva. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Why you shouldn’t be concerned about the size of your penis?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"While having a large penis is touted to be so important, it’s actually not the most valuable thing when it comes to pleasure. And it’s. Definitely not what you should value your worth to be. However, if you’re thinking about ways to increase penile length, of course, read my article where I go over all the options.   \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But a simple way would be to remove the hair that’s on the mons, and that will make your penis look a little bit longer. Also, if you can lose weight, that will help alleviate some of that fat that’s sitting on top of the mons, which is the area right above the penis. And your penis will then appear longer. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And bottom line, focus on pleasure and not penile size. But if you want to know the numbers, now you have them. And as always, remember to take care of yourself.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"How large is the typical penis? (It's shorter than you think!)","metaDesc":"Many scientific researchers have tried to answer the question that males — and females — worldwide want clear information about: What size is the average penis?\n\nMany people experience anxiety about whether their penis is big enough and if it will satisfy a sexual partner. This can affect a person’s self-confidence and self-image. Often, however, these fears are unfounded.\n","tags":["penis size"],"slug":"how-large-is-the-typical-penis-it-s-shorter-than-you-think","readTime":4,"img":"https://images.pexels.com/photos/4604823/pexels-photo-4604823.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":["https://bjui-journals.onlinelibrary.wiley.com/doi/10.1111/bju.13010","https://www.tandfonline.com/doi/full/10.1080/0092623X.2020.1787279"],"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}