`{"props":{"pageProps":{"categories":[{"id":1,"attributes":{"title":"Finance","slug":"finance","createdAt":"2023-01-10T18:35:47.867Z","updatedAt":"2023-01-31T18:54:38.912Z","publishedAt":"2023-01-14T18:13:46.838Z","img":"https://images.freeimages.com/images/large-previews/1e4/business-finance-money-1632104.jpg","articles":{"data":[]}}},{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","articles":{"data":[{"id":6,"attributes":{"title":"Myths and benefits of Probiotics.","slug":"myths-and-benefits-of-probiotics","createdAt":"2023-01-31T20:41:31.703Z","updatedAt":"2023-02-04T12:04:18.479Z","publishedAt":"2023-02-02T08:07:35.467Z","img":"https://images.freeimages.com/variants/HrnJrKhbkjAckDLNncuRs4TA/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","metaDesc":" Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species. Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them. Most of the probiotics end up at the end of your intestinal system, also known as the colon.\\n\\n The gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety. The bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even.\\n\\n There’s seven to 90 different strains of good bacteria inside your gut. Experts deem probiotics to be a safe supplement, yet potential risks exist. The average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit.","tags":["health","lifestyle"]}},{"id":7,"attributes":{"title":"Reduce Anxiety \\u0026 Stress with the Physiological Sigh ","slug":"reduce-anxiety-and-stress-with-the-physiological-sigh","createdAt":"2023-02-02T13:56:39.070Z","updatedAt":"2023-02-04T11:50:34.241Z","publishedAt":"2023-02-02T13:56:41.866Z","img":"https://images.pexels.com/photos/3094215/pexels-photo-3094215.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"Billions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life. \\nAnd while those are powerful, the problem is they require that people step away from the stress inducing activity. My lab and other laboratories have been very interested in developing tools that allow us to push back on stress. \\nFeel more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh is a pattern of breathing that involves two inhales followed by an extended exhale. \\nPhysiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe. \\nThere are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily. \\nAnytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale. \\nTypically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout your mouth or throughout your nose. \\nThe second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court. \\nAnd that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide. \\nSo if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm. ","tags":["health","lifestyle"]}},{"id":8,"attributes":{"title":"How to Control Stress in Real-Time","slug":"how-to-control-stress-in-real-time","createdAt":"2023-02-02T14:08:24.693Z","updatedAt":"2023-02-04T11:41:50.049Z","publishedAt":"2023-02-02T16:13:02.774Z","img":"https://images.pexels.com/photos/321576/pexels-photo-321576.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"An ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm. \\n\\nHere’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down. \\n\\nA signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up. \\n\\nThe opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume. \\n\\nThe sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down. \\n\\nSo if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous. \\n\\nThis doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV. \\n\\nBut all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time. ","tags":["health","lifestyle"]}},{"id":9,"attributes":{"title":"7 Health Benefits of Green Tea \\u0026 How to Drink it ","slug":"7-health-benefits-of-green-tea-and-how-to-drink-it","createdAt":"2023-02-03T00:43:29.954Z","updatedAt":"2023-02-04T11:49:31.849Z","publishedAt":"2023-02-03T00:43:32.258Z","img":"https://images.pexels.com/photos/1417945/pexels-photo-1417945.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \\n\\nTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \\n\\nThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \\n\\nAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \\n\\nI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that free radical damage we always talk about. \\n\\nNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of antioxidants found within green tea. \\n\\nWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \\n\\nSecond significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \\n\\nIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\\n\\n Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. \\n\\nYou’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee. Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. \\n\\nIts benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \\n\\n Point number five: green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. \\n\\nBut there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \\n\\nPoint number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing Alzheimer’s and Parkinson’s disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\\n\\nPoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \\n\\nSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \\n\\nBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \\n\\nSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \\n\\nDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  ","tags":["health","lifestyle"]}},{"id":10,"attributes":{"title":"Intermittent Fasting: Pros and cons","slug":"intermittent-fasting-pros-and-cons","createdAt":"2023-02-03T01:44:22.565Z","updatedAt":"2023-02-04T11:42:40.265Z","publishedAt":"2023-02-03T01:52:01.953Z","img":"https://images.pexels.com/photos/70497/pexels-photo-70497.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"Our bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast. \\n\\nThat’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving. \\n\\nWhen you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy. \\n\\nThere are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is. \\n\\nBecause if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting. \\n\\nThere’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is IF beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising. \\n\\nNow, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can IF help you lose weight? \\n\\nYou have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories. \\n\\nOur thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body. \\n\\nThe body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body. \\n\\nWhat can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention. \\n\\nNow, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine. \\n\\nLet’s talk about some of the shortcomings of IF. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating. \\n\\nSecond, we don’t know which form of IF is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign. \\n\\nFour. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit. ","tags":["health","lifestyle"]}},{"id":11,"attributes":{"title":"I went VEGAN For 30 Days | Here's How My Body Reacted...","slug":"i-went-vegan-for-30-days-here-s-how-my-body-reacted","createdAt":"2023-02-03T04:11:22.897Z","updatedAt":"2023-02-04T11:42:08.528Z","publishedAt":"2023-02-03T04:11:25.351Z","img":"https://images.pexels.com/photos/1351238/pexels-photo-1351238.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself.  \\nFive things I Learned to be vegan for 30 days ...\\nIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. One, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan. \\nTwo, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that. \\n\\nThree, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet. \\nFour, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual. \\nFive, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible. \\n\\nIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\\n\\nMy advice to you .....\\nIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you. In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process. \\nAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy. ","tags":["health","lifestyle"]}},{"id":12,"attributes":{"title":"Real Cause of Chronic Kidney Disease and Polycystic Kidney Disease","slug":"real-cause-of-chronic-kidney-disease-and-polycystic-kidney-disease","createdAt":"2023-02-04T13:26:37.597Z","updatedAt":"2023-02-04T13:27:07.781Z","publishedAt":"2023-02-04T13:27:07.778Z","img":"https://advancedurology.com/wp-content/uploads/2022/01/Kidney-Stone-Signs-scaled.jpg","metaDesc":"Chronic kidney disease is mainly made up of several types of problems with the kidney. One would be just chronic kidney disease, which is usually or mostly caused by diabetes. Another type of kidney disease called polycystic kidney disease. And then you have another problem with kidney stones, which relates to kidney stones. So if you have any of these problems, this article is for you, and you definitely want to read it.\\n\\n Time restricted eating, which is basically intermittent fasting, also slowed down the progression of the cysts developing in the kidney and the associated fibrosis, or the scar tissue that then comes after. It was also found that the ketogenic diet reduces the risk of kidney stones as long as the person’s on a low oxalate diet. Oxalates are things that contribute to kidney stones, and they’re in spinach, the almonds, the chocolate, kiwi.\\nMetformin has to do with regulating blood sugar by improving insulin resistance, another interesting association. Fastening strongly inhibits the fibrosis or scar tissue associated with these cysts, as well as inhibiting something called mTOR. mTOR is something in the body that can trigger the growth of cancer tumors and even cysts. Chronic kidney disease is caused by the same thing, glucose, because the root cause of this is definitely diabetes.","tags":["kidney"]}}]}}},{"id":3,"attributes":{"title":"Technology","slug":"technology","createdAt":"2023-01-14T18:15:04.177Z","updatedAt":"2023-01-31T18:58:23.498Z","publishedAt":"2023-01-14T18:15:07.213Z","img":"https://images.freeimages.com/images/large-previews/f27/satellite-dish-on-a-tree-1633151.jpg","articles":{"data":[]}}},{"id":5,"attributes":{"title":"Carreer","slug":"carreer","createdAt":"2023-01-15T10:59:33.650Z","updatedAt":"2023-01-31T18:53:09.040Z","publishedAt":"2023-01-15T10:59:36.900Z","img":"https://images.freeimages.com/images/large-previews/ac6/eating-my-own-words-1318367.jpg","articles":{"data":[]}}}],"articles":{"item":[{"id":6,"attributes":{"title":"Myths and benefits of Probiotics.","slug":"myths-and-benefits-of-probiotics","createdAt":"2023-01-31T20:41:31.703Z","updatedAt":"2023-02-04T12:04:18.479Z","publishedAt":"2023-02-02T08:07:35.467Z","img":"https://images.freeimages.com/variants/HrnJrKhbkjAckDLNncuRs4TA/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","metaDesc":" Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species. Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them. Most of the probiotics end up at the end of your intestinal system, also known as the colon.\\n\\n The gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety. The bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even.\\n\\n There’s seven to 90 different strains of good bacteria inside your gut. Experts deem probiotics to be a safe supplement, yet potential risks exist. The average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit.","tags":["health","lifestyle"],"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":6,"content":"\\u003cp\\u003eLook down at your arm. They’re on you right now. In fact, they’re everywhere. On your skin, in your mouth, on\\u0026nbsp;your teeth just crawling, breathing and farting all over the place. Come on, relax. I’m just talking about bacteria. \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd I know reflexively. You’re thinking, well, bacteria, that must be a bad thing. Not really. You have more good bacteria than bad bacteria in your body. Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species. \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNot only are these bacteria good for us, but they’re practically essential to our survival. This symbiotic relationship between us humans and good bacteria is known as mutualism. And it’s basically when both parties are benefiting from living together or existing together.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eHave you ever seen a rhino with a little bird sitting on top of its back? It’s called an oxpecker bird. That bird is eating ticks and parasites off the rhino’s back. So the bird is benefiting because it’s getting fed, the rhino is benefiting because it’s getting fewer ticks and parasites on its back.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eEverybody’s winning. The type of good bacteria I want to talk about today lives primarily within your gut. And you’ve heard the term probiotic. It’s become a mega-industry into the hundred billions of people selling supplements, selling foods that are probiotic rich.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut do we really know what the term probiotic means? Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eIn order for me to best explain how probiotics work, we need to understand how the gut works. Now, the job of the gut, when we’re talking about the small intestinal, large intestine, is to extract energy from foods, absorb certain nutrients like vitamins, minerals, and really get rid of the waste.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eWhen you’re taking probiotics, most of the probiotics end up at the end of your intestinal system, also known as the colon. Scientists have discovered that what is within your GI tract, or your gut, they call it. Microbiome.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThis is the ecosystem that contains bacteria, fungi. Those things are actually essential to your survival because, unfortunately, your digestive system can’t extract all the nutrients from all the fresh foods you’re consuming.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSo when we’re talking about the good bacteria within your gut, we’re actually talking about the bacteria that’s helping you get some nutrients from your food to improve your body’s immune function, to support the integrity of the wall of your intestines.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThis is the job of the good bacteria. I just wanted to say. Thanks, partner. Our knowledge and most of the research done on the microbiome is fairly new, with most of the studies popping up in the last 20 years.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eWithin this recent research, we found that the gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety, but it’s really a cause-and-effect dilemma.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBasically, the chicken or the egg. We’re not sure what came first, the irregularities of the microbiome or the illnesses themselves. The gut mind connection truly gets me excited. Just imagine this for a second.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even. That’s what preliminary research is showing. After hearing the links between all these serious diseases and the gut mind connection, you probably want to keep your microbiome healthy and diverse.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSo how do we do that? Well, first, you want to focus on your diet. No surprise here. Focus on eating vegetables, whole grains, legumes. These are fiber-rich foods. Fiber someone basically known rich foods as prebiotics as they serve as food for the probiotics.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNext, you want to consume probiotic rich foods like yogurt, sauerkraut, kimchi. These foods naturally contain that good bacteria we’ve been talking about. I know some people resort to taking probiotic supplements.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut I’ll touch on that shortly. Now, there have been ways you can actually hurt your microbiome. Foremost is a diet rich in refined carbohydrates. I’m talking about white breads, white pasta, white rice, sugars, even artificial sweeteners.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNext up is poor sleep. If you don’t get enough sleep. I’ve talked about the consequences of that in the past, but it also hurts your microbiome. Because guess what? The bacteria in your gut also have a circadian rhythm.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThey like for you to get quality sleep. Next is antibiotics. When you use antibiotics inappropriately or you overuse them, you actually kill off that good bacteria in your gut, and you can create an overgrowth of harmful bacteria.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eLast but not least is stress. Yes, those folks who are more stressed out and experience chronic stress for an extended period have a disruption in their microbiome, both with higher amounts of bad bacteria and lower amounts of good bacteria.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eStop getting worked up over small things. Now. Probiotic Supplements multibillion dollar industry marketers are quick to make health claims about the benefits of taking their supplements. But in reality, the picture is so much more complex.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eLike I said earlier, there’s seven to 90 different strains of good bacteria inside your gut. Increasing the number of a specific strain can have different effects depending on which condition you have.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eExperts deem probiotics to be a safe supplement, yet potential risks exist, particularly for those with weakened immune systems or illnesses like cancer. There’s been a recent study that came out of Israel showing that taking probiotics can actually harm your microbiome depending on which probiotic you take.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eMy recommendation for probiotic supplements is that the average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNow, the conditions where I have seen evidence to prove that there is a benefit are in traveler’s diarrhea antibiotic associated diarrhea, very specific conditions known as necrotizing enterocolitis in young children.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eLast but not least, those who have inflammatory bowel disease like ulcerative colitis. Notice that these are very specific instances where I reach for probiotics as a workable treatment option. For those of you considering taking a probiotic foremost, please have a conversation with your doctor or health professional on whether you should be actually doing this.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNext, I want you to not skip proven treatments for your condition and instead go for unproven treatments. Make sure you pay attention to the label. There are a few things to look out for. One, the expiration date and storage instructions.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSecond, look at the CFUs that’s the colony forming units. Look for a number bigger or at 5 billion. And finally, look to get inter-coded probiotics because those are less likely to get destroyed by the acid in your stomach.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe future of probiotics and even probiotic supplements is very interesting. The potential for unlocking so many new health secrets is really immense. I’m excited about it. You should be excited about it.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e","sample":"Look down at your arm. They’re on you right now. In fact, they’re everywhere. On your skin, in your mouth, on your teeth just crawling, breathing and farting all over the place. Come on, relax. I’m just talking about bacteria.  \\n\\nAnd I know reflexively. You’re thinking, well, bacteria, that must be a bad thing. Not really. You have more good bacteria than bad bacteria in your body. Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species.  \\n\\nNot only are these bacteria good for us, but they’re practically essential to our survival. This symbiotic relationship between us humans and good bacteria is known as mutualism. And it’s basically when both parties are benefiting from living together or existing together. \\n\\nHave you ever seen a rhino with a little bird sitting on top of its back? It’s called an oxpecker bird. That bird is eating ticks and parasites off the rhino’s back. So the bird is benefiting because it’s getting fed, the rhino is benefiting because it’s getting fewer ticks and parasites on its back. \\n\\nEverybody’s winning. The type of good bacteria I want to talk about today lives primarily within your gut. And you’ve heard the term probiotic. It’s become a mega-industry into the hundred billions of people selling supplements, selling foods that are probiotic rich. \\n\\nBut do we really know what the term probiotic means? Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them. \\n\\nIn order for me to best explain how probiotics work, we need to understand how the gut works. Now, the job of the gut, when we’re talking about the small intestinal, large intestine, is to extract energy from foods, absorb certain nutrients like vitamins, minerals, and really get rid of the waste. \\n\\nWhen you’re taking probiotics, most of the probiotics end up at the end of your intestinal system, also known as the colon. Scientists have discovered that what is within your GI tract, or your gut, they call it. Microbiome. \\n\\nThis is the ecosystem that contains bacteria, fungi. Those things are actually essential to your survival because, unfortunately, your digestive system can’t extract all the nutrients from all the fresh foods you’re consuming. \\n\\nSo when we’re talking about the good bacteria within your gut, we’re actually talking about the bacteria that’s helping you get some nutrients from your food to improve your body’s immune function, to support the integrity of the wall of your intestines. \\n\\nThis is the job of the good bacteria. I just wanted to say. Thanks, partner. Our knowledge and most of the research done on the microbiome is fairly new, with most of the studies popping up in the last 20 years. \\n\\nWithin this recent research, we found that the gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety, but it’s really a cause-and-effect dilemma. \\n\\nBasically, the chicken or the egg. We’re not sure what came first, the irregularities of the microbiome or the illnesses themselves. The gut mind connection truly gets me excited. Just imagine this for a second. \\n\\nThe bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even. That’s what preliminary research is showing. After hearing the links between all these serious diseases and the gut mind connection, you probably want to keep your microbiome healthy and diverse. \\n\\nSo how do we do that? Well, first, you want to focus on your diet. No surprise here. Focus on eating vegetables, whole grains, legumes. These are fiber-rich foods. Fiber someone basically known rich foods as prebiotics as they serve as food for the probiotics. \\n\\nNext, you want to consume probiotic rich foods like yogurt, sauerkraut, kimchi. These foods naturally contain that good bacteria we’ve been talking about. I know some people resort to taking probiotic supplements. \\n\\nBut I’ll touch on that shortly. Now, there have been ways you can actually hurt your microbiome. Foremost is a diet rich in refined carbohydrates. I’m talking about white breads, white pasta, white rice, sugars, even artificial sweeteners. \\n\\nNext up is poor sleep. If you don’t get enough sleep. I’ve talked about the consequences of that in the past, but it also hurts your microbiome. Because guess what? The bacteria in your gut also have a circadian rhythm. \\n\\nThey like for you to get quality sleep. Next is antibiotics. When you use antibiotics inappropriately or you overuse them, you actually kill off that good bacteria in your gut, and you can create an overgrowth of harmful bacteria. \\n\\nLast but not least is stress. Yes, those folks who are more stressed out and experience chronic stress for an extended period have a disruption in their microbiome, both with higher amounts of bad bacteria and lower amounts of good bacteria. \\n\\nStop getting worked up over small things. Now. Probiotic Supplements multibillion dollar industry marketers are quick to make health claims about the benefits of taking their supplements. But in reality, the picture is so much more complex. \\n\\nLike I said earlier, there’s seven to 90 different strains of good bacteria inside your gut. Increasing the number of a specific strain can have different effects depending on which condition you have. \\n\\nExperts deem probiotics to be a safe supplement, yet potential risks exist, particularly for those with weakened immune systems or illnesses like cancer. There’s been a recent study that came out of Israel showing that taking probiotics can actually harm your microbiome depending on which probiotic you take. \\n\\nMy recommendation for probiotic supplements is that the average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit. \\n\\nNow, the conditions where I have seen evidence to prove that there is a benefit are in traveler’s diarrhea antibiotic associated diarrhea, very specific conditions known as necrotizing enterocolitis in young children. \\n\\nLast but not least, those who have inflammatory bowel disease like ulcerative colitis. Notice that these are very specific instances where I reach for probiotics as a workable treatment option. For those of you considering taking a probiotic foremost, please have a conversation with your doctor or health professional on whether you should be actually doing this. \\n\\nNext, I want you to not skip proven treatments for your condition and instead go for unproven treatments. Make sure you pay attention to the label. There are a few things to look out for. One, the expiration date and storage instructions. \\n\\nSecond, look at the CFUs that’s the colony forming units. Look for a number bigger or at 5 billion. And finally, look to get inter-coded probiotics because those are less likely to get destroyed by the acid in your stomach. \\n\\nThe future of probiotics and even probiotic supplements is very interesting. The potential for unlocking so many new health secrets is really immense. I’m excited about it. You should be excited about it. \\n\\nThat’s why I’m going to be linking some further readings down below in the description. Please dive in and check out the articles that I’m recommending. Jump into my comments section if you have questions about anything I’ve said here. \\n\\nIf you have any comments or some stories you like from me to share, write it down below because I’m interested in what you have to say. And as always, stay happy and healthy. Think about those red billed oxpeckers. \\n\\nSo when we’re talking about the good bacteria inside your gut, you mind? It’s a probiotic thing. So this is actually maybe you have good bacteria in your mouth. How much bigger. Is he? That means pretty crazy. "}}},{"id":7,"attributes":{"title":"Reduce Anxiety \\u0026 Stress with the Physiological Sigh ","slug":"reduce-anxiety-and-stress-with-the-physiological-sigh","createdAt":"2023-02-02T13:56:39.070Z","updatedAt":"2023-02-04T11:50:34.241Z","publishedAt":"2023-02-02T13:56:41.866Z","img":"https://images.pexels.com/photos/3094215/pexels-photo-3094215.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"Billions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life. \\nAnd while those are powerful, the problem is they require that people step away from the stress inducing activity. My lab and other laboratories have been very interested in developing tools that allow us to push back on stress. \\nFeel more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh is a pattern of breathing that involves two inhales followed by an extended exhale. \\nPhysiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe. \\nThere are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily. \\nAnytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale. \\nTypically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout your mouth or throughout your nose. \\nThe second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court. \\nAnd that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide. \\nSo if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm. ","tags":["health","lifestyle"],"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":7,"content":"\\u003cp\\u003eBillions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eAnd while those are powerful, the problem is they require that people step away from the stress inducing activity. My\\u0026nbsp;lab and other laboratories have been very interested in developing tools that allow us to push back on stress.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eFeel\\u0026nbsp;more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh\\u0026nbsp;is a pattern of breathing that involves two inhales followed by an extended exhale.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003ePhysiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup\\u0026nbsp;of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eThere are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eAnytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eTypically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout\\u0026nbsp;your mouth or throughout\\u0026nbsp;your nose.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eThe second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eAnd that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cbr\\u003eSo if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You\\u0026nbsp;can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm.\\u0026nbsp;\\u003c/p\\u003e","sample":"Billions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life. \\nAnd while those are powerful, the problem is they require that people step away from the stress inducing activity. My lab and other laboratories have been very interested in developing tools that allow us to push back on stress. \\nFeel more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh is a pattern of breathing that involves two inhales followed by an extended exhale. \\nPhysiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe. \\nThere are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily. \\nAnytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale. \\nTypically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout your mouth or throughout your nose. \\nThe second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court. \\nAnd that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide. \\nSo if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm. "}}},{"id":8,"attributes":{"title":"How to Control Stress in Real-Time","slug":"how-to-control-stress-in-real-time","createdAt":"2023-02-02T14:08:24.693Z","updatedAt":"2023-02-04T11:41:50.049Z","publishedAt":"2023-02-02T16:13:02.774Z","img":"https://images.pexels.com/photos/321576/pexels-photo-321576.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"An ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm. \\n\\nHere’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down. \\n\\nA signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up. \\n\\nThe opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume. \\n\\nThe sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down. \\n\\nSo if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous. \\n\\nThis doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV. \\n\\nBut all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time. ","tags":["health","lifestyle"],"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":8,"content":"\\u003cp\\u003eAn ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eHere’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eA signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSo if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThis doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time.\\u0026nbsp;\\u003c/p\\u003e","sample":"An ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm. \\n\\nHere’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down. \\n\\nA signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up. \\n\\nThe opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume. \\n\\nThe sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down. \\n\\nSo if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous. \\n\\nThis doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV. \\n\\nBut all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time. "}}},{"id":9,"attributes":{"title":"7 Health Benefits of Green Tea \\u0026 How to Drink it ","slug":"7-health-benefits-of-green-tea-and-how-to-drink-it","createdAt":"2023-02-03T00:43:29.954Z","updatedAt":"2023-02-04T11:49:31.849Z","publishedAt":"2023-02-03T00:43:32.258Z","img":"https://images.pexels.com/photos/1417945/pexels-photo-1417945.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \\n\\nTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \\n\\nThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \\n\\nAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \\n\\nI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that free radical damage we always talk about. \\n\\nNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of antioxidants found within green tea. \\n\\nWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \\n\\nSecond significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \\n\\nIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\\n\\n Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. \\n\\nYou’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee. Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. \\n\\nIts benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \\n\\n Point number five: green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. \\n\\nBut there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \\n\\nPoint number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing Alzheimer’s and Parkinson’s disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\\n\\nPoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \\n\\nSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \\n\\nBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \\n\\nSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \\n\\nDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  ","tags":["health","lifestyle"],"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":9,"content":"\\u003cp\\u003eThis article\\u0026nbsp;is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read\\u0026nbsp;till the end of the article\\u0026nbsp;to get tips on how to make the healthiest cup of tea possible.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eWhat makes Green tea so good?\\u003c/h3\\u003e\\u003cp\\u003eTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some\\u0026nbsp;of those faucets have rust on them. The rust is a direct result of that \\u003cstrong\\u003efree radical \\u003c/strong\\u003edamage we always talk about.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media,\\u0026nbsp;it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of \\u003cstrong\\u003eantioxidants\\u003c/strong\\u003e found within green tea.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eHave you got stinky breath ?\\u003c/h3\\u003e\\u003cp\\u003eSecond significant point\\u0026nbsp;about green tea,\\u0026nbsp;if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque.\\u0026nbsp;So green tea also decreases the risk of developing a cavity.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eGives stable energy.\\u003c/h3\\u003e\\u003cp\\u003ePoint three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. You’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eAct as relaxing agent.\\u003c/h3\\u003e\\u003cp\\u003eAnother nutrient within green tea that works together with caffeine to boost your brain function is called Althea. Its benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eHelps in fat burning.\\u003c/h3\\u003e\\u003cp\\u003ePoint number five: Green tea can help you burn fat. Well, this is more of an individual case-by-case\\u0026nbsp;basis thing, because not all studies agree on this. But there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eDecrease the risk of you developing Alzheimer’s and Parkinson’s disease\\u003c/h3\\u003e\\u003cp\\u003ePoint number six:\\u0026nbsp;Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly\\u0026nbsp;decrease the risk of you developing \\u003cstrong\\u003eAlzheimer’s and Parkinson’s \\u003c/strong\\u003edisease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain.\\u0026nbsp;If that doesn’t encourage you to take a sip, I don’t know what will.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eIncrease your lifespan\\u003c/h3\\u003e\\u003cp\\u003ePoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid\\u0026nbsp;in the absorption of some of these nutrients. \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eFinally, don’t cheap out. Go for the good premium stuff, as it contains more of the healthy nutrients we’ve been talking about all along. I need you to know this. Don’t buy into the BS supplements that take green tea extract and claim that it has miracle health benefits.\\u0026nbsp;They do not.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe real thing is always healthier than the supplement form. As always, thanks for reading. \\u0026nbsp;\\u003c/p\\u003e","sample":"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \\n\\nTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \\n\\nThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \\n\\nAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \\n\\nI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that free radical damage we always talk about. \\n\\nNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of antioxidants found within green tea. \\n\\nWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \\n\\nSecond significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \\n\\nIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\\n\\n Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. \\n\\nYou’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee. Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. \\n\\nIts benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \\n\\n Point number five: green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. \\n\\nBut there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \\n\\nPoint number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing Alzheimer’s and Parkinson’s disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\\n\\nPoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \\n\\nSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \\n\\nBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \\n\\nSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \\n\\nDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  \\n\\nFinally, don’t cheap out. Go for the good premium stuff, as it contains more of the healthy nutrients we’ve been talking about all along. I need you to know this. Don’t buy into the BS supplements that take green tea extract and claim that it has miracle health benefits. They do not.\\n\\nThe real thing is always healthier than the supplement form. As always, thanks for watching.  "}}},{"id":10,"attributes":{"title":"Intermittent Fasting: Pros and cons","slug":"intermittent-fasting-pros-and-cons","createdAt":"2023-02-03T01:44:22.565Z","updatedAt":"2023-02-04T11:42:40.265Z","publishedAt":"2023-02-03T01:52:01.953Z","img":"https://images.pexels.com/photos/70497/pexels-photo-70497.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"Our bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast. \\n\\nThat’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving. \\n\\nWhen you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy. \\n\\nThere are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is. \\n\\nBecause if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting. \\n\\nThere’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is IF beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising. \\n\\nNow, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can IF help you lose weight? \\n\\nYou have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories. \\n\\nOur thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body. \\n\\nThe body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body. \\n\\nWhat can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention. \\n\\nNow, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine. \\n\\nLet’s talk about some of the shortcomings of IF. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating. \\n\\nSecond, we don’t know which form of IF is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign. \\n\\nFour. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit. ","tags":["health","lifestyle"],"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":10,"content":"\\u003cp\\u003eBefore we get into the pros and cons.\\u0026nbsp;And if you should do it, let’s talk about what intermittent fasting actually is. Human fasting is not a new concept by any means. Humans have been doing it for millennia. \\u003cstrong\\u003eIntermittent fasting\\u003c/strong\\u003e is just a rebranding of something thing that we have already been doing.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eOur bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not\\u0026nbsp;even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThat’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eWhen you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThere are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBecause if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThere’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is \\u003cstrong\\u003eIntermittent Fasting\\u003c/strong\\u003e\\u0026nbsp;beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNow, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can \\u003cstrong\\u003eIntermittent Fasting\\u003c/strong\\u003e\\u0026nbsp;help you lose weight?\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eYou have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eOur thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eWhat can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNow, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eLet’s talk about some of the \\u003cstrong\\u003eshortcomings\\u003c/strong\\u003e of \\u003cstrong\\u003eIntermittent Fasting\\u003c/strong\\u003e. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSecond, we don’t know which form of \\u003cstrong\\u003eIntermittent Fasting\\u003c/strong\\u003e\\u0026nbsp;is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eFour. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut now does this benefit still hold up 1, 2,3 ....10 years down the line? We don’t know that yet,\\u0026nbsp;when it comes to if and five, it’s not easy for everybody to fight off those cravings on fasting days. All right, my final take on \\u003cstrong\\u003eIntermittent Fasting\\u003c/strong\\u003e, I think it’s a great concept with some really promising medical research behind it.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI think that if you can skip a meal, you can skip a breakfast here and there, you’re going to see some benefits. Does that mean you should go on this very rigid diet where you’re doing the five and two or 16/8?\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI don’t think we should quite make this a religious rigorous part of our everyday life because we don’t know the long-term consequences of it. But in a society that’s prone to overeating, a fasting day won’t hurt and will probably help, as always, stay happy and healthy.\\u0026nbsp;\\u003c/p\\u003e","sample":"Before we get into the pros and cons. And if you should do it, let’s talk about what intermittent fasting actually is. Human fasting is not a new concept by any means. Humans have been doing it for millennia. Intermittent fasting is just a rebranding of something thing that we have already been doing. \\n\\nOur bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast. \\n\\nThat’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving. \\n\\nWhen you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy. \\n\\nThere are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is. \\n\\nBecause if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting. \\n\\nThere’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is IF beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising. \\n\\nNow, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can IF help you lose weight? \\n\\nYou have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories. \\n\\nOur thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body. \\n\\nThe body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body. \\n\\nWhat can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention. \\n\\nNow, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine. \\n\\nLet’s talk about some of the shortcomings of IF. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating. \\n\\nSecond, we don’t know which form of IF is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign. \\n\\nFour. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit. \\n\\nBut now does this benefit still hold up 1, 2,3 ....10 years down the line? We don’t know that yet, when it comes to if and five, it’s not easy for everybody to fight off those cravings on fasting days. All right, my final take on IF, I think it’s a great concept with some really promising medical research behind it. \\n\\nI think that if you can skip a meal, you can skip a breakfast here and there, you’re going to see some benefits. Does that mean you should go on this very rigid diet where you’re doing the five and two or 16/8? \\n\\nI don’t think we should quite make this a religious rigorous part of our everyday life because we don’t know the long-term consequences of it. But in a society that’s prone to overeating, a fasting day won’t hurt and will probably help, as always, stay happy and healthy. "}}},{"id":11,"attributes":{"title":"I went VEGAN For 30 Days | Here's How My Body Reacted...","slug":"i-went-vegan-for-30-days-here-s-how-my-body-reacted","createdAt":"2023-02-03T04:11:22.897Z","updatedAt":"2023-02-04T11:42:08.528Z","publishedAt":"2023-02-03T04:11:25.351Z","img":"https://images.pexels.com/photos/1351238/pexels-photo-1351238.jpeg?auto=compress\\u0026cs=tinysrgb\\u0026w=1260\\u0026h=750\\u0026dpr=1","metaDesc":"Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself.  \\nFive things I Learned to be vegan for 30 days ...\\nIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. One, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan. \\nTwo, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that. \\n\\nThree, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet. \\nFour, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual. \\nFive, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible. \\n\\nIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\\n\\nMy advice to you .....\\nIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you. In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process. \\nAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy. ","tags":["health","lifestyle"],"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":11,"content":"\\u003cp\\u003eFour weeks of going vegan are in the books and I’m so happy I met my goal.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eJust to clarify, there are many reasons people follow a vegan diet, moral, ethical, environmental. But the information I’m going to cover here is only what’s related to nutrition and health.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eIs\\u0026nbsp;vegan\\u0026nbsp;Diet\\u0026nbsp;healty?\\u0026nbsp;\\u003c/h3\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eA vegan diet can be a very healthy diet, whether you’re young, old, somewhere in between, pregnant, nonpregnant breastfeeding, not breastfeeding. \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBasically, it’s applicable to all life stages. The reason I put that word can in there you can follow a vegan diet, eat vegan burgers with sugary sodas, with gummy\\u0026nbsp;candies, still be vegan. And that’s not really healthy, right? \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd I have to say it’s not the only healthy diet out there. Some of the loudest voices in the vegan community are quick to say that veganism is the only healthy option. That’s not the case. There are several other healthy diets out there.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eFor example, the Mediterranean diet that I’m personally a fan of that are just as healthy, if not healthier than the vegan diet. \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eWhat I tell my patients?\\u003c/h3\\u003e\\u003cp\\u003eI have to be honest and admit that I rarely recommend veganism as my 1st option. I know that it’s a restrictive diet, and we know restrictive diets have high failure rates. Plus, the benefits of a vegan diet aren’t that much better than some of the other alternatives that are simpler to follow.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eWhen I recommend a diet, I’m trying to create\\u0026nbsp;the healthiest diet, but also one that’s feasible for my patients to face without disrupting their lives. On the other hand, if one of my patients comes in and wants to follow a vegan diet, I’m totally in support of that.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI just have to make sure that they’re adequately planning their meals, they’re supplementing when need be, checking their blood tests, and ideally, having some guidance either for myself or a nutritionist.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eWhat the research says?\\u003c/h3\\u003e\\u003cp\\u003eThe research behind health benefits of following a vegan diet is substantial and high quality. If you’re following the standard American diet and then switch over to a vegan diet, you’re going to see an improvement in chronic diseases like diabetes, heart disease, strokes, even an extension of life in some cases.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd what’s most interesting is when we add some animal products into the mix, those outcomes still hold true. That’s why what I recommend to my patients is a plant focused diet, meaning that they should get the majority of their calories from plants, fruits, vegetables, legumes, nuts, seeds, healthy fats, and a moderate amount of poultry and fish with a minimal amount of red meat.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eIn fact, that’s the diet I follow and recommend to my family. The field of nutrition research is ever changing. And as we get more information, more quality studies, we doctors and nutritionists alike, are going to give better recommendations when it comes to a vegan diet, a plant focused diet, all of this is susceptible to change.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut it’s important that we make the best decisions with the knowledge that we have on hand. The one thing that I can say with 100% certainty is there’s no such thing as a miracle diet for everybody. \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eChallenge begins ... Day 1\\u003c/h3\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eOn day one, I was excited.I was like, if I could tackle keto, I can definitely do vegan. First point at which I had a little bit of hesitation was when I ordered my first at home delivery. Buffalo cauliflower bites with some kind of not real mayo.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd this is. A wrap with vegan cheese and unchicken. I was having second thoughts, and that’s not like me. If I set a goal for myself, I’m going to do everything in my power to meet that goal. But for some reason, when sticking to this vegan diet, I was concerned about so many things.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThe following week, I was leaving for MIT for the leadership conference. I was worried if they’re going to have vegan options available for me. I was then traveling to Miami for a few days. All these worries started bubbling in my head and I was really wondering, can I stick to vegan this entire month?\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eMy obstacles\\u003c/h3\\u003e\\u003cp\\u003eOne of the first obstacles I ran into on the vegan diet was. Under eating calories. Now, I’m partially to blame here because I didn’t prep well.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd even at the writing\\u0026nbsp;of this article, I said the healthy way to follow a vegan diet is to adequately plan your meals. For the first two weeks, I have to be honest; I didn’t have much of an appetite.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI’m not a huge fan of just eating vegetables and rice and beans, so I didn’t have tremendous portions. And because of that, I was calorie deficient. I actually noticed some weight loss helped me tremendously to make up this calorie deficit is eating some of these snacks that Thrive sent over.\\u0026nbsp;If I didn’t have these snacks, I’d be under eating calories the majority of the time.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eThis Can’t be good...\\u003c/h3\\u003e\\u003cp\\u003eOne of the biggest problems I ran into this is really embarrassing to say in the article. From day one until the last day of the diet, I was having tremendous gas and bloating.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eIt’s so embarrassing to say. I mean, think about this. I fly on planes; I interact with patients for long periods of time. I sit at conferences. I can’t just be sitting there flatulent. I did try to isolate some ingredients to see which ones were causing this gas and bloating combination for me, but I couldn’t find out what it was.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI normally eat brown rice. I normally eat vegetables and fruits and beans. I expect them to go away after four weeks, but no, they stuck around. I would have to say that the vegan diet probably won’t work for me long term.\\u0026nbsp;I just can’t sit there with my stomach going and me wanting to pass gas the entire time. God, that’s embarrassing.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003e\\u0026nbsp;A\\u0026nbsp;pleasant\\u0026nbsp;surprise\\u003c/h3\\u003e\\u003cp\\u003eWhat I didn’t know about veganism is that there are a ton of up-and-coming options for those who aren’t used to eating vegan.\\u0026nbsp;There are specialty restaurants that just offer vegan foods with no animal products that remind you of foods that you may have eaten when you ate animal products. And I thought that was really cool. On top of that, a lot of these restaurants and even some of the products I got from Thrive tasted delicious because of the sauces.\\u0026nbsp;Vegan sauces are on point.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eI can’t even ...\\u003c/h3\\u003e\\u003cp\\u003eI’ve talked about on this channel of decision fatigue because you’re constantly making decisions and you’re using your willpower.\\u0026nbsp;It’s actually a finite resource. What I noticed while I was following the vegan diet was that I lost the drive to go to the gym. My work ethic actually suffered because I was putting such a strong emphasis on sticking to vegan when there were so many temptations and there were things I wanted to eat.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI didn’t want to hop on my spin bike in my bedroom. I didn’t want to go to the gym with my friends. This is really unlike me, and it’s an obstacle I didn’t actually expect to face when I went to the gym.\\u0026nbsp;I lifted fine. Getting to the gym was the actual struggle.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eI fail [Or Not]....\\u003c/h3\\u003e\\u003cp\\u003eAt the time, I least expected it. Disaster struck. I got sick. I started coughing. I got a sore throat. I got a low grade fever. I went to see the doctor.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI weighed the pros and cons of starting antibiotics, of stopping the vegan diet. I decided to stick with conservative treatment and treat it like a viral illness. One of my favorite hacks to treat viral illnesses.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eActually, the symptoms of the viral illnesses are green tea with manuka honey. Patrol members, be advised. Apparently, honey is not vegan. What? I guess honey is an animal product, but, man; I didn’t force the bees to make the honey.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThey make it on their own. We didn’t have to milk them for it. Wait. If you want to disqualify my four-week vegan challenge because I ate honey, so be it.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003ePlease don’t hate me …\\u003c/h3\\u003e\\u003cp\\u003eI got to say, at this point, I was rolling.\\u0026nbsp;I was starting getting into the vegan vibe. I was trying out new restaurants. I was sampling all the delicious foods that I got from Thrive, and I was excited. I was getting close to the finish line.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut I will say, one of the hardest things with the vegan diet is peer pressure. I mean, when I went out to eat with my friends, they were annoyed, to say the least, that we had to choose the restaurant.\\u0026nbsp;Based on my eating preferences, I did a decent job at trying to pick out vegan options in not so vegan places.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eIn retrospect …\\u003c/h3\\u003e\\u003cp\\u003eHonestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself. \\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eFive things I Learned to be vegan for 30 days ...\\u003c/h3\\u003e\\u003cp\\u003eIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. \\u003cstrong\\u003eOne\\u003c/strong\\u003e, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cstrong\\u003eTwo\\u003c/strong\\u003e, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cstrong\\u003eThree\\u003c/strong\\u003e, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cstrong\\u003eFour\\u003c/strong\\u003e, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cstrong\\u003eFive\\u003c/strong\\u003e, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eMy advice to you .....\\u003c/h3\\u003e\\u003cp\\u003eIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you.\\u0026nbsp;In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy.\\u0026nbsp;\\u003c/p\\u003e","sample":"Four weeks of going vegan are in the books and I’m so happy I met my goal. \\n\\nJust to clarify, there are many reasons people follow a vegan diet, moral, ethical, environmental. But the information I’m going to cover here is only what’s related to nutrition and health. \\n\\nIs vegan Diet healty? \\n\\nA vegan diet can be a very healthy diet, whether you’re young, old, somewhere in between, pregnant, nonpregnant breastfeeding, not breastfeeding.  \\n\\nBasically, it’s applicable to all life stages. The reason I put that word can in there you can follow a vegan diet, eat vegan burgers with sugary sodas, with gummy candies, still be vegan. And that’s not really healthy, right?  \\n\\nAnd I have to say it’s not the only healthy diet out there. Some of the loudest voices in the vegan community are quick to say that veganism is the only healthy option. That’s not the case. There are several other healthy diets out there. \\n\\nFor example, the Mediterranean diet that I’m personally a fan of that are just as healthy, if not healthier than the vegan diet.  \\n\\nWhat I tell my patients?\\n\\nI have to be honest and admit that I rarely recommend veganism as my 1st option. I know that it’s a restrictive diet, and we know restrictive diets have high failure rates. Plus, the benefits of a vegan diet aren’t that much better than some of the other alternatives that are simpler to follow. \\n\\nWhen I recommend a diet, I’m trying to create the healthiest diet, but also one that’s feasible for my patients to face without disrupting their lives. On the other hand, if one of my patients comes in and wants to follow a vegan diet, I’m totally in support of that. \\n\\nI just have to make sure that they’re adequately planning their meals, they’re supplementing when need be, checking their blood tests, and ideally, having some guidance either for myself or a nutritionist. \\n\\nWhat the research says?\\n\\nThe research behind health benefits of following a vegan diet is substantial and high quality. If you’re following the standard American diet and then switch over to a vegan diet, you’re going to see an improvement in chronic diseases like diabetes, heart disease, strokes, even an extension of life in some cases. \\n\\nAnd what’s most interesting is when we add some animal products into the mix, those outcomes still hold true. That’s why what I recommend to my patients is a plant focused diet, meaning that they should get the majority of their calories from plants, fruits, vegetables, legumes, nuts, seeds, healthy fats, and a moderate amount of poultry and fish with a minimal amount of red meat. \\n\\nIn fact, that’s the diet I follow and recommend to my family. The field of nutrition research is ever changing. And as we get more information, more quality studies, we doctors and nutritionists alike, are going to give better recommendations when it comes to a vegan diet, a plant focused diet, all of this is susceptible to change. \\n\\nBut it’s important that we make the best decisions with the knowledge that we have on hand. The one thing that I can say with 100% certainty is there’s no such thing as a miracle diet for everybody.  \\n\\nChallenge begins ... Day 1\\n\\nOn day one, I was excited.I was like, if I could tackle keto, I can definitely do vegan. First point at which I had a little bit of hesitation was when I ordered my first at home delivery. Buffalo cauliflower bites with some kind of not real mayo. \\n\\nAnd this is. A wrap with vegan cheese and unchicken. I was having second thoughts, and that’s not like me. If I set a goal for myself, I’m going to do everything in my power to meet that goal. But for some reason, when sticking to this vegan diet, I was concerned about so many things. \\n\\nThe following week, I was leaving for MIT for the leadership conference. I was worried if they’re going to have vegan options available for me. I was then traveling to Miami for a few days. All these worries started bubbling in my head and I was really wondering, can I stick to vegan this entire month? \\n\\nMy obstacles\\n\\nOne of the first obstacles I ran into on the vegan diet was. Under eating calories. Now, I’m partially to blame here because I didn’t prep well. \\n\\nAnd even at the writing of this article, I said the healthy way to follow a vegan diet is to adequately plan your meals. For the first two weeks, I have to be honest; I didn’t have much of an appetite. \\n\\nI’m not a huge fan of just eating vegetables and rice and beans, so I didn’t have tremendous portions. And because of that, I was calorie deficient. I actually noticed some weight loss helped me tremendously to make up this calorie deficit is eating some of these snacks that Thrive sent over. If I didn’t have these snacks, I’d be under eating calories the majority of the time.\\n\\nThis Can’t be good...\\n\\nOne of the biggest problems I ran into this is really embarrassing to say in the article. From day one until the last day of the diet, I was having tremendous gas and bloating. \\n\\nIt’s so embarrassing to say. I mean, think about this. I fly on planes; I interact with patients for long periods of time. I sit at conferences. I can’t just be sitting there flatulent. I did try to isolate some ingredients to see which ones were causing this gas and bloating combination for me, but I couldn’t find out what it was. \\n\\nI normally eat brown rice. I normally eat vegetables and fruits and beans. I expect them to go away after four weeks, but no, they stuck around. I would have to say that the vegan diet probably won’t work for me long term. I just can’t sit there with my stomach going and me wanting to pass gas the entire time. God, that’s embarrassing.\\n\\n A pleasant surprise\\n\\nWhat I didn’t know about veganism is that there are a ton of up-and-coming options for those who aren’t used to eating vegan. There are specialty restaurants that just offer vegan foods with no animal products that remind you of foods that you may have eaten when you ate animal products. And I thought that was really cool. On top of that, a lot of these restaurants and even some of the products I got from Thrive tasted delicious because of the sauces. Vegan sauces are on point.\\n\\nI can’t even ...\\n\\nI’ve talked about on this channel of decision fatigue because you’re constantly making decisions and you’re using your willpower. It’s actually a finite resource. What I noticed while I was following the vegan diet was that I lost the drive to go to the gym. My work ethic actually suffered because I was putting such a strong emphasis on sticking to vegan when there were so many temptations and there were things I wanted to eat. \\n\\nI didn’t want to hop on my spin bike in my bedroom. I didn’t want to go to the gym with my friends. This is really unlike me, and it’s an obstacle I didn’t actually expect to face when I went to the gym. I lifted fine. Getting to the gym was the actual struggle.\\n\\nI fail [Or Not]....\\n\\nAt the time, I least expected it. Disaster struck. I got sick. I started coughing. I got a sore throat. I got a low grade fever. I went to see the doctor. \\n\\nI weighed the pros and cons of starting antibiotics, of stopping the vegan diet. I decided to stick with conservative treatment and treat it like a viral illness. One of my favorite hacks to treat viral illnesses. \\n\\nActually, the symptoms of the viral illnesses are green tea with manuka honey. Patrol members, be advised. Apparently, honey is not vegan. What? I guess honey is an animal product, but, man; I didn’t force the bees to make the honey. \\n\\nThey make it on their own. We didn’t have to milk them for it. Wait. If you want to disqualify my four-week vegan challenge because I ate honey, so be it.\\n\\nPlease don’t hate me …\\n\\nI got to say, at this point, I was rolling. I was starting getting into the vegan vibe. I was trying out new restaurants. I was sampling all the delicious foods that I got from Thrive, and I was excited. I was getting close to the finish line. \\n\\nBut I will say, one of the hardest things with the vegan diet is peer pressure. I mean, when I went out to eat with my friends, they were annoyed, to say the least, that we had to choose the restaurant. Based on my eating preferences, I did a decent job at trying to pick out vegan options in not so vegan places.\\n\\nIn retrospect …\\n\\nHonestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself.  \\n\\nFive things I Learned to be vegan for 30 days ...\\n\\nIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. One, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan. \\n\\nTwo, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that. \\n\\nThree, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet. \\n\\nFour, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual. \\n\\nFive, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible. \\n\\nIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\\n\\nMy advice to you .....\\n\\nIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you. In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process. \\n\\nAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy. "}}},{"id":12,"attributes":{"title":"Real Cause of Chronic Kidney Disease and Polycystic Kidney Disease","slug":"real-cause-of-chronic-kidney-disease-and-polycystic-kidney-disease","createdAt":"2023-02-04T13:26:37.597Z","updatedAt":"2023-02-04T13:27:07.781Z","publishedAt":"2023-02-04T13:27:07.778Z","img":"https://advancedurology.com/wp-content/uploads/2022/01/Kidney-Stone-Signs-scaled.jpg","metaDesc":"Chronic kidney disease is mainly made up of several types of problems with the kidney. One would be just chronic kidney disease, which is usually or mostly caused by diabetes. Another type of kidney disease called polycystic kidney disease. And then you have another problem with kidney stones, which relates to kidney stones. So if you have any of these problems, this article is for you, and you definitely want to read it.\\n\\n Time restricted eating, which is basically intermittent fasting, also slowed down the progression of the cysts developing in the kidney and the associated fibrosis, or the scar tissue that then comes after. It was also found that the ketogenic diet reduces the risk of kidney stones as long as the person’s on a low oxalate diet. Oxalates are things that contribute to kidney stones, and they’re in spinach, the almonds, the chocolate, kiwi.\\nMetformin has to do with regulating blood sugar by improving insulin resistance, another interesting association. Fastening strongly inhibits the fibrosis or scar tissue associated with these cysts, as well as inhibiting something called mTOR. mTOR is something in the body that can trigger the growth of cancer tumors and even cysts. Chronic kidney disease is caused by the same thing, glucose, because the root cause of this is definitely diabetes.","tags":["kidney"],"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":12,"content":"\\u003cp\\u003eToday I want to share some really important information related to \\u003cstrong\\u003echronic kidney disease\\u003c/strong\\u003e. \\u003cstrong\\u003echronic kidney disease\\u003c/strong\\u003e is mainly made up of several types of problems with the kidney. One would be just chronic kidney disease\\u0026nbsp;which is usually or mostly caused by diabetes.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd then you have another type of kidney disease called \\u003cstrong\\u003epolycystic kidney disease\\u003c/strong\\u003e. I’m going to be talking about that. And then you have another problem with the kidney, which relates to kidney stones.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eWe’ll mention that as well. So if you have any of these problems, this article\\u0026nbsp;is for you, and you definitely want to read\\u0026nbsp;it because I want to share some new information, new research on this topic. When someone has end stage renal disease, 10% of the time it’s going to be related to this polycystic kidney disease.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd that’s a situation where you have all these fluid filled sacs around the kidney. It kind of takes over. And then the more cyst you have, the less ability for you to filter. And then now you can’t filter protein.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSo that starts going up in the blood and you start getting fluid retention and you get a lot of problems. \\u003cstrong\\u003eAnd polycystic kidney disease is mainly thought of as a genetic problem. And until recently, like 2019, the thought was you really can’t do anything about genetic diseases, but you actually can.\\u0026nbsp;\\u003c/strong\\u003e\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd this is actually quite fascinating, because if someone has these cysts that are overwhelming the kidney, pretty much, they’re just going to wait\\u0026nbsp;until they get on dialysis or they get a kidney transplant.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThere just wasn’t any nontoxic solution. And this is the problem with the kidney and the liver, especially,\\u0026nbsp;drugs tend to add more toxicity to these organs, and so there are too many side effects. So with the polycystic kidney disease, you have increased risk of infection.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eYou have urinary bleeding. You have reduced function of the kidney, which the kidney is a filter, and it filters out the blood, and the person usually has high blood pressure. So in 2019, there was a study done that found that the ketogenic diet actually halted and reversed polycystic kidney disease in mice.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd so if you have a pet mouse or a gerbil or a rat that has this polycystic kidney eat disease problem, definitely go low carb. But they also found that time restricted eating, which is basically intermittent fasting, also created a similar effect.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eIt slowed down the progression of the cysts developing in the kidney and the associated fibrosis, or the scar tissue that then comes after. It was also found that the ketogenic diet reduces the risk of kidney stones as long as the person’s on a low oxalate diet.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eOxalates are things that contribute to kidney stones, and they’re in the spinach, the almonds, the chocolate, kiwi. But as long as you avoid those things and you’re on the ketogenic diet and you’re drinking enough water, like 2.5 liters at least a fluid per day, I think you’re going to be in pretty good shape.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThis is what they found in the study. Okay. And I want to really make sure you get this one point. These cysts that are developing in the kidney are absorbing glucose, and then, of course, with the glucose comes the water.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSo these cysts are fluid-filled\\u0026nbsp;sacs that have water in them. And of course, when they absorb water, they get bigger. But the surprising thing that they found and so if you checked out, check back in right now, because this is the most important part of the the\\u0026nbsp;article\\u0026nbsp;is this.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThese cysts not only absorb glucose, but they are dependent on glucose. In other words, they can only grow if they have glucose. And of course, because this was a medical paper, they went on to say that maybe drug companies can come up with a drug to block glucose to help reduce this \\u003cstrong\\u003epolycystic kidney disease\\u003c/strong\\u003e. Of course, I have a different viewpoint. Why don’t we just not consume glucose in the diet? Okay, go on a low carb diet, because it’s been found that the ketogenic diet may improve this condition.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eSo that’s pretty interesting, because if you can block sugar or avoid sugar, you can actually shrink these cysts. And then, of course, I got to thinking, there’s the other part\\u0026nbsp;of the body, too. You have cyst in the liver, and you even have baker cyst that could be in the back of the knee.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd I’ve already experienced if you get the person off sugar, those tend to go away. But then I actually kind of looked at the cyst in the liver, and I found that one remedy for that is \\u003cstrong\\u003emetformin\\u003c/strong\\u003e.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003e\\u0026nbsp;What does metformin do?\\u0026nbsp;\\u003c/h3\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eIt actually has to do with regulating blood sugar by improving insulin resistance, another interesting association. And you can even improve the assist by taking ketones. So apparently, ketones are pretty powerful in dealing with the assists, which make a lot of sense since they’re dependent on glucose.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd the only way your body can generate ketones is if you lower insulin and lower glucose. But apparently, you can even take ketones, which I’m not recommending. But that’s one way to reduce these cysts.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eNow, there’s actually three ways to get ketones in the body. One is a low carb diet. The other is to take ketones. And the third way is to fast, forcing your body to make ketones from your own fat. And so apparently, fasting strongly inhibits the fibrosis or scar tissue that are associated with these cysts, as well as inhibiting something called \\u003cstrong\\u003emTOR\\u003c/strong\\u003e.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003ch3\\u003eNow, what is mTOR?\\u003c/h3\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u003cstrong\\u003emTOR\\u003c/strong\\u003e is something in the body that can trigger the growth of cancer tumors and even cysts. So anything that reduces \\u003cstrong\\u003emTOR\\u003c/strong\\u003e is a really good thing, especially if you have kidney problems and fasting is a potent stimulator, but there’s some other things, too. Curcumin also reduces mTOR. Resveratrol will also reduce it. And the EG⁠C⁠G in green tea, as well as querseitin and berberine, these are all potent natural remedies to lower mTOR to help kidney cysts.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eBut what about other types of kidney disease, chronic kidney disease? Well, most of that is caused by the same thing, glucose, because the root cause of this is definitely diabetes. So anything related to high sugar, like whether you have a prediabetic situation or even insulin resistance, could contribute to a worsening of the kidney function.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eThere’s an interesting protein I won’t get into the biochemical name, but there’s an interesting protein that triggers another protein that then goes round and round and round that leads to damage in the kidney.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnd I’m going to put down a link down below of a new discovery of an inhibitor of that specific protein that they’re actually using a drug to do it to potentially halt or stop kidney disease. So this protein that they’re trying to inhibit is called TRPC5.\\u0026nbsp;Not that you needed to know that, but I did a search on if there’re any inhibitors to this protein, and I found that there is Curcumin and Rise veritrol. So if you have chronic kidney disease, regardless of what caused it, this is what I would do.\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eI would definitely take these phyto nutrients from these herbs. I would also go on a low oxalate ketogenic diet, so you’re not taking too many almonds or spinach or almond flour or kiwis. And if you added intermittent fasting with that, you’d come up with a really good program to take those cysts or take whatever damage in the kidney you have and hopefully bring it in the reverse.\\u003c/p\\u003e\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\u003cp\\u003eAnyway, I wanted to share that information with you, especially if you have a kidney problem or know of a person who has a problem. And if you hear anywhere that the ketogenic diet is really bad for the kidneys, I think you should read\\u0026nbsp;this article\\u0026nbsp;right here.\\u0026nbsp;\\u003c/p\\u003e","sample":"Today I want to share some really important information related to chronic kidney disease. Chronic kidney disease is mainly made up of several types of problems with the kidney. One would be just chronic kidney disease which is usually or mostly caused by diabetes. \\n\\n And then you have another type of kidney disease called polycystic kidney disease. I’m going to be talking about that. And then you have another problem with the kidney, which relates to kidney stones. \\n\\nWe’ll mention that as well. So if you have any of these problems, this article is for you, and you definitely want to read it because I want to share some new information, new research on this topic. When someone has end stage renal disease, 10% of the time it’s going to be related to this polycystic kidney disease. \\n\\nAnd that’s a situation where you have all these fluid filled sacs around the kidney. It kind of takes over. And then the more cyst you have, the less ability for you to filter. And then now you can’t filter protein. \\n\\nSo that starts going up in the blood and you start getting fluid retention and you get a lot of problems. And polycystic kidney disease is mainly thought of as a genetic problem. And until recently, like 2019, the thought was you really can’t do anything about genetic diseases, but you actually can. \\n\\nAnd this is actually quite fascinating, because if someone has these cysts that are overwhelming the kidney, pretty much, they’re just going to wait until they get on dialysis or they get a kidney transplant. \\n\\nThere just wasn’t any nontoxic solution. And this is the problem with the kidney and the liver, especially, drugs tend to add more toxicity to these organs, and so there are too many side effects. So with the polycystic kidney disease, you have increased risk of infection. \\n\\nYou have urinary bleeding. You have reduced function of the kidney, which the kidney is a filter, and it filters out the blood, and the person usually has high blood pressure. So in 2019, there was a study done that found that the ketogenic diet actually halted and reversed polycystic kidney disease in mice. \\n\\nAnd so if you have a pet mouse or a gerbil or a rat that has this polycystic kidney eat disease problem, definitely go low carb. But they also found that time restricted eating, which is basically intermittent fasting, also created a similar effect. \\n\\nIt slowed down the progression of the cysts developing in the kidney and the associated fibrosis, or the scar tissue that then comes after. It was also found that the ketogenic diet reduces the risk of kidney stones as long as the person’s on a low oxalate diet. \\n\\nOxalates are things that contribute to kidney stones, and they’re in the spinach, the almonds, the chocolate, kiwi. But as long as you avoid those things and you’re on the ketogenic diet and you’re drinking enough water, like 2.5 liters at least a fluid per day, I think you’re going to be in pretty good shape. \\n\\nThis is what they found in the study. Okay. And I want to really make sure you get this one point. These cysts that are developing in the kidney are absorbing glucose, and then, of course, with the glucose comes the water. \\n\\nSo these cysts are fluid-filled sacs that have water in them. And of course, when they absorb water, they get bigger. But the surprising thing that they found and so if you checked out, check back in right now, because this is the most important part of the the article is this. \\n\\nThese cysts not only absorb glucose, but they are dependent on glucose. In other words, they can only grow if they have glucose. And of course, because this was a medical paper, they went on to say that maybe drug companies can come up with a drug to block glucose to help reduce this polycystic kidney disease. Of course, I have a different viewpoint. Why don’t we just not consume glucose in the diet? Okay, go on a low carb diet, because it’s been found that the ketogenic diet may improve this condition. \\n\\nSo that’s pretty interesting, because if you can block sugar or avoid sugar, you can actually shrink these cysts. And then, of course, I got to thinking, there’s the other part of the body, too. You have cyst in the liver, and you even have baker cyst that could be in the back of the knee. \\n\\nAnd I’ve already experienced if you get the person off sugar, those tend to go away. But then I actually kind of looked at the cyst in the liver, and I found that one remedy for that is metformin. What does metformin do? \\n\\nIt actually has to do with regulating blood sugar by improving insulin resistance, another interesting association. And you can even improve the assist by taking ketones. So apparently, ketones are pretty powerful in dealing with the assists, which make a lot of sense since they’re dependent on glucose. \\n\\nAnd the only way your body can generate ketones is if you lower insulin and lower glucose. But apparently, you can even take ketones, which I’m not recommending. But that’s one way to reduce these cysts. \\n\\nNow, there’s actually three ways to get ketones in the body. One is a low carb diet. The other is to take ketones. And the third way is to fast, forcing your body to make ketones from your own fat. And so apparently, fasting strongly inhibits the fibrosis or scar tissue that are associated with these cysts, as well as inhibiting something called mTOR. \\n\\nNow, what is mTOR? mTOR is something in the body that can trigger the growth of cancer tumors and even cysts. So anything that reduces mTOR is a really good thing, especially if you have kidney problems and fasting is a potent stimulator, but there’s some other things, too. Curcumin also reduces mTOR. Resveratrol will also reduce it. And the EG⁠C⁠G in green tea, as well as querseitin and berberine, these are all potent natural remedies to lower mTOR to help kidney cysts. \\n\\nBut what about other types of kidney disease, chronic kidney disease? Well, most of that is caused by the same thing, glucose, because the root cause of this is definitely diabetes. So anything related to high sugar, like whether you have a prediabetic situation or even insulin resistance, could contribute to a worsening of the kidney function. \\n\\nThere’s an interesting protein I won’t get into the biochemical name, but there’s an interesting protein that triggers another protein that then goes round and round and round that leads to damage in the kidney. \\n\\nAnd I’m going to put down a link down below of a new discovery of an inhibitor of that specific protein that they’re actually using a drug to do it to potentially halt or stop kidney disease. So this protein that they’re trying to inhibit is called TRPC5. Not that you needed to know that, but I did a search on if there’re any inhibitors to this protein, and I found that there is Curcumin and Rise veritrol. So if you have chronic kidney disease, regardless of what caused it, this is what I would do. \\n\\nI would definitely take these phyto nutrients from these herbs. I would also go on a low oxalate ketogenic diet, so you’re not taking too many almonds or spinach or almond flour or kiwis. And if you added intermittent fasting with that, you’d come up with a really good program to take those cysts or take whatever damage in the kidney you have and hopefully bring it in the reverse.\\n\\n Anyway, I wanted to share that information with you, especially if you have a kidney problem or know of a person who has a problem. And if you hear anywhere that the ketogenic diet is really bad for the kidneys, I think you should read this article right here. "}}}],"pagination":{"page":1,"pageSize":25,"pageCount":1,"total":7}}},"__N_SSG":true},"page":"/","query":{},"buildId":"KtyoDy0lDqE0Jf8a2Akqq","isFallback":false,"gsp":true,"scriptLoader":[]}`
