{"pageProps":{"categories":[{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","articles":{"data":[{"id":6,"attributes":{"title":"Myths and benefits of Probiotics.","slug":"myths-and-benefits-of-probiotics","createdAt":"2023-01-31T20:41:31.703Z","updatedAt":"2023-02-04T23:25:08.343Z","publishedAt":"2023-02-02T08:07:35.467Z","img":"https://images.freeimages.com/variants/HrnJrKhbkjAckDLNncuRs4TA/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","metaDesc":" Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species. Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them. Most of the probiotics end up at the end of your intestinal system, also known as the colon.\n\n The gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety. The bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even.\n\n There’s seven to 90 different strains of good bacteria inside your gut. Experts deem probiotics to be a safe supplement, yet potential risks exist. The average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit.","tags":["health","lifestyle"],"readTime":6,"dataSources":null}},{"id":7,"attributes":{"title":"Reduce Anxiety & Stress with the Physiological Sigh ","slug":"reduce-anxiety-and-stress-with-the-physiological-sigh","createdAt":"2023-02-02T13:56:39.070Z","updatedAt":"2023-02-04T23:31:30.111Z","publishedAt":"2023-02-02T13:56:41.866Z","img":"https://images.pexels.com/photos/3094215/pexels-photo-3094215.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Billions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life. \nAnd while those are powerful, the problem is they require that people step away from the stress inducing activity. My lab and other laboratories have been very interested in developing tools that allow us to push back on stress. \nFeel more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh is a pattern of breathing that involves two inhales followed by an extended exhale. \nPhysiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe. \nThere are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily. \nAnytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale. \nTypically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout your mouth or throughout your nose. \nThe second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court. \nAnd that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide. \nSo if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm. ","tags":["health","lifestyle"],"readTime":3,"dataSources":null}},{"id":8,"attributes":{"title":"How to Control Stress in Real-Time","slug":"how-to-control-stress-in-real-time","createdAt":"2023-02-02T14:08:24.693Z","updatedAt":"2023-02-06T03:20:00.435Z","publishedAt":"2023-02-02T16:13:02.774Z","img":"https://images.pexels.com/photos/321576/pexels-photo-321576.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"An ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm. \n\nHere’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down. \n\nA signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up. \n\nThe opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume. \n\nThe sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down. \n\nSo if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous. \n\nThis doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV. \n\nBut all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time. ","tags":["health","lifestyle"],"readTime":2,"dataSources":null}},{"id":9,"attributes":{"title":"7 Health Benefits of Green Tea & How to Drink it ","slug":"7-health-benefits-of-green-tea-and-how-to-drink-it","createdAt":"2023-02-03T00:43:29.954Z","updatedAt":"2023-02-04T23:25:41.432Z","publishedAt":"2023-02-03T00:43:32.258Z","img":"https://images.pexels.com/photos/1417945/pexels-photo-1417945.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \n\nTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \n\nThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \n\nAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \n\nI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that free radical damage we always talk about. \n\nNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of antioxidants found within green tea. \n\nWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \n\nSecond significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \n\nIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\n\n Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. \n\nYou’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee. Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. \n\nIts benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \n\n Point number five: green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. \n\nBut there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \n\nPoint number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing Alzheimer’s and Parkinson’s disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\n\nPoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \n\nSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \n\nBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \n\nSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \n\nDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  ","tags":["health","lifestyle"],"readTime":5,"dataSources":null}},{"id":10,"attributes":{"title":"Intermittent Fasting: Pros and cons","slug":"intermittent-fasting-pros-and-cons","createdAt":"2023-02-03T01:44:22.565Z","updatedAt":"2023-02-04T23:30:43.135Z","publishedAt":"2023-02-03T01:52:01.953Z","img":"https://images.pexels.com/photos/70497/pexels-photo-70497.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Our bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast. \n\nThat’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving. \n\nWhen you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy. \n\nThere are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is. \n\nBecause if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting. \n\nThere’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is IF beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising. \n\nNow, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can IF help you lose weight? \n\nYou have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories. \n\nOur thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body. \n\nThe body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body. \n\nWhat can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention. \n\nNow, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine. \n\nLet’s talk about some of the shortcomings of IF. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating. \n\nSecond, we don’t know which form of IF is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign. \n\nFour. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit. ","tags":["health","lifestyle"],"readTime":4,"dataSources":null}},{"id":11,"attributes":{"title":"I went VEGAN For 30 Days | Here's How My Body Reacted...","slug":"i-went-vegan-for-30-days-here-s-how-my-body-reacted","createdAt":"2023-02-03T04:11:22.897Z","updatedAt":"2023-02-04T23:30:13.831Z","publishedAt":"2023-02-03T04:11:25.351Z","img":"https://images.pexels.com/photos/1351238/pexels-photo-1351238.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself.  \nFive things I Learned to be vegan for 30 days ...\nIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. One, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan. \nTwo, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that. \n\nThree, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet. \nFour, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual. \nFive, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible. \n\nIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\n\nMy advice to you .....\nIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you. In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process. \nAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy. ","tags":["health","lifestyle"],"readTime":10,"dataSources":null}},{"id":12,"attributes":{"title":"Real Cause of Chronic Kidney Disease and Polycystic Kidney Disease","slug":"real-cause-of-chronic-kidney-disease-and-polycystic-kidney-disease","createdAt":"2023-02-04T13:26:37.597Z","updatedAt":"2023-02-05T11:12:01.049Z","publishedAt":"2023-02-04T13:27:07.778Z","img":"https://advancedurology.com/wp-content/uploads/2022/01/Kidney-Stone-Signs-scaled.jpg","metaDesc":"Chronic kidney disease is mainly made up of several types of problems with the kidney. One would be just chronic kidney disease, which is usually or mostly caused by diabetes. Another type of kidney disease called polycystic kidney disease. And then you have another problem with kidney stones, which relates to kidney stones. So if you have any of these problems, this article is for you, and you definitely want to read it.\n\n Time restricted eating, which is basically intermittent fasting, also slowed down the progression of the cysts developing in the kidney and the associated fibrosis, or the scar tissue that then comes after. It was also found that the ketogenic diet reduces the risk of kidney stones as long as the person’s on a low oxalate diet. Oxalates are things that contribute to kidney stones, and they’re in spinach, the almonds, the chocolate, kiwi.\nMetformin has to do with regulating blood sugar by improving insulin resistance, another interesting association. Fastening strongly inhibits the fibrosis or scar tissue associated with these cysts, as well as inhibiting something called mTOR. mTOR is something in the body that can trigger the growth of cancer tumors and even cysts. Chronic kidney disease is caused by the same thing, glucose, because the root cause of this is definitely diabetes.","tags":["kidney"],"readTime":7,"dataSources":null}},{"id":13,"attributes":{"title":"Can Ketogenic Diet (Keto) Reverse Kidney Disease?","slug":"can-ketogenic-diet-keto-reverse-kidney-disease","createdAt":"2023-02-05T10:51:44.170Z","updatedAt":"2023-02-05T11:05:35.469Z","publishedAt":"2023-02-05T10:52:31.735Z","img":"https://advancedurology.com/wp-content/uploads/2022/01/Kidney-Stone-Signs-scaled.jpg","metaDesc":"High levels of glucose and insulin create oxidative damage to four tissues: the brain and nerve tissue. The kidney is very susceptible to oxidative damage from high blood sugar and high insulin. Using the ketogenic diet, beta hydroxybutyrate, which is a ketone, can provide an alternative fuel, but it has some real interesting benefits to the kidney.\nThere's different stages of damage to the kidney, Stage 1 to 5, Stage 5, which is end stage renal failure. In this stage, the kidney can no longer filter anymore, can't filter the blood. Potassium can actually protect the kidney against damage, and we need 4700 milligrams every day.\n You're getting edema, and taking certain oral amino acids can slow down the progression of kidney damage. There are certain types of foods that you're going to have to avoid. If you're already at stage five, try to follow a healthy keto plan and intermittent fasting.","tags":["keto","kidney"],"readTime":3,"dataSources":null}},{"id":14,"attributes":{"title":"Epstein-Barr Virus (EBV):5 Things You MUST Know about.","slug":"epstein-barr-virus-ebv-5-things-you-must-know-about","createdAt":"2023-02-05T14:23:57.806Z","updatedAt":"2023-02-05T14:24:03.019Z","publishedAt":"2023-02-05T14:24:03.016Z","img":"https://images.pexels.com/photos/4226221/pexels-photo-4226221.jpeg","metaDesc":"Epstein-Barr virus is linked to autoimmune diseases, rheumatoid arthritis, chronic fatigue syndrome and fibromyalgia. Epstein Bar virus is associated with increased risk of certain cancers, autoimmune diseases. When the virus gets reactivated, it doesn't necessarily exhibit all the full-blown symptoms that maybe you had when you first got it. It may manifest in fatigue, soreness, lethargy, brain fog, achy joints and achy muscles.\n\n Epstein-Barr virus knows that vitamin D keeps your immune system strong. So if it can block that, it has an advantage,so it downgrades the receptor vitamin D. It also interferes with the metabolism of vitamin D in your gut. The second nutrient is zinc, not allowing zinc to be be transported to the different parts of the immune system.","tags":["stress","Epstein-Barr virus"],"readTime":9,"dataSources":null}},{"id":15,"attributes":{"title":"Interesting Connection between Thyroid and Vital Gallbladder","slug":"interesting-connection-between-thyroid-and-vital-gallbladder","createdAt":"2023-02-06T01:07:51.765Z","updatedAt":"2023-02-06T01:11:42.225Z","publishedAt":"2023-02-06T01:07:56.054Z","img":"https://www.sitarambhartia.org/wp-content/uploads/2018/09/thyroid-symptoms-in-men-1170x520.jpg","metaDesc":"I’d like to show you some interesting connections between why you may develop gallstones or have gallbladder problems and its relationship to the thyroid. There’s some really interesting relationships between the gallbladder and your thyroid. So let’s first start out talking about what is bile. Bile is composed of many things.\n\nYou, first of all, have bile salts in the bile, and that’s made out of potassium, sodium, calcium. So 67% of bile is bile salts. But then you also have something else in bile salts, and that’s called lecithin. So 22% of bile is made out of lecithin, and lecithin is a choline compound that helps you break down fat and cholesterol.\n\nSo bile is made out of bile salts, lecithin, which has choline in it. Also, bile is made up of cholesterol. And that’s really how bile salts are created from cholesterol. And if there’s too much cholesterol and not enough bile salts, that’s when you get gallstones.\n\nSo we have the cholesterol. Now, the protein is mainly two amino acids that combined with this bile to allow it to be water soluble and transported through the body. So that allows it to travel through the body in a very similar way to cholesterol being attached to a protein. So cholesterol is really, really important.\n\nNow, what’s interesting about the thyroid is when the thyroid is low, you have this hypothyroid condition, and even if it’s subclinical, so it’s not like a major problem. It’s a smaller problem that is going into the direction of a full-blown hypothyroid situation. Here you are having all this cholesterol in the body, but it’s not really broken down. So you get the situation where you’re getting a buildup of more cholesterol without the bile to break it down.\n\nAnd so, again, we have another risk of getting gallstones because we’re getting more cholesterol. The body can’t use it without the bile salts. So you have this super saturated cholesterol stone that’s developing. Also, your bile ducts won’t be able to relax if the thyroid hormones are sluggish.\n\nIf the thyroid is sluggish, you’re going to be on the cold side. The activation of the enzymes in the liver are not going to be that great as well as the formation of bile. Now, on the flip side, bile salts help in the conversion of T4 to T3 to actually activate the thyroid hormones. T4 is the inactive version of the thyroid hormone, T3 is the active version.\n\n To help this conversion, bile is needed. So you may have a lot of thyroid hormone, like T4, but you can also experience the symptoms of a hypothyroid because you’re not being activated. It takes a really healthy thyroid to make good bile, but it also takes bile to actually create a healthy thyroid. So one big common problem, probably the most common problem with a hypothyroid situation, is that the person has an autoimmune type hypothyroid situation.\n\nIt’s not really a thyroid problem. It’s an immune problem that’s attacking the thyroid. Another common cause of thyroid problems is a high level of cortisol. It’s adrenal stress, and that can shut down the thyroid.\n\nSo the thyroid is secondary, the adernal is primary, and a couple of reasons for that. So if you are on a low-fat diet or a plant-based diet, you’re not going to get enough cholesterol. And that could be the very reason why the adrenals tank down and the thyroid goes down, because you don’t have the raw material to make these hormones. Just by supplying more fat, going on a healthy version of the ketogenic diet can supply the raw material to start making more adrenal hormones.\n\nThat can then reduce the cortisol situation and give relief to your thyroid. And remember, it takes cholesterol to make bile. So being on a low-fat diet or a low-cholesterol diet can cause you not to even make enough bile, cannot activate the thyroid hormones, so we need that cholesterol. Also, what activates the production of bile is fat in the diet, animal fats.\n\nSo if you’re not having enough animal fats, you just don’t make enough bile. That right there can increase your risk of gallstones as well as your risk of getting a hypothyroid situation, because, one, we don’t feed the adrenal hormones, okay, so then we get higher cortisol, and we don’t make enough bile to make the conversion from T4 to T3. Because I think it’s really important to just look at all these factors and figure out what the real problem is instead of just being on your medication for the rest of your life and not really ever coming off of it. One is you don’t have enough selenium in the diet.\n\nYou don’t have enough iodine in the diet, and your estrogen might be too high. So to help you sort out more of really what’s causing your thyroid problem in the first place, you might want to check this article out right here.","tags":["thyroid","gallbladder"],"readTime":7,"dataSources":null}},{"id":16,"attributes":{"title":"Natural and Practical Way to End Stress and Lower Cortisol","slug":"natural-and-practical-way-to-end-stress-and-lower-cortisol","createdAt":"2023-02-06T23:39:37.062Z","updatedAt":"2023-02-06T23:46:25.470Z","publishedAt":"2023-02-06T23:39:40.882Z","img":"https://images.pexels.com/photos/4810369/pexels-photo-4810369.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"And as we are more exposed to this threat of danger, it can really affect every single system in our body. But there’s one thing that’s very, very important, and I want to just talk about it, and that's changing your viewpoint about the environment. I know this might be hard to believe, but your environment is not as dangerous as they want you to believe. Recently, I started to really look at the videos and different TV programmes I was watching, and it just hit me how many messages of fear I was exposed to without any solutions.\n\nNow, I’m definitely not saying to ignore some of these dangers, but when you are exposed to them, try like heck to have a relaxed viewpoint, staying in action to help solve the problem and improve things. But at some point, we need to start filtering out this threat of danger because it’s just not healthy for our bodies. You should start watching TV programmes and hang out with people who give you solutions that emphasise the good news. Talk about the good things to offset the massive danger signals that our body is constantly fed.\n\nNow, let me just go through a couple of things, because this is actually a very important topic. That is the flutter fight, the protective mode we enter in response to the threat of stress. Whereas the other system, called the parasympathetic, is all about growth, sleep, digestion, repair, and healing. In practice, I used to have a test called a «heart rate durability test» that would measure how much of the sympathetic nervous system was being activated versus how much parasympathetic.\n\nAnd boy, nearly everyone that came in was just so jacked up to the right, which is Because the environment we're in is considered extremely dangerous, we have sympathetic dominance. I mean, if there aren't enough things going wrong, to have other people manufacture more of them is complete insanity. So, I believe it is critical that you understand what happens to your biology when you are subjected to long-term chronic stress. Let’s go on to the immune system.\n\nStress suppresses the immune system. And therefore, when you go to the doctor and you have inflammation or some type of autoimmune disease, they inject you with prednisone, which takes that away temporarily because prednisone is a type of cortisol that is produced by the adrenal glands, which are activated by stress, and that is suppressing all the immune reactions. You have decreased sperm production. Well, if you’re trying to be on the ketogenic diet, your whole metabolism shifts back to glucose production.\n\nThat’s right, because cortisol is a glucocorticoid, so it increases glucose and neogenesis, the production of new sugar in your liver. So when you go through chronic stress, what’s happening is that you’re just pumping out all this sugar that’s not coming from your diet. Because when you’re in stress mode, your body needs this quick energy. When you go through chronic stress, your triglycerides go up, your HDL goes down, and your LDL goes up.\n\nYour ability to detoxify I’m talking about certain enzymes in your liver. These are the enzymes that convert poisons into harmless, water-soluble things that can be released from the body. Those are inhibited when you go through chronic stress. So there goes the fat digestion.\n\nEven your pancreatic enzymes and the enzymes from your small intestine will be inhibited, cutting down your ability to digest. Your production of hydrochloric acid is going to go down, too. So there goes your complete digestion of proteins, your absorption of minerals, and the killing of pathogens. On top of all the other barriers to vitamin D absorption, stress will actually slow down the absorption of vitamin D. Even the fascia, which is similar to the stuff that surrounds the muscles and is highly innovated by your nerves and brain, has a lot of information coming down to it, around the ligaments, around your muscles, and it tightens and becomes more restricted.\n\nWhen you’re under chronic stress, you maintain this posture right here, which is kind of like being in protection mode. You know, your posture starts going down, and it all has to do with that fascia. In a chronic state of stress, you will not be thinking analytically, thinking about things, solving problems, coming up with good solutions, being creative, or having imagination. Instead, it’s going to be more like reaction mode because you need a relaxed state of mind to come up with solutions.\n\nYou need your creativity to come up with really good strategies and solutions. The last point I want to bring up is your genes. What happens to your genes when you’re under stress? Well, all the bad genes get activated, okay? and all the good genes get suppressed. I’m talking about the activation of cancer genes.\n\nI’m talking about the activation of inflammatory genes and things like that. But one thing I want to bring up is that your genes really don’t cause anything. The genes are associated with a lot of bad things. But if you know how to control your genes, you’re totally going to be in the driver’s seat.\n\nNumber one, we must change our attitude towards our environment. We must also start filtering out the threat of danger to which we’re exposed. If you start watching certain videos that don’t give you a solution and at the end of the video you feel worse than before you watched the video, then you might need to filter those things out. Therapy for me is getting out in nature, getting as much space as possible, and really kind of getting connected to my environment.\n\nNow, the other thing to do is to physically flesh out a lot of this extra adrenaline and this extra cortisol that have been accumulated through the day of exposure to all these things. I mean, I have to physically work out every single day just to kind of flush things out and help me sleep. Because of the other point about the adrenaline and cortisol, it’s shifting a lot of energy that should be in your immune system, should be in repair, should be in digestion, and it’s ending up in the muscles. But because there’s no more tiger around, we have more mental energy, and that whole mechanism is still there.\n\nSo you’re going to have to exercise to get those hormones out of your system. Now, that being said, there are a lot of additional things you can do to help with stress. They're not as important as changing your viewpoint, but they’re still important.\n\n\n","tags":["chronic stress","immune system"],"readTime":11,"dataSources":null}},{"id":17,"attributes":{"title":"The top home treatments for candida fungus:NEVER AGAIN GET CANDIDA","slug":"the-top-home-treatments-for-candida-fungus-never-again-get-candida","createdAt":"2023-02-07T02:58:45.735Z","updatedAt":"2023-02-07T02:58:48.300Z","publishedAt":"2023-02-07T02:58:48.295Z","img":"https://wholehealthchicago.com/blog/wp-content/uploads/2022/01/Candida-copy.jpeg","metaDesc":"Today we'll talk about the best candida treatments.\n\nFungi make up a large portion of the microbes in your gut, and candida is one type of fungi. Friendly fungi help the body in a variety of ways.\n\nIt is only when we alter the environment in which our friendly bacteria and fungi live that they become a problem. Candida overgrowth, for example, is one of the most serious side effects of antibiotics.\n\nIf the candida-to-bacteria ratio is off, it can cause health problems. However, bacteria produce certain substances that aid in the control of candida.\n\nIf Candida becomes hostile, you need to know what you can do. Taking probiotics is an important step in maintaining a healthy microbiome.","tags":["candida albicans","fungus infection"],"readTime":8,"dataSources":null}},{"id":18,"attributes":{"title":"How to Reverse Your Autoimmune Disease in natural way","slug":"how-to-reverse-your-autoimmune-disease-in-natural-way","createdAt":"2023-02-09T21:21:52.618Z","updatedAt":"2023-02-09T21:25:08.842Z","publishedAt":"2023-02-09T21:21:55.721Z","img":"https://www.innovativehealthclinic.com/wp-content/uploads/2018/12/autoimmune-banner-image-for-blog-5c09476d480c4-2048x1072.jpg","metaDesc":"The Epstein-Bar virus has been linked to many autoimmune diseases, and 90% of the population has had it. It can go into remission and come out of remission depending on the right environment. It has the ability to infect certain immune cells and alter their genes, which can trigger autoimmune diseases if the right environment occurs. The Th-17 immune cell is involved in autoimmune diseases and can either protect or cause them. 90% of the population has been exposed to the Epstein-Barr virus, and it can create infectious mononucleosis, which affects lymph nodes, throat, and fever.\n\nIt is not highly contagious, but it does spread through saliva, blood, semen, and can stay dormant for years and never come out of remission. The reason why certain people get it and other people don't is due to their own integrity, their resistance to the virus.","tags":["auto immune disease","health"],"readTime":10,"dataSources":null}},{"id":19,"attributes":{"title":"#1 Food with the Most Vitamin K2","slug":"1-food-with-the-most-vitamin-k2","createdAt":"2023-02-12T00:42:14.076Z","updatedAt":"2023-02-12T01:16:23.332Z","publishedAt":"2023-02-12T01:01:55.918Z","img":"https://healthjade.net/wp-content/uploads/2022/03/vitamin-K2.jpg","metaDesc":"Vitamin K2 is the number one food that has the most vitamin K2, and it was discovered by Dr. Weston Price in a book called \"Nutrition and Physical Degeneration\". He was trying to identify what it was about their diet that generated such amazing teeth as compared to nowadays, when everyone needs braces. He found that they ate a lot of grass-fed butter and cheese and natural things, and so he identified their teeth as being just, like, really, really good. Vitamin K2 works with vitamin D to absorb calcium in the intestines by a factor of 20, and it uses a transport system called LDL, the so-called \"bad cholesterol\" that everyone's trying to reduce. Calcium transportation is important for bones, teeth, arteries, cartilage, joints, and the brain.\n\nIt activates a beta cell in the pancreas, making insulin more sensitive, improving insulin resistance, generating more ATP in muscle cells, supporting testosterone, and improving spatial learning and memory. It also inhibits calcium build up in the arteries and joints.","tags":["vitamin K2"],"readTime":10,"dataSources":["https://pubmed.ncbi.nlm.nih.gov/15995297/","https://eje.bioscientifica.com/view/journals/eje/175/6/541.xml","https://www.karger.com/Article/FullText/516611","https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5946231/"]}},{"id":20,"attributes":{"title":"8 Symptoms of Parasites in Human Body","slug":"8-symptoms-of-parasites-in-human-body","createdAt":"2023-02-13T19:58:00.277Z","updatedAt":"2023-02-13T20:04:06.966Z","publishedAt":"2023-02-13T19:58:04.067Z","img":"https://www.makatimed.net.ph/wp-content/uploads/2021/01/1000-22-1.png","metaDesc":"So today we'll talk about the warning signs that can help you detect parasites in your body. But I have some bad news to share with you. Regardless of what you're doing to improve your health, you probably have parasites in your body right now. They're just not causing any issues.\nWhat exactly is a parasite?\n\nA parasite can be a virus, worm, bacteria, or fungus that has a unique relationship with your body. It is not a friendly bacteria or microbe.\n\nIt basically steals things from you and causes problems for you, but there are no benefits in return. As a result, that relationship is more pathogenic. Of course, there are people who are parasitic.\n","tags":["Parasites"],"readTime":8,"dataSources":["https://pubmed.ncbi.nlm.nih.gov/21673156/","https://pubmed.ncbi.nlm.nih.gov/34209438/","https://pubmed.ncbi.nlm.nih.gov/33529050/","https://academic.oup.com/jimb/article/39/4/567/5994514?login=false"]}},{"id":21,"attributes":{"title":"7 Benefit of Magnesium for Human Body : Surprising fact of Magnesium","slug":"7-benefit-of-magnesium-for-human-body-surprising-fact-of-magnesium","createdAt":"2023-02-13T22:54:04.758Z","updatedAt":"2023-02-13T22:57:37.781Z","publishedAt":"2023-02-13T22:54:07.717Z","img":"https://images.pexels.com/photos/4087621/pexels-photo-4087621.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Magnesium is an enthralling mineral. It participates in over 350 different enzymes in the body, and we may discover that it participates in many more. What's fascinating about enzymes is that they accelerate chemical reactions in the body by a factor of 100 million times faster than if you didn't have that enzyme.\n\nSo they're catalysts, or things that help the chemical reaction happen much faster. What's even more amazing about enzymes is that they don't run out of energy. So they're a little magical in that they appear to have their own energy that doesn't seem to run out.","tags":["Magnesium"],"readTime":7,"dataSources":["https://www.ncbi.nlm.nih.gov/books/NBK507250/","https://pubmed.ncbi.nlm.nih.gov/15466951/"]}},{"id":22,"attributes":{"title":"Quitting Sugar benefits : 14 Days no Sugar Challange.","slug":"quitting-sugar-benefits-14-days-no-sugar-challange","createdAt":"2023-02-15T00:02:36.077Z","updatedAt":"2023-02-15T01:35:47.023Z","publishedAt":"2023-02-15T00:02:40.112Z","img":"https://images.pexels.com/photos/6823457/pexels-photo-6823457.jpeg","metaDesc":"So, what would happen to your body if you completely stopped eating sugar? I mean, for the entire two weeks? Let's look into that.\n1. Reduce your sugar cravings-\nWhy? Because every time you consume sugar, a hormone enters your body and lowers your blood sugars, resulting in a low blood sugar situation, or hypoglycemia to some extent. And this will cause you to crave sugar.\nSo, by eliminating sugar, you eliminate the desire for sugar.\n2. Feeling less hungry-\nUnless you do this. You won't fully understand, but I can tell you that it's the sugar that keeps you hungry all the time.\nWhen you stop eating sugar, you become much less hungry","tags":["sugar"],"readTime":5,"dataSources":null}},{"id":23,"attributes":{"title":"Onion Testosterone Booster: How to use Onions to increase Testosterone","slug":"onion-testosterone-booster-how-to-use-onions-to-increase-testosterone","createdAt":"2023-02-15T01:44:26.725Z","updatedAt":"2023-02-15T01:45:54.246Z","publishedAt":"2023-02-15T01:45:54.243Z","img":"https://images.pexels.com/photos/10612242/pexels-photo-10612242.jpeg","metaDesc":"Let's talk about how you can boost testosterone simply by eating more onions. And, of course, testosterone is a significant issue for men as they age. Every year, by the age of 40, your testosterone level drops by 1%.\n\nAnd testosterone does a lot more than just increase libido. It is in charge of male characteristics such as body hair. It is also present in muscle.\n\nThere are a lot of people who are going the testosterone route and getting testosterone pellets and taking testosterone injections, and I'm not a fan of those therapies because when you start taking a hormone, you inactivate the gland that makes that hormone.\n","tags":["Testostrone","Onion"],"readTime":3,"dataSources":["https://pubmed.ncbi.nlm.nih.gov/33282442/","https://www.jocpr.com/abstract/allium-cepa-a-traditional-medicinal-herb-and-its-health-benefits-44.html","https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6406961/"]}}]}}}],"article":[{"id":9,"attributes":{"title":"7 Health Benefits of Green Tea & How to Drink it ","slug":"7-health-benefits-of-green-tea-and-how-to-drink-it","createdAt":"2023-02-03T00:43:29.954Z","updatedAt":"2023-02-04T23:25:41.432Z","publishedAt":"2023-02-03T00:43:32.258Z","img":"https://images.pexels.com/photos/1417945/pexels-photo-1417945.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \n\nTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \n\nThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \n\nAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \n\nI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that free radical damage we always talk about. \n\nNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of antioxidants found within green tea. \n\nWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \n\nSecond significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \n\nIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\n\n Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. \n\nYou’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee. Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. \n\nIts benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \n\n Point number five: green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. \n\nBut there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \n\nPoint number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing Alzheimer’s and Parkinson’s disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\n\nPoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \n\nSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \n\nBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \n\nSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \n\nDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  ","tags":["health","lifestyle"],"readTime":5,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":9,"content":"<p>This article&nbsp;is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read&nbsp;till the end of the article&nbsp;to get tips on how to make the healthiest cup of tea possible.&nbsp;</p><p>&nbsp;</p><h3>What makes Green tea so good?</h3><p>Tea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea.&nbsp;</p><p>&nbsp;</p><p>The number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins.&nbsp;</p><p>&nbsp;</p><p>And what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit.&nbsp;</p><p>&nbsp;</p><p>I know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some&nbsp;of those faucets have rust on them. The rust is a direct result of that <strong>free radical </strong>damage we always talk about.&nbsp;</p><p>&nbsp;</p><p>Now, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media,&nbsp;it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of <strong>antioxidants</strong> found within green tea.&nbsp;</p><p>&nbsp;</p><p>We have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer.&nbsp;</p><p>&nbsp;</p><h3>Have you got stinky breath ?</h3><p>Second significant point&nbsp;about green tea,&nbsp;if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria.&nbsp;</p><p>&nbsp;</p><p>In fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque.&nbsp;So green tea also decreases the risk of developing a cavity.</p><p>&nbsp;</p><h3>Gives stable energy.</h3><p>Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. You’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee.</p><p>&nbsp;</p><h3>Act as relaxing agent.</h3><p>Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. Its benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure.&nbsp;</p><p>&nbsp;</p><h3>Helps in fat burning.</h3><p>Point number five: Green tea can help you burn fat. Well, this is more of an individual case-by-case&nbsp;basis thing, because not all studies agree on this. But there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die.&nbsp;</p><p>&nbsp;</p><h3>Decrease the risk of you developing Alzheimer’s and Parkinson’s disease</h3><p>Point number six:&nbsp;Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly&nbsp;decrease the risk of you developing <strong>Alzheimer’s and Parkinson’s </strong>disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain.&nbsp;If that doesn’t encourage you to take a sip, I don’t know what will.</p><p>&nbsp;</p><h3>Increase your lifespan</h3><p>Point 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this.&nbsp;</p><p>&nbsp;</p><p>Some studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes.&nbsp;</p><p>&nbsp;</p><p>But before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect.&nbsp;</p><p>&nbsp;</p><p>So, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about.&nbsp;</p><p>&nbsp;</p><p>Don’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid&nbsp;in the absorption of some of these nutrients. &nbsp;</p><p>&nbsp;</p><p>Finally, don’t cheap out. Go for the good premium stuff, as it contains more of the healthy nutrients we’ve been talking about all along. I need you to know this. Don’t buy into the BS supplements that take green tea extract and claim that it has miracle health benefits.&nbsp;They do not.</p><p>&nbsp;</p><p>The real thing is always healthier than the supplement form. As always, thanks for reading. &nbsp;</p>","sample":""}}}]},"__N_SSG":true}