{"pageProps":{"article":[{"id":40,"attributes":{"title":" A Urologist's Comprehensive Guide to Genital Piercing and  history of genital Piercing","slug":"a-urologists-comprehensive-guide-to-genital-piercing-and-history-of-genital-piercing","createdAt":"2023-02-26T01:06:26.010Z","updatedAt":"2023-02-26T01:18:53.726Z","publishedAt":"2023-02-26T01:06:30.626Z","img":"https://images.pexels.com/photos/6156961/pexels-photo-6156961.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Genital piercing is a form of body piercing that involves piercing a part of the genitalia, thus creating a suitable place for wearing different types of jewellery. Nevertheless, the term may also be used pars pro toto to indicate all body piercings in the area of anus, perineum, genitals and mons pubis, including piercings such as anal, guiche, and pubic that do not involve perforation of genitalia. Genital piercings can be done regardless of sex, with various forms of piercings available.","tags":["Genital Piercing"],"readTime":10,"dataSources":["https://bjui-journals.onlinelibrary.wiley.com/doi/abs/10.1046/j.1464-410X.2003.04490.x","https://pubmed.ncbi.nlm.nih.gov/12581013/"],"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":40,"content":"<p data-pm-slice=\"1 1 []\">Today we’re going to be talking about piercings. No, not the ones in your ears, but the ones down there.&nbsp;</p><p data-pm-slice=\"1 1 []\">&nbsp;</p><p>Today we’re going to talk about the history of genital piercing.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Who gets genital piercing? What kinds are there available? And what are the risks and benefits?&nbsp;</h2><p>&nbsp;</p><p>&nbsp;</p><p><strong>History of Genital Piercing</strong></p><p>&nbsp;</p><p>So historically, genital piercing began in men to prevent fore skinned from averting or opening or allowing the head of the piercing penis to show.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And one of these procedures is called in fibrillation. It’s where a metal ring or bar is used to connect the foreskin above the glands of the penis to prevent the foreskin from coming down. Now, this may sound crazy to a lot of us, but back in 25 BC, 250 AD, people were doing this procedure.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And while it’s not exactly documented as to why they were doing it, some hypothesized that it was being done in order to preserve the voice. And what they thought was that participating in sexual activity actually caused the change of a voice.&nbsp;And they wanted to preserve the voice, particularly of boys who were singing chorus or had promising careers in music. They wanted to prevent that from happening, and so that’s why they started doing this presumably,&nbsp;</p><p>&nbsp;</p><p>However, others think that it may have been used by comedians or performers more as an adornment or jewelry piece or even to increase attractiveness.&nbsp;</p><p>&nbsp;</p><p>Others have written passages that describe this as being a procedure done to prevent having children before you come of age.&nbsp;I’ll read one to you guys.&nbsp;</p><p>&nbsp;</p><p>“It says one pulls the foreskin forward and piercing it transversely with a threaded needle. One leaves a large thread until the holes have symptrized. Then removing the thread, one replaces it with a large, large iron ring which remains in place until the patient reaches the age of majority.”&nbsp;&nbsp;</p><p>&nbsp;</p><p>They used to claim that this ring prevented association with women until the age of 25, at which time it was removed, forced them not to dissipate themselves, and then they conserved themselves to produce strong children in a condition to serve the Republic.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So then we move on to the 18th and 19th century when there became a lot of hysteria around masturbation. In fact, during this time, even doctors themselves felt that it was scientifically proven that masturbation led to disease and deadly conditions.&nbsp;And so they created all these behavioral and procedural things that they could do to help prevent masturbation. And of course, this is one of them.&nbsp;</p><p>&nbsp;</p><p>However, in the kama Sutra in the 16th century. So even before all this hysteria came along, that’s when the first discussion of piercing, the men’s phallus for increasing pleasure, was actually noted in the Kamasutra.&nbsp;So it has certainly evolved.&nbsp;</p><p>&nbsp;</p><h2>Now, moving on to today, how many people actually get piercing?&nbsp;</h2><p>&nbsp;</p><p>Well, it’s been reported that around one to 3%. But some even report as high as 10% of people that are surveyed or questioned about getting piercings do get genital piercing.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So from the data, we know that people who get their genitals pierced do this because it’s a meaningful form of self expression. It allows them to enhance their sexual experience. And in fact, it’s not a decision that they take lightly.&nbsp;&nbsp;</p><p>&nbsp;</p><p>When studies have surveyed people who have genital piercings, they found that this decision usually takes over a year to finalize for most people. So they’re often deliberating for some period of time.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And after they get pierced, they tend to spend a lot of time taking care of their piercing and the area around it.&nbsp;</p><p>&nbsp;</p><p>Sometimes people also feel like it helps them take control of their body after they’ve had a bad experience.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Many of these people are older than 30. They tend to enjoy tattoos or other types of piercing. They’re usually in pretty good health, and many of them are college educated. So some of the stereotypes you might be thinking of for people who get general piercings probably don’t apply.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>What are the different types of genital piercing?</h2><p>&nbsp;</p><p>Well, to sort of there’s usually three types of jewelry that people use for general piercings. One of them is a barbell, which is a rod with two little beads at the end.&nbsp;Or you can also get it in a curved form called a curved barbell.&nbsp;</p><p>&nbsp;</p><p>Or you can have what’s called a captive bead, and so that’s a full circle with a bead at the end of it.&nbsp;</p><p>&nbsp;</p><p>Typically, men tend to get piercings more often than women and the most common piercing that men get is called the Prince Albert piercing.&nbsp;This actually enters through the urethra or p two and through the glands of the penis or the head of the penis itself.&nbsp;</p><p>&nbsp;</p><p>Many people enjoy this piercing because it offers some increased urethral stimulation.&nbsp;So people who enjoy urethral play may find this sort of piercing enjoyable. They usually heal rather quickly in about two to four weeks.&nbsp;</p><p>&nbsp;</p><p>There’s a couple of stories about how this got the name Prince Albert.&nbsp;&nbsp;</p><p>&nbsp;</p><p>One is that Prince Albert himself actually got the piercing to help his genitals hang more comfortably in his very tight trousers. Others believed that he had a condition called peyronie’s disease, which is a curved penis.&nbsp;In an attempt to try and straighten it, they put a piercing on it that then held some weight to try and actually provide traction to straighten it out.&nbsp;</p><p>&nbsp;</p><p>If you want to learn more about peyronie’s disease, make sure you check out my article&nbsp;on that before as well.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Other piercings include a frenulum piercing, which attaches to the frenulum, which is the piece of skin that attaches the glands to the shaft right underneath the penis.&nbsp;</p><p>&nbsp;</p><p>There’s also <strong>Guiche piercings</strong>, which are in the perineum or space between the scrotum and the anus.&nbsp;&nbsp;</p><p>&nbsp;</p><p>There’s also <strong>Scrotum piercings</strong> that can really occur anywhere on the scrotum. However, you have to be careful with the scrotum and the <strong>Guiche piercings</strong> because if they get too close to the anus they can get dirty from stool and that can cause infection.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Also, it’s you get infections in the scrotum that tracks into the testicle that can cause problems that contract from testicular infections all the way to the prostate.&nbsp;</p><p>&nbsp;</p><p>There are two types of piercings that go across the glands either up and down or side to side, called the <strong>Ampallang</strong> and the <strong>Apadravya</strong>.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And lastly, the <strong>Dydoe</strong> ring is a ring that is&nbsp;placed at the coronal ridge, and sometimes people will place multiple of these around the coronal ridge.&nbsp;</p><p>&nbsp;</p><p>Very often in genital piercings, some people will try to do interesting things that create ladders of multiple piercings.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And all of these piercings are fine as long as you’re making sure to look out for infection. We’ll talk more about that at the end of the article. So make sure you stick around.&nbsp;</p><p>&nbsp;</p><p>For women, very commonly, women will get <strong>Clitoral hood piercings</strong>.&nbsp;&nbsp;</p><p>&nbsp;</p><p>This is being because the stimulation from the jewelry out to the clitoris can be seen as pleasurable. It can be placed on either side or the top, called the ventral hood.&nbsp;</p><p>&nbsp;</p><p>There’s also <strong>Labial</strong> <strong>piercings</strong>, which pierce the lips of the vulva, as well as <strong>Fourchette&nbsp;piercings</strong>, which are between the vagina and the anus, and Christina piercings, which are located the pubic area just above the vulva.&nbsp;</p><p>&nbsp;</p><h2>Are Genital Piercings safe?&nbsp;</h2><p>&nbsp;</p><p><strong>So the good news is, general piercings are mostly safe when they’re performed by a professional piercer and they’re cared for appropriately.</strong>&nbsp;</p><p>&nbsp;</p><p>It’s really important after you get a piercing to avoid any unprotected intercourse, swimming pools or jacuzzis for at least four weeks,&nbsp;and depending on the type of piercing, it could be longer to avoid any source of infection.&nbsp;</p><p>&nbsp;</p><p>And if you’re concerned about an infection, it’s important to see a doctor. I know that many piercers tend to avoid going to the doctor because they’re afraid of being judged or getting a clinician who really doesn’t know what to do and just tells them to take out the piercing.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And while that can be very frustrating, it’s important to treat these infections before they create permanent damage or get worse.&nbsp;</p><p>&nbsp;</p><p>So when you look at all the different types of complications, the rate of complications is between 9% and 19%.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So if you and ten of your friends went to get genital piercings, maybe one to two of you might have a complication.&nbsp;</p><p>&nbsp;</p><figure class=\"table\" style=\"width:99.1%;\"><table class=\"ck-table-resized\" style=\"border-style:solid;border-width:0px;\"><colgroup><col style=\"width:20.95%;\"><col style=\"width:20.95%;\"><col style=\"width:19.23%;\"><col style=\"width:20.95%;\"><col style=\"width:17.92%;\"></colgroup><tbody><tr><td style=\"border-style:solid;border-width:1px;\">Complication</td><td style=\"border-style:solid;border-width:1px;\">MGP (Caliendo et al, 2005) (n = 49)</td><td style=\"border-style:solid;border-width:1px;\">MGP (Hogan et al, 2010) (n = 445)</td><td style=\"border-style:solid;border-width:1px;\">WGP (Caliendo et al, 2005) (n = 35)</td><td style=\"border-style:solid;border-width:1px;\">WGP Young et al, 2010 (n = 240)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">NO problems</td><td style=\"border-style:solid;border-width:1px;\">23 (47%)</td><td style=\"border-style:solid;border-width:1px;\">209 (47%)</td><td style=\"border-style:solid;border-width:1px;\">23 (65%)</td><td style=\"border-style:solid;border-width:1px;\">153 (64%)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Urinary flow changes</td><td style=\"border-style:solid;border-width:1px;\">19 (39%)</td><td style=\"border-style:solid;border-width:1px;\">109 (25%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Site sensitivity</td><td style=\"border-style:solid;border-width:1px;\">15 (31%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">4 (11%)</td><td style=\"border-style:solid;border-width:1px;\">-</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Site hypersensitivity</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">101 (23%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">54 (23%)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Site hyposensitivity</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">7 (02%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Skin irritation</td><td style=\"border-style:solid;border-width:1px;\">9 (18%)</td><td style=\"border-style:solid;border-width:1px;\">30 (07%)</td><td style=\"border-style:solid;border-width:1px;\">2 (05%)</td><td style=\"border-style:solid;border-width:1px;\">20 (08%)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Skin infections</td><td style=\"border-style:solid;border-width:1px;\">4 (08%)</td><td style=\"border-style:solid;border-width:1px;\">11 (03%)</td><td style=\"border-style:solid;border-width:1px;\">1 (03%)</td><td style=\"border-style:solid;border-width:1px;\">8 (03%)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Site rips or tears</td><td style=\"border-style:solid;border-width:1px;\">4 (08%)</td><td style=\"border-style:solid;border-width:1px;\">30 (07%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Condom use problems</td><td style=\"border-style:solid;border-width:1px;\">9 (18%)</td><td style=\"border-style:solid;border-width:1px;\">24 (05%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">&nbsp;</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Birth control problems</td><td style=\"border-style:solid;border-width:1px;\">1 (02%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">&nbsp;</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Oral sex problems</td><td style=\"border-style:solid;border-width:1px;\">4 (08%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Site keloids</td><td style=\"border-style:solid;border-width:1px;\">4 (08%)</td><td style=\"border-style:solid;border-width:1px;\">16 (04%)</td><td style=\"border-style:solid;border-width:1px;\">1 (03%)</td><td style=\"border-style:solid;border-width:1px;\">10 (04%)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Sexual problems</td><td style=\"border-style:solid;border-width:1px;\">2 (04%)</td><td style=\"border-style:solid;border-width:1px;\">4 (01%)</td><td style=\"border-style:solid;border-width:1px;\">2 (05%)</td><td style=\"border-style:solid;border-width:1px;\">1 (&lt;1%)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Urinary tract infection</td><td style=\"border-style:solid;border-width:1px;\">1 (02%)</td><td style=\"border-style:solid;border-width:1px;\">7 (02%)</td><td style=\"border-style:solid;border-width:1px;\">1 (03%)</td><td style=\"border-style:solid;border-width:1px;\">3 (01%)</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Embedded jewellery</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">4 (01%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Erection problems</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">4 (01%)</td><td style=\"border-style:solid;border-width:1px;\">-</td><td style=\"border-style:solid;border-width:1px;\">-</td></tr><tr><td style=\"border-style:solid;border-width:1px;\">Others, not named</td><td style=\"border-style:solid;border-width:1px;\">2 (04%)</td><td style=\"border-style:solid;border-width:1px;\">18 (04%)</td><td style=\"border-style:solid;border-width:1px;\">1 (03%)</td><td style=\"border-style:solid;border-width:1px;\">15 (06%)</td></tr></tbody></table></figure><p>&nbsp;</p><p>And here’s a table that reviews three studies that looked at people who had genital piercings and the rates of complications.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So first, the most common thing you’re going to see is infection. This is a dark and moist area and we’re often wearing tight and constrictive clothing that can make it more likely to get infections.&nbsp;</p><p>&nbsp;</p><p>And not just bacterial infections, but you can also get sexually transmitted infections if you have an open sore or your partner gets a sore from the piercing.&nbsp;That can then cause transmission of bodily fluids, particularly blood, which can cause a risk of sexually transmitted infection.&nbsp;</p><p>&nbsp;</p><p>If you are concerned about a skin infection so you’re seeing some redness, some drainage, of course, always see your doctor, but it’s important to start using warm compresses on the area.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Make sure you draw a line around the redness and keep an eye on it. If it continues to expand, it’s not getting better. Make sure to see your doctor sooner because you might need antibiotics. Also, make sure to keep the area clean and consider an antibiotic ointment.&nbsp;</p><p>&nbsp;</p><p>And if you find that things are not improving after five to seven days, you may actually have to remove the piercing in order to allow it to heal.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Bleeding can occur, particularly after you’ve had the piercing. If you notice that the bleeding is not getting better, particularly if you’re having a lot of blood loss, you feel lightheaded or dizzy. Don’t wait.&nbsp;Go to the emergency room immediately.&nbsp;</p><p>&nbsp;</p><p>Rarely, people can get things like scarring, nerve damage or damage to the surrounding vessels, or even allergic reactions. However, these things are rather rare. It’s important to be very careful when you’re engaging in oral, anal, or vaginal intercourse.&nbsp;&nbsp;</p><p>&nbsp;</p><p>First off, condoms can actually get damaged or broken during intercourse because of the piercing. There’s also been reported trauma to the vagina or anus for the person receiving penetrative intercourse.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Or people have sometimes choked out of piercing or gotten a piercing trapped between their teeth or sometimes even had their tooth chipped.&nbsp;</p><p>&nbsp;</p><p>So again, being very careful when you’re engaging in intercourse with someone who has a genital piercing.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Also, if you’re undergoing a procedure and someone asks you to remove your piercing. One it is Okay, usually for a procedure that’s less than an hour, but because these areas have a lot of blood flow to them, it’s quite possible the piercing can shrink down.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Often, you can ask them to either put tape on the piercing so it’s not really a problem in the sterile field if you’re having a surgery or something like that. Or you can ask&nbsp;them to put a little piece of IV tubing in the space where the piercing was to prevent it from closing down.&nbsp;</p><p>&nbsp;</p><p>All right, I hope you guys found this interesting.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}