{"pageProps":{"article":[{"id":36,"attributes":{"title":"Are you fed up with your sexless marriage? What to do about it .","slug":"are-you-fed-up-with-your-sexless-marriage-what-to-do-about-it","createdAt":"2023-02-23T20:30:41.823Z","updatedAt":"2023-02-23T20:30:44.726Z","publishedAt":"2023-02-23T20:30:44.724Z","img":"https://images.pexels.com/photos/450056/pexels-photo-450056.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Is Sexless Marriage for real?! Is your relationship over when you don't meet the “right” or “healthy” amount of sex that every couple needs to be having?\n\nThis might be a trivial issue for partners, but not having enough sex can impose a threat to your relationship.\n\nKnow how to deal with it so make sure to read this article til the end. ","tags":["sexless marriage"],"readTime":8,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":36,"content":"<h2 data-pm-slice=\"0 0 []\">What is a sexless marriage? How common is it? And what can you do about it?&nbsp;</h2><p data-pm-slice=\"0 0 []\">&nbsp;</p><p>And today we’re going to be talking all about sexless marriage.&nbsp;</p><p>&nbsp;</p><p><strong>So how do you really define a sexless marriage?</strong>&nbsp;&nbsp;</p><p>&nbsp;</p><p>Well, there’s no real definition, but researchers have defined sexless marriages as having sex less than 10&nbsp;times a year.&nbsp;</p><p>&nbsp;</p><p>And if you fall into this category, know that you’re not alone. In recent studies, they found that 26% of Americans haven’t had sex in the past twelve months.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And if you ask specifically couples, 12% haven’t had sex in the last three months. And other studies have guessed that 1&nbsp;in 6&nbsp;men and 1&nbsp;in 4&nbsp;women in the United States haven’t had sex for the last year.&nbsp;That’s a lot of people.&nbsp;</p><p>&nbsp;</p><p><strong>But does it really matter how often you’re having sex?</strong>&nbsp;</p><p>&nbsp;</p><p>When you ask people what the average number of times people are having sex that are in relationships, it’s about once a week.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And that number changes over the course of your lifetime. Younger people in their 20s,&nbsp;the average number is about 80 times a year.&nbsp;</p><p>&nbsp;</p><p><strong>But does it really matter? Does having sex more often with your partner matter?</strong>&nbsp;&nbsp;</p><p>&nbsp;</p><p>Well, if it’s bothering you or your partner that you’re not having sex enough, well, of course, it matters. But if not, then I wouldn’t worry about this and stop watching right now. Because they found that when you’re looking at people who are in sexless marriages or who are not having sex&nbsp;as frequently as other people. That does not correlate with happiness.&nbsp;</p><p>&nbsp;</p><p>So you can still be just as happy if you’re having sex more often or not.&nbsp;</p><p>&nbsp;</p><h2>So why are people having sexless marriages?&nbsp;</h2><p>&nbsp;</p><p><strong>Well, the first reason is stress.</strong>&nbsp;&nbsp;</p><p>&nbsp;</p><p>And stress can be for all sorts of reasons. It can be from working a very demanding job with long hours, having financial concerns or parenting young children, having older parents that are&nbsp;ill. There’s so many things.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But particularly in the millennial generation, we are seeing some patterns emerge. And we found that millennials are already behind prior generations. They’re later to get married, later to buy a home and have more financial stress than the generations above them.&nbsp;</p><p>&nbsp;</p><p>They also have more student debt than the generations before them, and hence they’re having more financial concerns just because of having debt to pay off.&nbsp;</p><p>&nbsp;</p><p>And in this particular generation, there are higher rates of depression and anxiety, which can make it less likely for you to want to participate in sex.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Another big reason is mismatched libido.</strong>&nbsp;</p><p>&nbsp;</p><p>So that is when the desire that you have and that your partner have does not match. Maybe one partner wants to have sex twice a week and one person wants to have sex every other week, and that’s a mismatch scenario.&nbsp;&nbsp;</p><p>&nbsp;</p><p>However, is that a bad thing? No, not really. And I think that’s because there are two different types of desire in relationships. When we think of desire, we think of what we see on TV and what we felt when we were younger.&nbsp;That’s spontaneous desire.&nbsp;</p><p>&nbsp;</p><p>When you see someone attractive or someone you like, you automatically get the urge to want to be intimate with them, have sex with them, without even having any mention of sex or any stimulation towards sex.&nbsp;&nbsp;</p><p>&nbsp;</p><p>More commonly, as couples who’ve been together for a long period of time, that spontaneous desire tends to go away. You’re used to seeing your partner, and so it then becomes&nbsp;responsive desire. So responsive desire is that you’re not really thinking about sex with your partner all the time.&nbsp;&nbsp;</p><p>&nbsp;</p><p>You’re busy doing your thing, they’re doing their thing. But when you get intimate, meaning you lie together, you’re with each other, you start being intimate and going into the moment of foreplay and then potentially having sex.&nbsp;&nbsp;</p><p>&nbsp;</p><p>You remember, yeah, I really do have a desire for this person and I really do enjoy it. And this is a very normal phenomenon, is not abnormal at all. In fact, it’s more common after you’ve been in a relationship for some period of time.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And this is because when you’re in a new relationship, you have all these really great feel good hormones around with this new excitement. Dopamine oxytocin, all these things. And as you grow with that person, you find that those hormones start to taper off and those feelings of excitement tend to decline a little bit.&nbsp;And again, that’s completely normal.&nbsp;</p><p>&nbsp;</p><p>However, it’s really important to figure out if this is the reason that you’re having trouble in your marriage, because it can become very stressful for a couple when one person is constantly trying to persuade the other person to have sex.&nbsp;One, they’re getting rejected all the time, so they’re feeling bad, and the other person is feeling very stressed out about having to say no all the time. And so it’s really important to address these issues.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And I’m going to give you some ways to talk about this at the end of the articles. So make sure you stick around.&nbsp;</p><p>&nbsp;</p><p><strong>Number three is social media.</strong>&nbsp;</p><p>&nbsp;</p><p>So there’s a few ways social media, the Internet, distractions, things like that are causing us to less desire sex with our partners.&nbsp;</p><p>&nbsp;</p><p>One is that these are just distractions. There are things that we’re doing at night before we go to bed. Many people are scrolling the Internet. Instead of actually talking to their partner, they’re looking on social media.&nbsp;&nbsp;</p><p>&nbsp;</p><p>They’re also seeing many, many beautiful people showing very curated pictures of themselves that have been edited and selected carefully to put on their social media feeds. And that can lead to you feeling a little bit more self-conscious about how, how you appear, about your body image and things like that.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And that can be detrimental, of course, in wanting to have sex with your partner. If you don’t feel confident in yourself, you won’t feel good about pursuing sex with your partner.&nbsp;</p><p>&nbsp;</p><p>And I think the other thing is, if you think about lives as they are today, even 30 years ago, we didn’t have the Internet; we didn’t have phones.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And the only real source of entertainment you had was TV. And that in itself also was not streaming, and you had to find a show you liked and watch it. And then, at some point, you would just get bored and turn it off.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And then, oh, you know what, there’s your partner, and let’s spend some time together. And oh wait, I remember enjoying your company and let’s have sex. Even before the TV was around, there was really nothing there to help entertain you.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Now there is a plethora of entertainment and other things that people are working on all the time that may distract from&nbsp;actually spending quality time with your partner.&nbsp;</p><p>&nbsp;</p><p><strong>And the last thing is the lack of communication.</strong>&nbsp;&nbsp;</p><p>&nbsp;</p><p>So very often we don’t want to hurt our partner’s feelings. We don’t want to bring up things that might be causing us to find them less appealing or less attractive. And also, if we’re the ones suffering with issues around our sexuality, whether it be difficulties having erections, difficulty climaxing, which makes us feel embarrassed.&nbsp;Again, that shame may limit people&nbsp;from actually bringing those conversations up with their partner.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And this is a real problem because then you’re both disgruntled and frustrated and no one’s talking about it.&nbsp;</p><p>&nbsp;</p><h2>How can you solve the problem of sexless marriage?&nbsp;</h2><h2>&nbsp;</h2><p>Well, the first thing is you got to talk about it, right? You got to have a conversation with your partner. You want to do it in a neutral place where you’re both relaxed, you’re not stressed, you’re not worried about performance, or maybe just have tried to have an intimate moment and it didn’t go as expected.&nbsp;That’s not the right place to bring it up.&nbsp;</p><p>&nbsp;</p><p>And it’s really important not to be accusatory. You can give your perspective, say I feel this way, this is how I feel, but don’t make it on them. It’s not because they always say no or because they do this or they do that.&nbsp;That will not lead to a productive conversation.&nbsp;</p><p>&nbsp;</p><p>And don’t expect for it to happen all at once. It may take several small conversations, but it’s important to stick with it because this is your relationship.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And if you want to have an intimate, happy relationship, this is an important part of it. And communication is key to having a great sex life.&nbsp;</p><p>&nbsp;</p><p><strong>Number two, schedule time for intimacy.</strong>&nbsp;</p><p>&nbsp;</p><p>I have previously said to schedule sex.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But I realized after learning from some other people that scheduling sex is actually somewhat stressful for people. But scheduling time for intimacy is not.&nbsp;Scheduling time for intimacy where sex may or may not happen, but you’re actually dedicating time during the week to spend quality time with your partner without distractions can be really meaningful&nbsp;in helping you rekindle that responsive desire and have an excitement for being together.&nbsp;</p><p>&nbsp;</p><p>If you remember when you were dating and you got really excited about that date you were going to have with your partner, you didn’t necessarily know that it was going to lead to sex, but you were excited just to have time with them.&nbsp;And you need to kind of rekindle that, put it on the calendar, make it a recurring thing.&nbsp;</p><p>&nbsp;</p><p>And lastly, remember that there are a lot of things that can affect someone’s sex drive. It can be hormonal problems.&nbsp;It can be body image issues. It can be medical conditions or medications that someone’s taking. It can be just someone’s feeling situational grief about something that’s going on in their life. And so it’s important to leave space for them to bring that up with you and realize that everyone has their own story, and they may not have felt comfortable sharing it with you at that moment in time.&nbsp;And that’s okay.&nbsp;</p><p>&nbsp;</p><p>But the important thing is for them to feel safe and supportive and you to give them time to reach you where you are.&nbsp;</p><p>&nbsp;</p><p>And always remember to take care of yourself.&nbsp;</p>"}}}]},"__N_SSG":true}