{"pageProps":{"article":[{"id":32,"attributes":{"title":"Can Holding Your Pee Cause Your Bladder to Burst? An Urologist clarifies","slug":"can-holding-your-pee-cause-your-bladder-to-burst-a-urologist-clarifies","createdAt":"2023-02-22T21:04:58.840Z","updatedAt":"2023-02-22T21:05:02.051Z","publishedAt":"2023-02-22T21:05:02.046Z","img":"https://images.pexels.com/photos/5490571/pexels-photo-5490571.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"What happens when you hold your urine too long? Can your bladder actually burst?\n\nAnd today I’m going to answer just that. \n\nSo what happens when your bladder fills is that your bladder has receptors and these receptors send signals to the brain.  \n\nThat brain then sends you signals of urge. It might be, hey, I think you should maybe go to the bathroom soon. And soon it becomes, hey, you should go very suits. And other times it’s like, hey, you better go or you’re going to pee your pants right? We’ve all been there.\n\nSo what happens when you hold your urine?\n\nWell, when you hold it, your body can actually learn to override these signals because the average person can hold up to two cups of urine.  \n\nAnd so what happens is you get the urge, you distract yourself and the urge goes away. And so then you continue doing whatever it is you’re doing, like watching a movie or writing a paper or whatever it is that you can’t get up from. \n\nAnd then eventually the urge comes back and then you go again and do the same thing. And I’m sure everyone watching here has held their urine at some point for several hours, right? You’ve been watching a movie, you don’t want to get up.  \n\nYou’re in a long car ride, you don’t want to stop the car. And so we’ve all been there. ","tags":["bladder"],"readTime":5,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":32,"content":"<h2 data-pm-slice=\"0 0 []\">What happens when you hold your urine too long? Can your bladder actually burst?</h2><p>And today I’m going to answer just that.&nbsp;</p><p>So what happens when your bladder fills is that your bladder has receptors and these receptors send signals to the brain.&nbsp;&nbsp;</p><p>That brain then sends you signals of urge. It might be, hey, I think you should maybe go to the bathroom soon. And soon it becomes, hey, you should go very suits. And other times it’s like, hey, you better go or you’re going to pee your pants right? We’ve all been there.</p><h2>So what happens when you hold your urine?</h2><p>Well, when you hold it, your body can actually learn to override these signals because the average person can hold up to two cups of urine.&nbsp;&nbsp;</p><p>And so what happens is you get the urge, you distract yourself and the urge goes away. And so then you continue doing whatever it is you’re doing, like watching a movie or writing a paper or whatever it is that you can’t get up from.&nbsp;</p><p>And then eventually the urge comes back and then you go again and do the same thing. And I’m sure everyone watching here has held their urine at some point for several hours, right? You’ve been watching a movie, you don’t want to get up.&nbsp;&nbsp;</p><p>You’re in a long car ride, you don’t want to stop the car. And so we’ve all been there.&nbsp;</p><h2>Is it dangerous to hold your urine?&nbsp;</h2><p>Well, maybe if you make a habit of holding your urine, a few things can happen.&nbsp;</p><p>The first one is <strong>Urinary tract infections (UTI)</strong>.&nbsp;&nbsp;</p><p>So when your urine sits in your bladder, it’s like food for bacteria.&nbsp;</p><p>People used to think that urine was completely sterile, but now we know that that’s not the case. There’s always some bacteria in the urine.&nbsp;&nbsp;</p><p>So when that urine is sitting in the bladder for long periods of time, it can multiply. And then you can be at risk for a urinary tract infection if it sits in there too long.&nbsp;</p><p>And in some people, when you continue holding your bladder for long periods of time and we see this all the time in people like teachers, bus drivers, nurses.&nbsp;&nbsp;</p><p>That they hold their urine prolonged periods of time because they’re busy doing other things, teaching children, driving a bus or a truck, or taking care of patients, right?</p><p>So it’s hard to make time to go to the bathroom, but over time, if you do that for year after year, the muscles in your bladder become weaker because you’ve been stretching out your bladder for years and years and years.&nbsp;&nbsp;</p><p>And now your bladder can’t squeeze as well as it used to. And so in those cases, you can start retaining more urine. And that can, over time, either lead to you getting more urinary tract infections or it can lead to you having difficulty emptying your bladder.&nbsp;&nbsp;</p><p>In which case you might actually need to catheterize to empty your bladder or figure out another way to empty your bladder.&nbsp;</p><p>And other times it might just show up as other urinary problems, like needing to go to the bathroom more frequently.&nbsp;</p><h2>Bladder problems&nbsp;</h2><p>Because if you’re not emptying completely and you leave a little bit behind, as soon as the bladder fills back up, you’re going to have to go again. And sometimes that can even lead to having accidents because you’re constantly getting urges to go and sometimes you can’t make it until you have accidents.&nbsp;&nbsp;</p><p>Or even at nighttime you might find yourself waking up at night more often. Of course, this is not the only reason for these issues. And I made tons of articles&nbsp;on overactive bladder and nocturia are having urination at night so you can learn more about those issues.&nbsp;&nbsp;</p><h2>Kidney problems</h2><p>And lastly, in rare cases it can lead to kidney problems. So if you’re constantly not emptying your bladder and your bladder becomes dysfunctional, it can hold lots and lots of urine, but you’re not emptying that.&nbsp;Urine can then back up to the kidneys and create kidney failure.&nbsp;</p><p>So if you’re noticing that you’re having bladder issues, this is why it’s important to see a urologist to make sure that you are emptying your bladder and that your bladder is safe and not having issues where urine is backing up to your kidneys and you end up in the hospital with problems with your kidneys.&nbsp;&nbsp;</p><h2>So that brings me to the question -⁠&nbsp;Can you burst your bladder?&nbsp;</h2><p>Like, can you hold it long enough that it bursts? And the answer is. Well, maybe for a normal, healthy individual, it’s very difficult to burst your bladder, and that’s because we see people all the time in the emergency room who haven’t peed for three days, and their bladder is not burst.&nbsp;&nbsp;</p><p>It’s just really, really full and really, really uncomfortable. It’s very uncommon for a normal, healthy individual to burst their bladder. However, if you’ve recently had surgery on your bladder or you’ve had a reconstruction of the bladder with&nbsp;something like using bowel to your bladder or anything else, then&nbsp;yes, you can be&nbsp;at a higher risk for actually perforating or bursting your bladder.&nbsp;</p><p>If you’re worried and you’re having abdominal pain, you haven’t peed in a while, make sure you get to the hospital immediately, because if you’ve actually perforated or burst your bladder, you will need emergency surgery to fix that, and you can get, actually, very, very ill.&nbsp;&nbsp;</p><p>Again. This is a rare thing that happens, but certainly something you don’t want to risk having.&nbsp;</p><p>And as always, remember to take care of yourself.&nbsp;</p><p>Thank you.&nbsp;</p>"}}}]},"__N_SSG":true}