{"pageProps":{"article":[{"id":10,"attributes":{"title":"Intermittent Fasting: Pros and cons","slug":"intermittent-fasting-pros-and-cons","createdAt":"2023-02-03T01:44:22.565Z","updatedAt":"2023-02-04T23:30:43.135Z","publishedAt":"2023-02-03T01:52:01.953Z","img":"https://images.pexels.com/photos/70497/pexels-photo-70497.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Our bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast. \n\nThat’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving. \n\nWhen you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy. \n\nThere are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is. \n\nBecause if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting. \n\nThere’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is IF beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising. \n\nNow, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can IF help you lose weight? \n\nYou have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories. \n\nOur thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body. \n\nThe body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body. \n\nWhat can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention. \n\nNow, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine. \n\nLet’s talk about some of the shortcomings of IF. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating. \n\nSecond, we don’t know which form of IF is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign. \n\nFour. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit. ","tags":["health","lifestyle"],"readTime":4,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":10,"content":"<p>Before we get into the pros and cons.&nbsp;And if you should do it, let’s talk about what intermittent fasting actually is. Human fasting is not a new concept by any means. Humans have been doing it for millennia. <strong>Intermittent fasting</strong> is just a rebranding of something thing that we have already been doing.&nbsp;</p><p>&nbsp;</p><p>Our bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not&nbsp;even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast.&nbsp;</p><p>&nbsp;</p><p>That’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving.&nbsp;</p><p>&nbsp;</p><p>When you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy.&nbsp;</p><p>&nbsp;</p><p>There are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is.&nbsp;</p><p>&nbsp;</p><p>Because if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting.&nbsp;</p><p>&nbsp;</p><p>There’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is <strong>Intermittent Fasting</strong>&nbsp;beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising.&nbsp;</p><p>&nbsp;</p><p>Now, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can <strong>Intermittent Fasting</strong>&nbsp;help you lose weight?&nbsp;</p><p>&nbsp;</p><p>You have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories.&nbsp;</p><p>&nbsp;</p><p>Our thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body.&nbsp;</p><p>&nbsp;</p><p>The body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body.&nbsp;</p><p>&nbsp;</p><p>What can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention.&nbsp;</p><p>&nbsp;</p><p>Now, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine.&nbsp;</p><p>&nbsp;</p><p>Let’s talk about some of the <strong>shortcomings</strong> of <strong>Intermittent Fasting</strong>. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating.&nbsp;</p><p>&nbsp;</p><p>Second, we don’t know which form of <strong>Intermittent Fasting</strong>&nbsp;is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign.&nbsp;</p><p>&nbsp;</p><p>Four. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit.</p><p>&nbsp;</p><p>But now does this benefit still hold up 1, 2,3 ....10 years down the line? We don’t know that yet,&nbsp;when it comes to if and five, it’s not easy for everybody to fight off those cravings on fasting days. All right, my final take on <strong>Intermittent Fasting</strong>, I think it’s a great concept with some really promising medical research behind it.&nbsp;</p><p>&nbsp;</p><p>I think that if you can skip a meal, you can skip a breakfast here and there, you’re going to see some benefits. Does that mean you should go on this very rigid diet where you’re doing the five and two or 16/8?&nbsp;</p><p>&nbsp;</p><p>I don’t think we should quite make this a religious rigorous part of our everyday life because we don’t know the long-term consequences of it. But in a society that’s prone to overeating, a fasting day won’t hurt and will probably help, as always, stay happy and healthy.&nbsp;</p>"}}}]},"__N_SSG":true}