{"pageProps":{"article":[{"id":16,"attributes":{"title":"Natural and Practical Way to End Stress and Lower Cortisol","slug":"natural-and-practical-way-to-end-stress-and-lower-cortisol","createdAt":"2023-02-06T23:39:37.062Z","updatedAt":"2023-02-06T23:46:25.470Z","publishedAt":"2023-02-06T23:39:40.882Z","img":"https://images.pexels.com/photos/4810369/pexels-photo-4810369.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"And as we are more exposed to this threat of danger, it can really affect every single system in our body. But there’s one thing that’s very, very important, and I want to just talk about it, and that's changing your viewpoint about the environment. I know this might be hard to believe, but your environment is not as dangerous as they want you to believe. Recently, I started to really look at the videos and different TV programmes I was watching, and it just hit me how many messages of fear I was exposed to without any solutions.\n\nNow, I’m definitely not saying to ignore some of these dangers, but when you are exposed to them, try like heck to have a relaxed viewpoint, staying in action to help solve the problem and improve things. But at some point, we need to start filtering out this threat of danger because it’s just not healthy for our bodies. You should start watching TV programmes and hang out with people who give you solutions that emphasise the good news. Talk about the good things to offset the massive danger signals that our body is constantly fed.\n\nNow, let me just go through a couple of things, because this is actually a very important topic. That is the flutter fight, the protective mode we enter in response to the threat of stress. Whereas the other system, called the parasympathetic, is all about growth, sleep, digestion, repair, and healing. In practice, I used to have a test called a «heart rate durability test» that would measure how much of the sympathetic nervous system was being activated versus how much parasympathetic.\n\nAnd boy, nearly everyone that came in was just so jacked up to the right, which is Because the environment we're in is considered extremely dangerous, we have sympathetic dominance. I mean, if there aren't enough things going wrong, to have other people manufacture more of them is complete insanity. So, I believe it is critical that you understand what happens to your biology when you are subjected to long-term chronic stress. Let’s go on to the immune system.\n\nStress suppresses the immune system. And therefore, when you go to the doctor and you have inflammation or some type of autoimmune disease, they inject you with prednisone, which takes that away temporarily because prednisone is a type of cortisol that is produced by the adrenal glands, which are activated by stress, and that is suppressing all the immune reactions. You have decreased sperm production. Well, if you’re trying to be on the ketogenic diet, your whole metabolism shifts back to glucose production.\n\nThat’s right, because cortisol is a glucocorticoid, so it increases glucose and neogenesis, the production of new sugar in your liver. So when you go through chronic stress, what’s happening is that you’re just pumping out all this sugar that’s not coming from your diet. Because when you’re in stress mode, your body needs this quick energy. When you go through chronic stress, your triglycerides go up, your HDL goes down, and your LDL goes up.\n\nYour ability to detoxify I’m talking about certain enzymes in your liver. These are the enzymes that convert poisons into harmless, water-soluble things that can be released from the body. Those are inhibited when you go through chronic stress. So there goes the fat digestion.\n\nEven your pancreatic enzymes and the enzymes from your small intestine will be inhibited, cutting down your ability to digest. Your production of hydrochloric acid is going to go down, too. So there goes your complete digestion of proteins, your absorption of minerals, and the killing of pathogens. On top of all the other barriers to vitamin D absorption, stress will actually slow down the absorption of vitamin D. Even the fascia, which is similar to the stuff that surrounds the muscles and is highly innovated by your nerves and brain, has a lot of information coming down to it, around the ligaments, around your muscles, and it tightens and becomes more restricted.\n\nWhen you’re under chronic stress, you maintain this posture right here, which is kind of like being in protection mode. You know, your posture starts going down, and it all has to do with that fascia. In a chronic state of stress, you will not be thinking analytically, thinking about things, solving problems, coming up with good solutions, being creative, or having imagination. Instead, it’s going to be more like reaction mode because you need a relaxed state of mind to come up with solutions.\n\nYou need your creativity to come up with really good strategies and solutions. The last point I want to bring up is your genes. What happens to your genes when you’re under stress? Well, all the bad genes get activated, okay? and all the good genes get suppressed. I’m talking about the activation of cancer genes.\n\nI’m talking about the activation of inflammatory genes and things like that. But one thing I want to bring up is that your genes really don’t cause anything. The genes are associated with a lot of bad things. But if you know how to control your genes, you’re totally going to be in the driver’s seat.\n\nNumber one, we must change our attitude towards our environment. We must also start filtering out the threat of danger to which we’re exposed. If you start watching certain videos that don’t give you a solution and at the end of the video you feel worse than before you watched the video, then you might need to filter those things out. Therapy for me is getting out in nature, getting as much space as possible, and really kind of getting connected to my environment.\n\nNow, the other thing to do is to physically flesh out a lot of this extra adrenaline and this extra cortisol that have been accumulated through the day of exposure to all these things. I mean, I have to physically work out every single day just to kind of flush things out and help me sleep. Because of the other point about the adrenaline and cortisol, it’s shifting a lot of energy that should be in your immune system, should be in repair, should be in digestion, and it’s ending up in the muscles. But because there’s no more tiger around, we have more mental energy, and that whole mechanism is still there.\n\nSo you’re going to have to exercise to get those hormones out of your system. Now, that being said, there are a lot of additional things you can do to help with stress. They're not as important as changing your viewpoint, but they’re still important.\n\n\n","tags":["chronic stress","immune system"],"readTime":11,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":16,"content":"<p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Let’s talk about stress. Unfortunately, we are all being bathed in chronic stress, literally twenty-four hours a day. And this is just not healthy. There are certain individuals and groups that are constantly putting it out.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Your environment is very dangerous, okay? Danger, danger, danger! And as we are more exposed to this threat of danger, it can really affect every single system in our body. But there’s one thing that’s very, very important, and I want to just talk about it, and that's changing your viewpoint about the environment.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">I know this might be hard to believe, but your environment is not as dangerous as they want you to believe. Now, it is dangerous; don’t get me wrong. And there are certain individuals who profit from keeping the public in a fierce state, and many times they exaggerate this.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">And it's simply not healthy to focus our attention on negativity all the time.So I want you to do something right now. I want you just to look outside right now, okay? What do you see? Do you see any dangerous things?</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">I see a tree out there. I don’t see any hurricanes. No tsunamis. It looks pretty safe out there. Now look at the ground. Look at the floor right now. Are you sitting on a potential sinkhole right now? Do you feel that there are any termites that have destroyed your foundation and that you’re going to just cave right in?</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">The answer is no. All right, so go ahead and put your hand on the wall next to you, right? Do you feel like it’s hot, like there are flames? as if your house was on fire?No. But, when you think about it, if the average person is too simple to absorb all of this danger twenty-four hours a day, seven days a week, I'm not sure how they can survive.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">So the most important thing to do is to really change your viewpoint. and start to filter out some of the things that you’re exposed to. Recently, I started to really look at the videos and different TV programmes I was watching, and it just hit me how many messages of fear I was exposed to without any solutions.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">So anytime someone gives you a doom-and-gloom message without a solution, don’t watch it. Why? Because now you’re going to start solving these problems when you should be sleeping. Now, I’m definitely not saying to ignore some of these dangers, but when you are exposed to them, try like heck to have a relaxed viewpoint, staying in action to help solve the problem and improve things.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">But at some point, we need to start filtering out this threat of danger because it’s just not healthy for our bodies. That also includes the people that you hang out with. I mean, there are so many people out there.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">I’ve had people around me who would only give me bad news. never have any good news. You should start watching TV programmes and hang out with people who give you solutions that emphasise the good news.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Talk about the good things to offset the massive danger signals that our body is constantly fed. Now, let me just go through a couple of things, because this is actually a very important topic. You have a sympathetic nervous system, okay?</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">That is the flutter fight, the protective mode we enter in response to the threat of stress.And every cell in our body switches to a completely different program.Whereas the other system, called the parasympathetic, is all about growth, sleep, digestion, repair, and healing.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">That’s a completely different program. In practice, I used to have a test called a \"heart rate durability test\" that would measure how much of the sympathetic nervous system was being activated versus how much parasympathetic.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">And boy, nearly everyone that came in was just so jacked up to the right, which is Because the environment we're in is considered extremely dangerous, we have sympathetic dominance.And I will say a certain amount of that has been manufactured.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">I mean, if there aren't enough things going wrong, to have other people manufacture more of them is complete insanity. So, I believe it is critical that you understand what happens to your biology when you are subjected to long-term chronic stress.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">First of all, you’re going to have a less diversified microbiome, and you’re going to have more pathogenic bacteria. So your entire gut microbiome changes. And all the points I’m going to mention today are based on some research on relating chronic, sympathetic, high-cortisol stress to the various systems of your body.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Let’s go on to the immune system. What happens to your immune system when you have sustained stress? It basically puts to sleep the T cells that are normally there to protect you, kill cancer cells, and kill viruses.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">The duration of infections takes way longer. You have what’s called immunosuppression. Stress suppresses the immune system. And therefore, when you go to the doctor and you have inflammation or some type of autoimmune disease, they inject you with prednisone, which takes that away temporarily because prednisone is a type of cortisol that is produced by the adrenal glands, which are activated by stress, and that is suppressing all the immune reactions.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">And as soon as that wears off, you get a lot more inflammation. So stress will increase inflammation. All right. What about fertility? Do you become more fertile? No, you become less fertile.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">You have decreased sperm production. You have less implanting of the egg in the uterus, so you become less fertile. You usually lose your menstrual cycle. And on top of that, you lose your libido. Usually, when people are stressed out, they don’t have any sexual drive.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">All right, now, what happens to the fuel system in your body? Well, if you’re trying to be on the ketogenic diet, your whole metabolism shifts back to glucose production. That’s right, because cortisol is a glucocorticoid, so it increases glucose and neogenesis, the production of new sugar in your liver.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">So when you go through chronic stress, what’s happening is that you’re just pumping out all this sugar that’s not coming from your diet. It’s coming from your proteins—the muscle proteins in your butt and the muscle proteins in your legs—and even fat and ketones are turned into glucose.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">And that glucose can then increase insulin, which increases your risk of getting diabetes. Now, why is this? Because when you’re in stress mode, your body needs this quick energy. What about lipids, like cholesterol, and things like that?</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">This is interesting. When you go through chronic stress, your triglycerides go up, your HDL goes down, and your LDL goes up. And if you have these large, buoyant, particle-size types of LDL, they're going to switch to the small, dense particle sizes, which are the more pathogenic ones that actually can invade the arteries.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">So your profile for cholesterol gets much worse when you go through stress. Like I said before, having a non-serious, relaxed state of mind is so important. Now, this next one is really interesting.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Your ability to detoxify I’m talking about certain enzymes in your liver. They’re called cytochrome P450, phase one, phase two enzymes, okay? These are the enzymes that convert poisons into harmless, water-soluble things that can be released from the body.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">So we’re going from fatiguable poisons to harmless particles, right? Well, guess what? Those are inhibited when you go through chronic stress. wild, so you can’t detoxify that. So you're going to be carrying toxins.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">What about digestion as a whole? You will, however, digest much more slowly.You will not be able to release the bile salts from your liver, which is interesting. So there goes the fat digestion.</span></p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Even your pancreatic enzymes and the enzymes from your small intestine will be inhibited, cutting down your ability to digest. Your production of hydrochloric acid is going to go down, too. So there goes your complete digestion of proteins, your absorption of minerals, and the killing of pathogens.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Your mucus lining in the stomach, the small intestine, and the large bowel is inhibited by this stress state as well. And that’s kind of like the immune barrier. And then your overall absorption of vitamins and minerals is going to be lessened.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Now, this next one is also interesting. Vitamin D absorption There’s a receptor for vitamin D called the vitamin D receptor. And the reception or absorption of vitamin D through that receptor is diminished with stress.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">On top of all the other barriers to vitamin D absorption, stress will actually slow down the absorption of vitamin D. Even the fascia, which is similar to the stuff that surrounds the muscles and is highly innovated by your nerves and brain, has a lot of information coming down to it, around the ligaments, around your muscles, and it tightens and becomes more restricted.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">You lose your range of motion; you lose your blood flow to your fascia. When you’re under chronic stress, you maintain this posture right here, which is kind of like being in protection mode. This is your chance to fly or fight.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">You know, your posture starts going down, and it all has to do with that fascia. Now, what happens to the brain when you’re in chronic sympathetic nervous system overdrive? Well, the hippocampus, the structure that’s involved with the relay of memories and learning and cognition, is all inhibited because that part of the brain starts to shrink.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Also, it lowers the function of your cerebral cortex. You kind of need that part of the brain. Now, another structure is activated in your brain. And I don’t know if you’ve ever heard about the structure, but it’s called the amygdala.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">The amygdala has everything to do with fear and anxiety, okay? It’s kind of like your adrenal glands, but in the brain. As a result, it will respond to stress states.In a chronic state of stress, you will not be thinking analytically, thinking about things, solving problems, coming up with good solutions, being creative, or having imagination.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Instead, it’s going to be more like reaction mode because you need a relaxed state of mind to come up with solutions. You need your creativity to come up with really good strategies and solutions. The last point I want to bring up is your genes.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">What happens to your genes when you’re under stress? Well, all the bad genes get activated, okay? and all the good genes get suppressed. I’m talking about the activation of cancer genes. I’m talking about the activation of inflammatory genes and things like that.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">But one thing I want to bring up is that your genes really don’t cause anything. They don’t cause problems for you. It's epigenetics, which means \"above genetics\"; your lifestyle is really what's driving these genetics.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">And all you need to understand is how to turn on and turn off certain genes. And those switches are activated by certain lifestyle changes. And I cover these lifestyle changes in a lot of my videos. The genes are associated with a lot of bad things.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">But if you know how to control your genes, you’re totally going to be in the driver’s seat. Number one, we must change our attitude towards our environment. We must also start filtering out the threat of danger to which we’re exposed.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">If you start watching certain videos that don’t give you a solution and at the end of the video you feel worse than before you watched the video, then you might need to filter those things out. Therapy for me is getting out in nature, getting as much space as possible, and really kind of getting connected to my environment.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Now, the other thing to do is to physically flesh out a lot of this extra adrenaline and this extra cortisol that have been accumulated through the day of exposure to all these things. This means routine, consistent exercise, okay?</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">Physical work outside is necessary so you can start flushing out these neurotransmitters and hormones that are creating a lot of this damage. Because the last thing you want to do is go through a lot of mental stress and then just go to bed at night.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">You’re not going to sleep that well, so exercise is a necessity. I mean, I have to physically work out every single day just to kind of flush things out and help me sleep. Because of the other point about the adrenaline and cortisol, it’s shifting a lot of energy that should be in your immune system, should be in repair, should be in digestion, and it’s ending up in the muscles. So you have enough energy to run away from the tiger, right?</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">But because there’s no more tiger around, we have more mental energy, and that whole mechanism is still there. So you’re going to have to exercise to get those hormones out of your system. Now, that being said, there are a lot of additional things you can do to help with stress.</span></p><p style=\"color:#252525;\">&nbsp;</p><p style=\"color:#252525;\"><span style=\"color:#546e7a;\">They're not as important as changing your viewpoint, but they’re still important. and I put that article right here. Check it out.</span></p>"}}}]},"__N_SSG":true}