{"pageProps":{"article":[{"id":37,"attributes":{"title":"Sperm counts are declining worldwide | Is there a fertility crisis? What are your options?","slug":"sperm-counts-are-declining-worldwide-is-there-a-fertility-crisis-what-are-your-options","createdAt":"2023-02-25T22:23:00.243Z","updatedAt":"2023-02-25T22:23:04.128Z","publishedAt":"2023-02-25T22:23:04.125Z","img":"https://images.pexels.com/photos/3922658/pexels-photo-3922658.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Total sperm counts for men are going down worldwide.  \n\nAnd today I’m going to explain a new study that came out showing that total sperm count and concentrations have gone down worldwide over the last 50 years.  \n\nSperm count Study\n\nIn this study, researchers did a meta analysis, meaning they took all the studies. In fact, 233 studies over the course of almost 50 years and looked at what happened to total sperm count and sperm concentration.  \n\nAnd these, if you don’t know, are essentially parameters that we look at when we get semen analyses to assess if people are maybe subfertile or infertile and maybe contributing to difficulty having a child.  \n\nThey specifically looked at studies that didn’t include men who were there for infertility. They included two groups. One, that was kind of unselected, meaning it was like a young group of men in the military getting semen analyses to start their jobs.  \n\nAnd the other group was men who were fertile. Either men who had a biological child or their partner were pregnant with their biologic child. \n\nAnd importantly, they must have actually produced a sample in the normal way, meaning they had to masturbate. They couldn’t have used some other way to receive a sample. \n\nAnd what they found is really shocking that from the years of 1973 to 2018, sperm counts dropped by 50% and total sperm concentrations decreased by 62%. That is insane. \n\nTo be specific, sperm counts went from 101 million per ml to 49 million per ml. And total sperm concentration went from 335 million to 126 million. \n\n This was specifically in the unselected cohort, meaning the men who were just getting semen analyses for whatever reason not in the fertile group.  \n\nIn fact, the fertile group didn’t really have much of a change in their semen analysis over those 50 years or it was much, much less. And this study was really well done. They were very strict in their inclusion criteria and their statistics were spot on.  \n\nSperm count for men\n\nAnd furthermore, they actually saw other studies that had looked at this similar question and saw similar declines. So yes, sperm counts are going down, but what does that even mean? \n\nSo in fact, while the numbers are getting lower, they’re still not in the infertile range.  \n\nWe know that above 40 million per ml it’s pretty easy for men to father children and in fact; we don’t even get worried until they’re below 15 million /ml so we’re still in a good range. \n\nAnd this study is done over 50 years. And over 50 years, the way we analyze sperm has changed over time and so it may not be comparing apples to oranges all the time. \n\nWhen you look at least the United States data on the number of couples that have been infertile from 2002 until now, that number hasn’t really changed.  \n\nAnd infertile means they’ve been trying to conceive for twelve months or more and haven’t had a positive pregnancy. \n\nSo what does this mean for men’s health and men worldwide? \n\n Well, in fact, there have been some very good studies that have been done in the past that have linked poor sperm parameters to mortality. That means death. \n\nWhy would that even make sense? Like, why would lower sperm parameters mean that you’re more likely to die from any cause? \n\n Why do men think their sperm is declining?\n\nOne of the reasons people think that men are having declining sperm counts is because their mothers in utero, when they’re in utero, are exposed to endocrine disrupting chemicals or have exposure to estrogens which then affect them later on in life.  \n\nAnd these exposed exposures can also cause problems down the line with their health. \n\nAnother reason is that typically the problems that cause issues with sperm are due to defects in DNA. So DNA is the building blocks for our cells.  \n\nAnd so usually the cells for sperm are different from the cells from your body because they carry half the genetic materials as the cells in your entire body. But it’s possible that the things causing DNA damage in the sperm are also causing DNA damage in the rest of your body, which may eventually lead to problems like cancers.  \n\nAnother theory is that these abnormalities in sperm arm are caused by lower testosterone. And I’ve written tons of articles on low testosterone, but low testosterone is a risk factor for having issues with your heart and causing cardiovascular disease.  \n\nAnd so perhaps these men who have lower semen parameters also have lower testosterone, which over time may link them to heart disease and other things that will lead to death. \n\nAnd lastly, we know that there are certain lifestyle factors that will cause both issues with mortality and issues with sperm production.  \n\nFor example, smoking. Smoking will cause you to have poor sperm production and ultimately will cause many, many problems with your health, including heart disease, high blood pressure potential, lung cancer, bladder cancer and so much more. So if you’re reading this, quit smoking today. \n\nSo what does the data tell us? \n\n There are two good studies that have looked at sperm concentration and linked it to mortality. \n\nSo in a group of 40,000 Danish men, they looked at sperm concentration and they tracked these men for 40 years.  \n\nAnd they found that those who had better sperm parameters, higher sperm concentrations, or higher quality sperm tend to live longer. And those with lower quality sperm, particularly around 40 million /ml or less, were likely to have higher rates of mortality.  \n\nInterestingly, the deaths that were seen in the study were kind of very diverse. They weren’t specifically deaths that were associated with things like smoking or lifestyle or heart disease that you could get from having low testosterone, none of that.  \n\nSo the thought is that maybe sperm quality is actually like a biomarker for how healthy you are. \n\n And also it wouldn’t be due to things that were from in utero because some of the theories also suggest that in utero exposures may lead to heart disease and diabetes down the line as well. And they didn’t see that specifically. \n\n 12,000 men, they looked at their rates of mortality and what they found was that even after controlling for all these diseases, men who had had lower sperm counts had a 2.3 fold higher risk of death compared to those who had normal semen parameters.  \n\nHowever, this could be a signal that there is something that we need to pay attention to, that perhaps we should look at which things in our environment may be causing sperm counts to go down and try to fix those.  \n\nWhat can you do to raise your sperm count?\n\n I’ve written an article on optimizing your sperm health and you can check that out as the article. It’s actually very informative and very good, but I’ll cover a few things right here.  \n\nNumber one is environmental factors. \n\nIf you’re getting exposed to certain chemicals in the workplace like pesticides or other toxins that can obviously affect sperm production. \n\nSperm is produced in the testicles, which hang outside the body for a reason.  \n\nThey need a very specific environment to thrive in, which means they are very sensitive to any sort of what we call oxidative stress. And that can be from anything in our environment. That includes things like chemicals, pesticides and including things that are called endocrine disrupting chemicals.  \n\nMost often, you’ll see them described as BPA or phthalates in plastics and things like that. So avoiding those sorts of things in your environment can be very helpful. \n\nI often tell my patients, try not to eat out of plastic. If you get something in a plastic container, transfer it to a glass. If you have a bottle, make sure it’s in a glass bottle or a metal bottle instead of using a plastic water bottle. \n\nAnother thing is, what are you putting in your body?  \n\nSmoking obviously, we’ve discussed this a very strong predictor of having poor sperm production because it’s a toxin. Similarly, excess alcohol can cause the same problem. It can cause reduced sperm production. \n\nAnd food, so there’s not a lot of data on specific diets. But the most studied diet is the Mediterranean diet, which is rich in healthy oils like avocado and olive oil and nuts and seeds and unprocessed grains, unprocessed foods and things like fish.  \n\nI think the key is to have a plant forward diet. Eat lots of vegetables, lots of fruits, and things that are unprocessed. \n\n Stress is another big factor. Obviously, our lives are getting more and more stressful as time goes on, with electronic devices demanding our attention all the time.  \n\nBeing accessible to people all the time can add to a lot of stress in our day, so finding ways to reduce stress on a daily basis is really, really valuable. \n\n And lastly, try to avoid hot tubs or saunas, particularly if you’re trying to conceive.  \n\nExposing your testicles to hot temperatures for long periods of time will reduce sperm production. So trying to stay away from those for long periods of time can be helpful, especially if you’re trying to have a baby.  \n","tags":["sperm count"],"readTime":8,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":37,"content":"<h2 data-pm-slice=\"0 0 []\">Total sperm counts for men are going down worldwide.&nbsp;&nbsp;</h2><p data-pm-slice=\"0 0 []\">&nbsp;</p><p>And today I’m going to explain a new study that came out showing that total sperm count and concentrations have gone down worldwide over the last 50 years.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Sperm count Study</h2><p>&nbsp;</p><p>In this study, researchers did a meta analysis, meaning they took all the studies. In fact, 233 studies over the course of almost 50 years and looked at what happened to total sperm count and sperm concentration.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And these, if you don’t know, are essentially parameters that we look at when we get semen analyses to assess if people are maybe subfertile or infertile and maybe contributing to difficulty having a child.&nbsp;&nbsp;</p><p>&nbsp;</p><p>They specifically looked at studies that didn’t include men who were there for infertility. They included two groups. One, that was kind of unselected, meaning it was like a young group of men in the military getting semen analyses to start their jobs.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And the other group was men who were fertile. Either men who had a biological child or their partner were pregnant with their biologic child.&nbsp;</p><p>&nbsp;</p><p>And importantly, they must have actually produced a sample in the normal way, meaning they had to masturbate.&nbsp;They couldn’t have used some other way to receive a sample.&nbsp;</p><p>&nbsp;</p><p>And what they found is really shocking that from the years of 1973 to 2018, sperm counts dropped by 50% and total sperm concentrations decreased by 62%.&nbsp;That is insane.&nbsp;</p><p>&nbsp;</p><p>To be specific, sperm counts went from 101 million per ml to 49 million per ml.&nbsp;And total sperm concentration went from 335 million to 126 million.&nbsp;</p><p>&nbsp;</p><p>This was specifically in the unselected cohort, meaning the men who were just getting semen analyses for whatever reason not in the fertile group.&nbsp;&nbsp;</p><p>&nbsp;</p><p>In fact, the fertile group didn’t really have much of a change in their semen analysis over those 50 years or it was much, much less. And this study was really well done. They were very strict in their inclusion criteria and their statistics were spot on.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Sperm count for men</h2><p>&nbsp;</p><p>And furthermore, they actually saw other studies that had looked at this similar question and saw similar declines. So yes, sperm counts are going down, but what does that even mean?</p><p>&nbsp;</p><p>So in fact, while the numbers are getting lower, they’re still not in the infertile range.&nbsp;&nbsp;</p><p>&nbsp;</p><p>We know that above 40 million per ml&nbsp;it’s pretty easy for men to father children and in fact; we don’t even get worried until they’re below 15 million /ml so we’re still in a good range.&nbsp;</p><p>&nbsp;</p><p>And this study is done over 50 years.&nbsp;And over 50 years, the way we analyze sperm has changed over time and so it may not be comparing apples to oranges all the time.&nbsp;</p><p>&nbsp;</p><p>When you look at least the United States data on the number of couples that have been infertile from 2002 until now, that number hasn’t really changed.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And infertile means they’ve been trying to conceive for twelve months or more and haven’t had a positive pregnancy.&nbsp;</p><p>&nbsp;</p><h2>So what does this mean for men’s health and men worldwide?&nbsp;</h2><p>&nbsp;</p><p>Well, in fact, there have been some very good studies that have been done in the past that have linked poor sperm parameters to mortality.&nbsp;That means death.&nbsp;</p><p>&nbsp;</p><p>Why would that even make sense? Like, why would lower sperm parameters mean that you’re more likely to die from any cause?&nbsp;</p><p>&nbsp;</p><h2>Why do men think their sperm is declining?</h2><p>&nbsp;</p><p>One of the reasons people think that men are having declining sperm counts is because their mothers in utero, when they’re in utero, are exposed to endocrine disrupting chemicals or have exposure to estrogens which then affect them later on in life.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And these exposed exposures can also cause problems down the line with their health.&nbsp;</p><p>&nbsp;</p><p>Another reason is that typically the problems that cause issues with sperm are due to defects in DNA. So DNA is the building blocks for our cells.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And so usually the cells for sperm are different from the cells from your body because they carry half the genetic materials as the cells in your entire body. But it’s possible that the things causing DNA damage in the sperm are also causing DNA damage in the rest of your body, which may eventually lead to problems like cancers.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Another theory is that these abnormalities in sperm arm are caused by lower testosterone. And I’ve written&nbsp;tons of articles&nbsp;on low testosterone, but low testosterone is a risk factor for having issues with your heart and causing cardiovascular disease.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And so perhaps these men who have lower semen parameters also have lower testosterone, which over time may link them to heart disease and other things that will lead to death.&nbsp;</p><p>&nbsp;</p><p>And lastly, we know that there are certain lifestyle factors that will cause both issues with mortality and issues with sperm production.&nbsp;&nbsp;</p><p>&nbsp;</p><p>For example, smoking. Smoking will cause you to have poor sperm production and ultimately will cause many, many problems with your health, including heart disease, high blood pressure potential, lung cancer, bladder cancer and so much more.&nbsp;So if you’re reading&nbsp;this, quit smoking today.&nbsp;</p><p>&nbsp;</p><p><strong>So what does the data tell us?</strong>&nbsp;</p><p>&nbsp;</p><p>There are two good studies that have looked at sperm concentration and linked it to mortality.&nbsp;</p><p>&nbsp;</p><p>So in a group of 40,000 Danish men, they looked at sperm concentration and they tracked these men for 40 years.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And they found that those who had better sperm parameters, higher sperm concentrations, or higher quality sperm tend to live longer. And those with lower quality sperm, particularly around 40 million /ml or less, were likely to have higher rates of mortality.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Interestingly, the deaths that were seen in the study were kind of very diverse. They weren’t specifically deaths that were associated with things like smoking or lifestyle or heart disease that you could get from having low testosterone, none of that.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So the thought is that maybe sperm quality is actually like a biomarker for how healthy you are.</p><p>&nbsp;</p><p>And also it wouldn’t be due to things that were from in utero because some of the theories also suggest that in utero exposures may lead to heart disease and diabetes down the line as well.&nbsp;And they didn’t see that specifically.&nbsp;</p><p>&nbsp;</p><p>12,000 men, they looked at their rates of mortality and what they found was that even after controlling for all these diseases, men who had had lower sperm counts had a 2.3 fold higher risk of death compared to those who had normal semen parameters.&nbsp;&nbsp;</p><p>&nbsp;</p><p>However, this could be a signal that there is something that we need to pay attention to, that perhaps we should look at which things in our environment may be causing sperm counts to go down and try to fix those.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>What can you do to raise your sperm count?</h2><p>&nbsp;</p><p>I’ve written&nbsp;an article&nbsp;on optimizing your sperm health and you can check that out as the&nbsp;article.&nbsp;It’s actually very informative and very good, but I’ll cover a few things right here.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Number one is environmental factors.&nbsp;</p><p>&nbsp;</p><p>If you’re getting exposed to certain chemicals in the workplace like pesticides or other toxins that can obviously affect sperm production.&nbsp;</p><p>&nbsp;</p><p>Sperm is produced in the testicles, which hang outside the body for a reason.&nbsp;&nbsp;</p><p>&nbsp;</p><p>They need a very specific environment to thrive in, which means they are very sensitive to any sort of what we call oxidative stress. And that can be from anything in our environment. That includes things like chemicals, pesticides and including things that are called endocrine disrupting chemicals.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Most often, you’ll see them described as BPA or phthalates in plastics and things like that. So avoiding those sorts of things in your environment can be very helpful.&nbsp;</p><p>&nbsp;</p><p>I often tell my patients, try not to eat out of plastic.&nbsp;If you get something in a plastic container, transfer it to a glass. If you have a bottle, make sure it’s in a glass bottle or a metal bottle instead of using a plastic water bottle.&nbsp;</p><p>&nbsp;</p><p><strong>Another thing is, what are you putting in your body?</strong>&nbsp;&nbsp;</p><p>&nbsp;</p><p>Smoking obviously, we’ve discussed this a very strong predictor of having poor sperm production because it’s a toxin. Similarly, excess alcohol can cause the same problem. It can cause reduced sperm production.&nbsp;</p><p>&nbsp;</p><p>And food,&nbsp;so there’s not a lot of data on specific diets. But the most studied diet is the Mediterranean diet, which is rich in healthy oils like avocado and olive oil and nuts and seeds and unprocessed grains, unprocessed foods and things like fish.&nbsp;&nbsp;</p><p>&nbsp;</p><p>I think the key is to have a plant forward diet. Eat lots of vegetables, lots of fruits, and things that are unprocessed.&nbsp;</p><p>&nbsp;</p><p>Stress is another big factor. Obviously, our lives are getting more and more stressful as time goes on, with electronic devices demanding our attention all the time.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Being accessible to people all the time can add to a lot of stress in our day, so finding ways to reduce stress on a daily basis is really, really valuable.&nbsp;</p><p>&nbsp;</p><p>And lastly, try to avoid hot tubs or saunas, particularly if you’re trying to conceive.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Exposing your testicles to hot temperatures for long periods of time will reduce sperm production. So trying to stay away from those for long periods of time can be helpful, especially if you’re trying to have a baby.&nbsp;&nbsp;</p><p>&nbsp;</p><p>As always, we’re going to take care of yourself.&nbsp;</p><p>&nbsp;</p><p>Thank you.&nbsp;&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}