{"pageProps":{"categories":[{"id":1,"attributes":{"title":"Finance","slug":"finance","createdAt":"2023-01-10T18:35:47.867Z","updatedAt":"2023-01-31T18:54:38.912Z","publishedAt":"2023-01-14T18:13:46.838Z","img":"https://images.freeimages.com/images/large-previews/1e4/business-finance-money-1632104.jpg","articles":{"data":[]}}},{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","articles":{"data":[{"id":6,"attributes":{"title":"Myths and benefits of Probiotics.","slug":"myths-and-benefits-of-probiotics","createdAt":"2023-01-31T20:41:31.703Z","updatedAt":"2023-02-04T23:25:08.343Z","publishedAt":"2023-02-02T08:07:35.467Z","img":"https://images.freeimages.com/variants/HrnJrKhbkjAckDLNncuRs4TA/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d","metaDesc":" Our bodies are home to over a hundred trillion good bacteria, well over a thousand thousand species and somewhere between 7000 to 9000 strains of these species. Probiotics are live microorganisms, basically bacteria, and sometimes yeast that give some sort of positive health benefit to the person taking them. Most of the probiotics end up at the end of your intestinal system, also known as the colon.\n\n The gut microbiome is incredibly important to our health, but we don’t totally understand it just yet. We’ve seen relationships between irregularities in the microbiome and diseases like diabetes, obesity, heart disease, mental conditions like depression, anxiety. The bacteria found within your gut can control your emotions, your depressive, anxiety symptoms, your moods, your appetite even.\n\n There’s seven to 90 different strains of good bacteria inside your gut. Experts deem probiotics to be a safe supplement, yet potential risks exist. The average healthy person should not be taking a daily probiotic. We have not proved it to give enough benefit to warrant the risks and especially spending money on a supplement that may not give you any benefit.","tags":["health","lifestyle"],"readTime":6}},{"id":7,"attributes":{"title":"Reduce Anxiety & Stress with the Physiological Sigh ","slug":"reduce-anxiety-and-stress-with-the-physiological-sigh","createdAt":"2023-02-02T13:56:39.070Z","updatedAt":"2023-02-04T23:31:30.111Z","publishedAt":"2023-02-02T13:56:41.866Z","img":"https://images.pexels.com/photos/3094215/pexels-photo-3094215.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Billions of people suffer from stress. And there are tools to combat stress that involve things like meditation, breath work, good nutrition, good social connections, and avoiding all bad things in life. \nAnd while those are powerful, the problem is they require that people step away from the stress inducing activity. My lab and other laboratories have been very interested in developing tools that allow us to push back on stress. \nFeel more calm in real time, meaning without having to disengage from the stress-inducing activity. The best way that I am aware of doing that is called the physiological sigh. A physiological sigh is a pattern of breathing that involves two inhales followed by an extended exhale. \nPhysiological sighs were discovered in the 1930s as a pattern of breathing that people go into spontaneously when they are in claustrophobic environments or in deep sleep. When there's a buildup of a gas called carbon dioxide in the bloodstream, carbon dioxide triggers the impulse to breathe. \nThere are neurons in the brain that know when carbon dioxide levels have gotten too high. And when the levels get too high, they trigger inhale and exhale, or double inhale and exhale. Now, you can do physiological size voluntarily. \nAnytime you're feeling too stressed and you want to feel more calm, you do it like this. So it's a double inhale. And typically the first inhale is longer than the second, but the second one is still important to do, and then a very long extended exhale. \nTypically, both inhales are through the nose and the exhale is through the mouth. That's the most effective way to do the physiological side. However, if you can't breathe through your nose or your mouth, for whatever reason, do it throughout your mouth or throughout your nose. \nThe second inhale is really important because your lungs are not just two big bags of air. They're two big bags of air with lots of little sacks, millions of sacks. And if you were to lay out those sacks, their volume is as big as a tennis court. \nAnd that allows both the intake of more oxygen, but also the offload of carbon dioxide. So when you do the double inhale, it re-inflates any of these little sacks that have collapsed, and in doing so, it allows you to offload more carbon dioxide. \nSo if you're feeling stressed in any circumstance, inhale twice through the nose and then exhale long through the mouth. You can repeat it a second or even a third time. But typically, just one or two, maybe three physiological sighs are sufficient to bring your level of stress and alertness down very fast and allow you to feel more calm. ","tags":["health","lifestyle"],"readTime":3}},{"id":8,"attributes":{"title":"How to Control Stress in Real-Time","slug":"how-to-control-stress-in-real-time","createdAt":"2023-02-02T14:08:24.693Z","updatedAt":"2023-02-04T22:20:59.991Z","publishedAt":"2023-02-02T16:13:02.774Z","img":"https://images.pexels.com/photos/321576/pexels-photo-321576.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"An ability to control your levels of stress in real time is extremely powerful. It turns out you can do this using physiology and neuroscience. Your breathing can directly impact your heart rate and your level of stress, or calm. \n\nHere’s how it’s works. When you inhale, your diaphragm moves down. This creates more space in your thoracic cavity, and your heart actually gets a little bigger. As a result, the rate of blood flow through that larger heart volume slows down. \n\nA signal is sent from a group of neurons on your heart called the sinoatrial node. That signal goes up to the brain, and your brain sends a signal to speed the heart up. In other words, inhaling speeds your heart rate up. \n\nThe opposite is true as well. When you exhale, your diaphragm moves up, your heart gets a little bit smaller because there’s a little bit less space in your thoracic cavity. As a result, blood flows more quickly through that smaller volume. \n\nThe sinoatrial node registers that and signals your brain, and the brain signals to slow the heart down. So, in other words, inhaling speeds your heart rate up. Exhaling slows your heart rate down. \n\nSo if you want to speed up your heart rate and be more alert, inhale more or make those inhales more vigorous, more intense, if you want to calm down, you can do that quickly by making your exhales slightly longer than your inhales or making them more vigorous. \n\nThis doesn’t require any breath work. This is something that you can do in real time, and that’s what’s called respiratory sinus arrhythmia. That’s the technical phrase. It’s also the basis of what’s called heart rate variability, or HRV. \n\nBut all you need to remember is inhaling deeper and longer will speed your heart rate up. Exhaling. Longer and more intensely will slow your heart rate down and will allow you to calm down in real time. ","tags":["health","lifestyle"],"readTime":2}},{"id":9,"attributes":{"title":"7 Health Benefits of Green Tea & How to Drink it ","slug":"7-health-benefits-of-green-tea-and-how-to-drink-it","createdAt":"2023-02-03T00:43:29.954Z","updatedAt":"2023-02-04T23:25:41.432Z","publishedAt":"2023-02-03T00:43:32.258Z","img":"https://images.pexels.com/photos/1417945/pexels-photo-1417945.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"This article is going to be all about the health benefits of green tea. I’ve seen some overblown claims, so we’re going to parse through and figure out what’s what. Also, read till the end of the article to get tips on how to make the healthiest cup of tea possible. \n\nTea is one of those rare beverages that’s pretty much universally accepted by science as a healthy one. But just remember. As with everything in. Life, you can have too much of a good thing. So don’t overdo it with the green tea. \n\nThe number one thing that makes green tea so good for you is that it’s loaded with healthy nutrients. All of these bioactive polyphenols are awesome for your health. You may have heard of some of them known as flavonoids or catechins. \n\nAnd what those are just antioxidants. What antioxidants do is prevent free radical damage to your body, and free radical damage to your body over time causes cancer. But let me break that down a bit. \n\nI know all of you have faucets at home, whether it’s in your bathroom or in your kitchen. Some of those faucets have rust on them. The rust is a direct result of that free radical damage we always talk about. \n\nNow, antioxidants prevent that rust from forming. So think of antioxidants as the rust prevention within our own bodies. Within media, it’s been mentioned before that those who drink green tea have lower rates of cancer, and it’s been theorized that it has something to do with the huge amount of antioxidants found within green tea. \n\nWe have to not get too excited by this fact, because this is only a correlation and not a causation. Yes, it’s good to drink green tea, but no, it’s not going to cure and prevent all types of cancer. \n\nSecond significant point about green tea, if you got stinky breath, maybe you should try some green tea. The nutrients within green tea that we just mentioned on this last point, known as catechins, do a great job of inhibiting and killing certain types of bacteria. \n\nIn fact, studies were done and proved that bacteria known to cause bad breath within your mouth was killed by drinking green tea. Also, when you have less of that specific bacteria, you have less plaque. So green tea also decreases the risk of developing a cavity.\n\n Point three about green tea. It does a great job of giving you stable energy without all the jitters. It has about 30 to 50 milligrams of caffeine, which is roughly half a cup of coffee. \n\nYou’re still focused, you’re still stimulated, but you don’t have that jittery feeling that you get yet with a big cup of coffee. Another nutrient within green tea that works together with caffeine to boost your brain function is called Althea. \n\nIts benefit is that it gives your brain relaxation without the added sedation or drowsiness that comes along with other relaxing agents. While we’ve seen in animal and lab models, it increases your good cholesterol and lowers your bad cholesterol, what we found in animal lab and human trials is that green tea lowers your blood pressure. \n\n Point number five: green tea can help you burn fat. Well, this is more of an individual case-by-case basis thing, because not all studies agree on this. \n\nBut there is a promise of increased metabolism and fat oxidation, essentially fat burning. Some of the lab models have shown a decrease in new blood vessel formation within your fat stores, meaning that it literally takes away the vital nutrition for your fat and makes it die. \n\nPoint number six: Animal and lab models both show that catechins the nutrient we keep mentioning repeatedly decrease the risk of you developing Alzheimer’s and Parkinson’s disease. Science isn’t clear on why this occurs, but it’s theorized that it has something to do with the decrease in the development of plaque within the brain. If that doesn’t encourage you to take a sip, I don’t know what will.\n\nPoint 7: Now, this is the game changer. This is the one that everyone gets excited about. Green tea may increase your lifespan. There’s been a ton of research done on this. \n\nSome studies even have 40,000 participants that show those who drink three to five cups of tea a day have an increased lifespan, have a decreased all, cause mortality. That means dying from anything, has decreases in heart disease, decreases in strokes. \n\nBut before we get too excited, we need to remember correlation versus causation. Just because those who drink green tea live longer, it doesn’t mean green tea is the sole thing that’s responsible for that effect. \n\nSo, yes, enjoy your green tea, but don’t think you’re going to live forever. Here’s how you create the healthiest cup of tea possible. Don’t add green tea directly to boiling water as it destroys those healthy categories we’ve been talking about. \n\nDon’t go decaf because the decaffeination process hurts more of the nutrients found in green tea. Add lemon into your tea as it aid in the absorption of some of these nutrients.  ","tags":["health","lifestyle"],"readTime":5}},{"id":10,"attributes":{"title":"Intermittent Fasting: Pros and cons","slug":"intermittent-fasting-pros-and-cons","createdAt":"2023-02-03T01:44:22.565Z","updatedAt":"2023-02-04T23:30:43.135Z","publishedAt":"2023-02-03T01:52:01.953Z","img":"https://images.pexels.com/photos/70497/pexels-photo-70497.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Our bodies enter a fasting state every time we’re asleep. Some people do intermittent fasting and do not even know it. I mean, there’s plenty of times where I had a stressful rotation in medical school or a difficult job in the hospital where I didn’t have time to eat breakfast. \n\nThat’s a form of intermittent fasting. And our bodies are totally capable of handling this. I know what you’re thinking. I don’t want to starve myself for health benefits. Intermittent fasting is not starving. \n\nWhen you’re fasting, your body is using stored nutrients and stored energy forms in order to make your body continue to function. When you’re starving, you run out of those energy sources and are breaking down vital tissues like organs to get that same energy. \n\nThere are many different ways to go about going on one of these diets. And that not only makes it confusing for you, but that also makes it very difficult to do research on it to find out how effective it truly is. \n\nBecause if there are multiple ways to do it, we have to be able to test each one of those ways. The 16/8 diet which is not eating during 16 hours of the day. Alternate day fasting, where you eat one day fast, the other day five and two were two days of the week that you’re fasting. \n\nThere’s no hard and fast rule saying that this is the correct way of doing it. You may be wondering how is IF beneficial to me? There’s been a lot of proposed health benefits. Many of them have been proven within animal studies or lab models, which is not the same thing as being proven in a human model, but they are very promising. \n\nNow, those benefits include increased mental sharpness, a favorable hormonal profile, weight loss. Decreases of inflammation within the body, decreases of certain diseases within the body. How can IF help you lose weight? \n\nYou have an increase in growth hormone, a decrease in insulin, and that alone will help you lose weight. Next, because you’re skipping meals or even going days without eating meals, it’s very likely that when you look throughout the week, you’ll be eating fewer calories. \n\nOur thinking is that during 8 hours you’ll eat less than you would if you were eating during 16 hours. Let’s talk about these other health benefits. We know that chronic stress is not good for the body. \n\nThe body is just not meant to be chronically stressed out. It’s not meant to have a high heart rate, high blood pressure. Intermittent fasting is really a form of acute short term mild stress. This type of acute short term stress is really good for the body. \n\nWhat can we use as a metaphor here? Let’s take exercise. Exercise is a form of acute mild stress. What happens after exercise? We have benefits for the brain. We have benefits for weight loss. We have benefits for disease prevention. \n\nNow, similarly, when you stress your body through intermittent fasting, there are some benefits. More autophagy, which is the removal of cellular waste, more production of neurotrophic factors, which protect your brain, and a favorable hormonal profile with increases in human growth hormone and norepinephrine. \n\nLet’s talk about some of the shortcomings of IF. Primarily, there’s not enough guidance on what you should eat. We don’t know how many calories. We don’t know what foods to eat on the days or times that you actually are eating. \n\nSecond, we don’t know which form of IF is best. Third, there are some side effects when you are fasting that people do experience heading aches, mental fog, heartburn. These things do exist. It’s not totally benign. \n\nFour. We don’t know the consequences of following an intermittent fasting diet long term. Most, if not all, of these studies are done on the short term. If you are eating a very unhealthy diet and then make a change, you’re definitely going to see a benefit. ","tags":["health","lifestyle"],"readTime":4}},{"id":11,"attributes":{"title":"I went VEGAN For 30 Days | Here's How My Body Reacted...","slug":"i-went-vegan-for-30-days-here-s-how-my-body-reacted","createdAt":"2023-02-03T04:11:22.897Z","updatedAt":"2023-02-04T23:30:13.831Z","publishedAt":"2023-02-03T04:11:25.351Z","img":"https://images.pexels.com/photos/1351238/pexels-photo-1351238.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself.  \nFive things I Learned to be vegan for 30 days ...\nIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. One, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan. \nTwo, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that. \n\nThree, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet. \nFour, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual. \nFive, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible. \n\nIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\n\nMy advice to you .....\nIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you. In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process. \nAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy. ","tags":["health","lifestyle"],"readTime":10}},{"id":12,"attributes":{"title":"Real Cause of Chronic Kidney Disease and Polycystic Kidney Disease","slug":"real-cause-of-chronic-kidney-disease-and-polycystic-kidney-disease","createdAt":"2023-02-04T13:26:37.597Z","updatedAt":"2023-02-05T11:12:01.049Z","publishedAt":"2023-02-04T13:27:07.778Z","img":"https://advancedurology.com/wp-content/uploads/2022/01/Kidney-Stone-Signs-scaled.jpg","metaDesc":"Chronic kidney disease is mainly made up of several types of problems with the kidney. One would be just chronic kidney disease, which is usually or mostly caused by diabetes. Another type of kidney disease called polycystic kidney disease. And then you have another problem with kidney stones, which relates to kidney stones. So if you have any of these problems, this article is for you, and you definitely want to read it.\n\n Time restricted eating, which is basically intermittent fasting, also slowed down the progression of the cysts developing in the kidney and the associated fibrosis, or the scar tissue that then comes after. It was also found that the ketogenic diet reduces the risk of kidney stones as long as the person’s on a low oxalate diet. Oxalates are things that contribute to kidney stones, and they’re in spinach, the almonds, the chocolate, kiwi.\nMetformin has to do with regulating blood sugar by improving insulin resistance, another interesting association. Fastening strongly inhibits the fibrosis or scar tissue associated with these cysts, as well as inhibiting something called mTOR. mTOR is something in the body that can trigger the growth of cancer tumors and even cysts. Chronic kidney disease is caused by the same thing, glucose, because the root cause of this is definitely diabetes.","tags":["kidney"],"readTime":7}},{"id":13,"attributes":{"title":"Can Ketogenic Diet (Keto) Reverse Kidney Disease?","slug":"can-ketogenic-diet-keto-reverse-kidney-disease","createdAt":"2023-02-05T10:51:44.170Z","updatedAt":"2023-02-05T11:05:35.469Z","publishedAt":"2023-02-05T10:52:31.735Z","img":"https://advancedurology.com/wp-content/uploads/2022/01/Kidney-Stone-Signs-scaled.jpg","metaDesc":"High levels of glucose and insulin create oxidative damage to four tissues: the brain and nerve tissue. The kidney is very susceptible to oxidative damage from high blood sugar and high insulin. Using the ketogenic diet, beta hydroxybutyrate, which is a ketone, can provide an alternative fuel, but it has some real interesting benefits to the kidney.\nThere's different stages of damage to the kidney, Stage 1 to 5, Stage 5, which is end stage renal failure. In this stage, the kidney can no longer filter anymore, can't filter the blood. Potassium can actually protect the kidney against damage, and we need 4700 milligrams every day.\n You're getting edema, and taking certain oral amino acids can slow down the progression of kidney damage. There are certain types of foods that you're going to have to avoid. If you're already at stage five, try to follow a healthy keto plan and intermittent fasting.","tags":["keto","kidney"],"readTime":3}},{"id":14,"attributes":{"title":"Epstein-Barr Virus (EBV):5 Things You MUST Know about.","slug":"epstein-barr-virus-ebv-5-things-you-must-know-about","createdAt":"2023-02-05T14:23:57.806Z","updatedAt":"2023-02-05T14:24:03.019Z","publishedAt":"2023-02-05T14:24:03.016Z","img":"https://images.pexels.com/photos/4226221/pexels-photo-4226221.jpeg","metaDesc":"Epstein-Barr virus is linked to autoimmune diseases, rheumatoid arthritis, chronic fatigue syndrome and fibromyalgia. Epstein Bar virus is associated with increased risk of certain cancers, autoimmune diseases. When the virus gets reactivated, it doesn't necessarily exhibit all the full-blown symptoms that maybe you had when you first got it. It may manifest in fatigue, soreness, lethargy, brain fog, achy joints and achy muscles.\n\n Epstein-Barr virus knows that vitamin D keeps your immune system strong. So if it can block that, it has an advantage,so it downgrades the receptor vitamin D. It also interferes with the metabolism of vitamin D in your gut. The second nutrient is zinc, not allowing zinc to be be transported to the different parts of the immune system.","tags":["stress","Epstein-Barr virus"],"readTime":9}}]}}},{"id":3,"attributes":{"title":"Technology","slug":"technology","createdAt":"2023-01-14T18:15:04.177Z","updatedAt":"2023-01-31T18:58:23.498Z","publishedAt":"2023-01-14T18:15:07.213Z","img":"https://images.freeimages.com/images/large-previews/f27/satellite-dish-on-a-tree-1633151.jpg","articles":{"data":[]}}},{"id":5,"attributes":{"title":"Carreer","slug":"carreer","createdAt":"2023-01-15T10:59:33.650Z","updatedAt":"2023-01-31T18:53:09.040Z","publishedAt":"2023-01-15T10:59:36.900Z","img":"https://images.freeimages.com/images/large-previews/ac6/eating-my-own-words-1318367.jpg","articles":{"data":[]}}}],"article":[{"id":11,"attributes":{"title":"I went VEGAN For 30 Days | Here's How My Body Reacted...","slug":"i-went-vegan-for-30-days-here-s-how-my-body-reacted","createdAt":"2023-02-03T04:11:22.897Z","updatedAt":"2023-02-04T23:30:13.831Z","publishedAt":"2023-02-03T04:11:25.351Z","img":"https://images.pexels.com/photos/1351238/pexels-photo-1351238.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself.  \nFive things I Learned to be vegan for 30 days ...\nIn fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. One, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan. \nTwo, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that. \n\nThree, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet. \nFour, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual. \nFive, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible. \n\nIf you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.\n\nMy advice to you .....\nIf you’re curious or interested in starting a vegan diet, I don’t want to dissuade you. In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process. \nAnd please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy. ","tags":["health","lifestyle"],"readTime":10,"category":{"data":{"id":2,"attributes":{"title":"Lifestyle","slug":"lifestyle","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-01-31T18:56:54.291Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":11,"content":"<p>Four weeks of going vegan are in the books and I’m so happy I met my goal.&nbsp;</p><p>Just to clarify, there are many reasons people follow a vegan diet, moral, ethical, environmental. But the information I’m going to cover here is only what’s related to nutrition and health.&nbsp;</p><p>&nbsp;</p><h2>Is&nbsp;vegan&nbsp;Diet&nbsp;healty?&nbsp;</h2><p>&nbsp;</p><p>A vegan diet can be a very healthy diet, whether you’re young, old, somewhere in between, pregnant, nonpregnant breastfeeding, not breastfeeding. &nbsp;</p><p>&nbsp;</p><p>Basically, it’s applicable to all life stages. The reason I put that word can in there you can follow a vegan diet, eat vegan burgers with sugary sodas, with gummy&nbsp;candies, still be vegan. And that’s not really healthy, right? &nbsp;</p><p>&nbsp;</p><p>And I have to say it’s not the only healthy diet out there. Some of the loudest voices in the vegan community are quick to say that veganism is the only healthy option. That’s not the case. There are several other healthy diets out there.&nbsp;</p><p>&nbsp;</p><p>For example, the Mediterranean diet that I’m personally a fan of that are just as healthy, if not healthier than the vegan diet. &nbsp;</p><p>&nbsp;</p><h3>What I tell my patients?</h3><p>I have to be honest and admit that I rarely recommend veganism as my 1st option. I know that it’s a restrictive diet, and we know restrictive diets have high failure rates. Plus, the benefits of a vegan diet aren’t that much better than some of the other alternatives that are simpler to follow.&nbsp;</p><p>&nbsp;</p><p>When I recommend a diet, I’m trying to create&nbsp;the healthiest diet, but also one that’s feasible for my patients to face without disrupting their lives. On the other hand, if one of my patients comes in and wants to follow a vegan diet, I’m totally in support of that.&nbsp;</p><p>&nbsp;</p><p>I just have to make sure that they’re adequately planning their meals, they’re supplementing when need be, checking their blood tests, and ideally, having some guidance either for myself or a nutritionist.&nbsp;</p><p>&nbsp;</p><h3>What the research says?</h3><p>The research behind health benefits of following a vegan diet is substantial and high quality. If you’re following the standard American diet and then switch over to a vegan diet, you’re going to see an improvement in chronic diseases like diabetes, heart disease, strokes, even an extension of life in some cases.&nbsp;</p><p>&nbsp;</p><p>And what’s most interesting is when we add some animal products into the mix, those outcomes still hold true. That’s why what I recommend to my patients is a plant focused diet, meaning that they should get the majority of their calories from plants, fruits, vegetables, legumes, nuts, seeds, healthy fats, and a moderate amount of poultry and fish with a minimal amount of red meat.&nbsp;</p><p>&nbsp;</p><p>In fact, that’s the diet I follow and recommend to my family. The field of nutrition research is ever changing. And as we get more information, more quality studies, we doctors and nutritionists alike, are going to give better recommendations when it comes to a vegan diet, a plant focused diet, all of this is susceptible to change.&nbsp;</p><p>&nbsp;</p><p>But it’s important that we make the best decisions with the knowledge that we have on hand. The one thing that I can say with 100% certainty is there’s no such thing as a miracle diet for everybody. &nbsp;</p><p>&nbsp;</p><h3>Challenge begins ...</h3><p>&nbsp;</p><p>On day one, I was excited.I was like, if I could tackle keto, I can definitely do vegan. First point at which I had a little bit of hesitation was when I ordered my first at home delivery. Buffalo cauliflower bites with some kind of not real mayo.&nbsp;</p><p>&nbsp;</p><p>And this is. A wrap with vegan cheese and unchicken. I was having second thoughts, and that’s not like me. If I set a goal for myself, I’m going to do everything in my power to meet that goal. But for some reason, when sticking to this vegan diet, I was concerned about so many things.&nbsp;</p><p>&nbsp;</p><p>The following week, I was leaving for MIT for the leadership conference. I was worried if they’re going to have vegan options available for me. I was then traveling to Miami for a few days. All these worries started bubbling in my head and I was really wondering, can I stick to vegan this entire month?&nbsp;</p><p>&nbsp;</p><h3>My obstacles</h3><p>One of the first obstacles I ran into on the vegan diet was. Under eating calories. Now, I’m partially to blame here because I didn’t prep well.&nbsp;</p><p>&nbsp;</p><p>And even at the writing&nbsp;of this article, I said the healthy way to follow a vegan diet is to adequately plan your meals. For the first two weeks, I have to be honest; I didn’t have much of an appetite.&nbsp;</p><p>&nbsp;</p><p>I’m not a huge fan of just eating vegetables and rice and beans, so I didn’t have tremendous portions. And because of that, I was calorie deficient. I actually noticed some weight loss helped me tremendously to make up this calorie deficit is eating some of these snacks that Thrive sent over.&nbsp;If I didn’t have these snacks, I’d be under eating calories the majority of the time.</p><p>&nbsp;</p><h3>This Can’t be good...</h3><p>One of the biggest problems I ran into this is really embarrassing to say in the article. From day one until the last day of the diet, I was having tremendous gas and bloating.&nbsp;</p><p>&nbsp;</p><p>It’s so embarrassing to say. I mean, think about this. I fly on planes; I interact with patients for long periods of time. I sit at conferences. I can’t just be sitting there flatulent. I did try to isolate some ingredients to see which ones were causing this gas and bloating combination for me, but I couldn’t find out what it was.&nbsp;</p><p>&nbsp;</p><p>I normally eat brown rice. I normally eat vegetables and fruits and beans. I expect them to go away after four weeks, but no, they stuck around. I would have to say that the vegan diet probably won’t work for me long term.&nbsp;I just can’t sit there with my stomach going and me wanting to pass gas the entire time. God, that’s embarrassing.</p><p>&nbsp;</p><h3>&nbsp;A&nbsp;pleasant&nbsp;surprise</h3><p>What I didn’t know about veganism is that there are a ton of up-and-coming options for those who aren’t used to eating vegan.&nbsp;There are specialty restaurants that just offer vegan foods with no animal products that remind you of foods that you may have eaten when you ate animal products. And I thought that was really cool. On top of that, a lot of these restaurants and even some of the products I got from Thrive tasted delicious because of the sauces.&nbsp;Vegan sauces are on point.</p><p>&nbsp;</p><h3>I can’t even ...</h3><p>I’ve talked about on this channel of decision fatigue because you’re constantly making decisions and you’re using your willpower.&nbsp;It’s actually a finite resource. What I noticed while I was following the vegan diet was that I lost the drive to go to the gym. My work ethic actually suffered because I was putting such a strong emphasis on sticking to vegan when there were so many temptations and there were things I wanted to eat.&nbsp;</p><p>&nbsp;</p><p>I didn’t want to hop on my spin bike in my bedroom. I didn’t want to go to the gym with my friends. This is really unlike me, and it’s an obstacle I didn’t actually expect to face when I went to the gym.&nbsp;I lifted fine. Getting to the gym was the actual struggle.</p><p>&nbsp;</p><h3>I fail [Or Not]....</h3><p>At the time, I least expected it. Disaster struck. I got sick. I started coughing. I got a sore throat. I got a low grade fever. I went to see the doctor.&nbsp;</p><p>&nbsp;</p><p>I weighed the pros and cons of starting antibiotics, of stopping the vegan diet. I decided to stick with conservative treatment and treat it like a viral illness. One of my favorite hacks to treat viral illnesses.&nbsp;</p><p>&nbsp;</p><p>Actually, the symptoms of the viral illnesses are green tea with manuka honey. Patrol members, be advised. Apparently, honey is not vegan. What? I guess honey is an animal product, but, man; I didn’t force the bees to make the honey.&nbsp;</p><p>&nbsp;</p><p>They make it on their own. We didn’t have to milk them for it. Wait. If you want to disqualify my four-week vegan challenge because I ate honey, so be it.</p><p>&nbsp;</p><h3>Please don’t hate me …</h3><p>I got to say, at this point, I was rolling.&nbsp;I was starting getting into the vegan vibe. I was trying out new restaurants. I was sampling all the delicious foods that I got from Thrive, and I was excited. I was getting close to the finish line.&nbsp;</p><p>&nbsp;</p><p>But I will say, one of the hardest things with the vegan diet is peer pressure. I mean, when I went out to eat with my friends, they were annoyed, to say the least, that we had to choose the restaurant.&nbsp;Based on my eating preferences, I did a decent job at trying to pick out vegan options in not so vegan places.</p><p>&nbsp;</p><h3>In retrospect …</h3><p>Honestly, I was really proud of myself, and it’s nice every now and then to take a challenge like this and learn something new about yourself. &nbsp;</p><p>&nbsp;</p><h3>Five things I Learned to be vegan for 30 days ...</h3><p>In fact, I want to tell you five things that I learned not only about the vegan diet but also about myself during this process. <strong>One</strong>, when I didn’t plan well; I ate very unhealthy when I was at MIT for breakfast. I ate cinnamon toast Crunch with almond milk and a banana every morning. That’s not healthy, even though it’s vegan.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>Two</strong>, I didn’t notice a major change in my energy level like I thought I would. I mean, maybe I had a slightly decreased energy level, but we remember I was sick in the beginning. I was under eating calories, so I don’t feel it’s fair to blame vegan for that.&nbsp;</p><p>&nbsp;</p><p><strong>Three</strong>, surprisingly, I didn’t get weaker on vegan. I was lifting strong, and I felt good. But what suffered was getting to the gym. I really noticed the lack of willpower when I was following the restrictive diet.&nbsp;</p><p>&nbsp;</p><p><strong>Four</strong>, when it comes to my body, I lost 3 pound. I dropped from 203 to 200 pounds. So there was some weight loss, probably from under-eating calories, but despite losing weight, I didn’t feel as lean. I mean, all those sauces, all the rice that I ate, pasta that contributed to the car bloat and probably made me feel a little bit pudgier than usual.&nbsp;</p><p>&nbsp;</p><p><strong>Five</strong>, this is the big one. The real difficulty was my GI system. I mean, it was a mess. The amount of gas and flatulence and bloating. God, I can’t. It’s, like, gross even talking about, but it was terrible.&nbsp;</p><p>&nbsp;</p><p>If you have that with any diet, there’s no way you’re sticking with it. And I tried taking some over-the-counter supplements for this. It did absolutely nothing.</p><p>&nbsp;</p><h3>My advice to you .....</h3><p>If you’re curious or interested in starting a vegan diet, I don’t want to dissuade you.&nbsp;In fact, I want to encourage you. Go talk to a dietitian nutritionist physician, someone who’s well versed in vegan diets. That way you could do it the healthy, happy, safe way without hurting yourself in the process.&nbsp;</p><p>&nbsp;</p><p>And please reduce the amount of refined carbs and processed foods that you’re eating, because as more research comes out, that’s the stuff that causes diseases and shortens your lifespan. And as always, stay happy and healthy.&nbsp;</p>","sample":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}}}]},"__N_SSG":true}