{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h2: \"h2\",\n    h3: \"h3\",\n    strong: \"strong\",\n    br: \"br\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Magnesium is a fascinating mineral. It’s involved in over 350 different enzymes in the body, and we may find that it’s involved in a lot more. But what’s interesting about enzymes is that they speed up the chemical reactions in the body of a factor of like 100 million times faster than if you didn’t have that enzyme.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so they’re catalysts or things that help the chemical reaction to occur a lot faster. And what’s also mind blowing about enzymes is that they don’t use up their energy. So they’re a bit magical because they seem to have their own energy that doesn’t necessarily get depleted.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So in this article, I’m going to share some things that you probably have never heard about magnesium. There’s definitely things that, you know, it helps with heart disease. It helps with cramping at night. If you have those cramps in your calves.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It helps you sleep.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s involved in helping you reduce anxiety. It makes you more relaxed.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It actually makes your arteries less stiff. And that’s going to help you lower blood pressure.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You probably also know that magnesium works with calcium. It’s kind of like a teeter totter effect. The more calcium you have, the less magnesium you’re going to have and vice versa. So you need calcium and magnesium in the right ratios, especially involved in the muscle contraction and relaxation.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So where calcium tends to be involved in contraction, magnesium is all about relaxation. And This is why you have all sorts of muscle problems. If you have a deficiency in magnesium, like a cramp, like twitching, like tetany, a lot of times people take magnesium because they have headaches.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So magnesium is good for headaches.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so if there’s any problem involving with the nerve and muscle irritation or even arrhythmias in the heart, think magnesium.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But let’s talk about the things that you probably have never heard about that are quite interesting.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There’s an enzyme that helps you regulate cholesterol. It’s called H-⁠M-⁠G CoA Reductase. This is the enzyme that statins work on. And it just so happens that magnesium parallels the effects of statin.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So it can help you regulate LDL or an increase HDL, and help you regulate your triglycerides as well.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Magnesium is also involved in enzymes related to lecithin, which is like the antidote to cholesterol.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so without magnesium, you’re going to have a lot of issues with cholesterol, as well as having lecithin work.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, the other big thing that magnesium is involved with is making ATP, that is the energy currency of the body.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And without that, you just can’t make energy. So this is why magnesium is the second most needed mineral in the body, just behind potassium. So without magnesium, you could be tired all the time.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, the other thing about magnesium is that it can help you lower adrenaline cortisol and something called ACTH.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"ACTH is the hormone that is released from the pituitary that tells the adrenals to release cortisol. And so if you have less regulation on that hormone, you’re going to have higher levels of stress. And this is why magnesium is really good for stress and anxiety, because it helps to normalize this ACTH, cortisol and adrenaline, as well as help to counter all the oxidative stress that comes with these stress hormones.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So magnesium is very protective of this cellular level.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Magnesium is a natural calcium channel blocker because it opposes calcium, which means it’s really good for blood pressure, but typically, they don’t know why.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, the reason is this: it can act like a natural calcium channel blocker. Calcium channel blockers are a common medication for hypertension. Well, magnesium is a natural version of that with virtually no side effects, but it also can act at the same time as a beta-blocker.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So with one angle, it helps balance calcium, and from another angle, the beta blocker. That has to do with reducing stress in the arteries and that whole system.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, a couple other really cool things that magnesium is involved with is - it’s a natural antithrombotic. Basically, it’s a natural blood thinner.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Another thing you may not know about magnesium is that it can help you lower your blood sugars. It is really important in kind of undoing insulin resistance.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And the last thing, which is actually probably the most important function of magnesium, magnesium is involved in making DNA without having the perfect blueprints that can create a huge chain reaction.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And we typically need about 310 to about 420 milligrams of magnesium every day. And not a lot of people get that. And so they’re going to be deficient, and they’re going to have these problems. Magnesium is at the heart of chlorophyll, so anything green, like dark, leafy green vegetables. And this is something that a lot of people don’t consume.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But then you also have nuts and pumpkin seeds, dark chocolate, of course, without the sugar, sea kelp, and even certain types of sea salt that are low sodium type sea salt.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But we also have to look at those things that are depleting our magnesium. Refined sugars, refined carbohydrates, alcohol, diuretic, diarrhea, having a low stomach acid, and even having certain type of gene variations that can also be a problem.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s actually quite common where people just don’t seem to absorb magnesium like they should. And for those people, it’s even more important to stay away from alcohol and things that deplete your magnesium and and even probably supplement with a good form of magnesium.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And the type of magnesium I would recommend is magnesium glycinate, which is very bioavailable. Now, since we’re on this interesting topic of magnesium, if you haven’t seen my other article on magnesium, I put it up right here.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Check it out.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"SUMMERY:\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: _jsx(_components.strong, {\n        children: \"Well-known benefits of magnesium:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• It supports the heart\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• It may help with muscle cramping\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• It supports sleep\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• It may help reduce anxiety\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• It may help promote relaxation\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• It supports the flexibility of the arteries\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• It may help with headaches\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"• It may help with problems related to the nerves and muscles\", _jsx(_components.br, {}), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Surprising benefits of magnesium:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"1. It may help regulate LDL cholesterol and triglycerides and increase HDL\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"2. It helps make ATP (energy in the body)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"3. It helps regulate adrenaline, cortisol, and ACTH—and counters oxidative stress from these hormones\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"4. It's involved in enzymes related to lecithin (the antidote to cholesterol)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"5. It's a natural calcium channel blocker, beta blocker, and antithrombotic\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"6. It helps regulate blood sugar levels\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"7. It's involved in making DNA\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: _jsx(_components.strong, {\n        children: \"Magnesium-rich foods:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Foods high in chlorophyll (dark leafy green vegetables)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Nuts and pumpkin seeds\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Dark chocolate (sugar-free)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Sea kelp • Avocado\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"• Low-sodium sea salt\", _jsx(_components.br, {}), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Here are the top things that can cause you to become magnesium deficient:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Refined sugar and refined carbs\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Alcohol\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Diuretics\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Diarrhea\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Low stomach acid\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"• Certain gene variations\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"7 Benefit of Magnesium for Human Body : Surprising fact of Magnesium","metaDesc":"Magnesium is an enthralling mineral. It participates in over 350 different enzymes in the body, and we may discover that it participates in many more. What's fascinating about enzymes is that they accelerate chemical reactions in the body by a factor of 100 million times faster than if you didn't have that enzyme.\n\nSo they're catalysts, or things that help the chemical reaction happen much faster. What's even more amazing about enzymes is that they don't run out of energy. So they're a little magical in that they appear to have their own energy that doesn't seem to run out.","tags":["Magnesium"],"slug":"7-benefit-of-magnesium-for-human-body-surprising-fact-of-magnesium","readTime":7,"img":"https://images.pexels.com/photos/4087621/pexels-photo-4087621.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":["https://www.ncbi.nlm.nih.gov/books/NBK507250/","https://pubmed.ncbi.nlm.nih.gov/15466951/"],"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}