{"pageProps":{"article":[{"id":19,"attributes":{"title":"#1 Food with the Most Vitamin K2","slug":"1-food-with-the-most-vitamin-k2","createdAt":"2023-02-12T00:42:14.076Z","updatedAt":"2023-02-12T01:16:23.332Z","publishedAt":"2023-02-12T01:01:55.918Z","img":"https://healthjade.net/wp-content/uploads/2022/03/vitamin-K2.jpg","metaDesc":"Vitamin K2 is the number one food that has the most vitamin K2, and it was discovered by Dr. Weston Price in a book called \"Nutrition and Physical Degeneration\". He was trying to identify what it was about their diet that generated such amazing teeth as compared to nowadays, when everyone needs braces. He found that they ate a lot of grass-fed butter and cheese and natural things, and so he identified their teeth as being just, like, really, really good. Vitamin K2 works with vitamin D to absorb calcium in the intestines by a factor of 20, and it uses a transport system called LDL, the so-called \"bad cholesterol\" that everyone's trying to reduce. Calcium transportation is important for bones, teeth, arteries, cartilage, joints, and the brain.\n\nIt activates a beta cell in the pancreas, making insulin more sensitive, improving insulin resistance, generating more ATP in muscle cells, supporting testosterone, and improving spatial learning and memory. It also inhibits calcium build up in the arteries and joints.","tags":["vitamin K2"],"readTime":10,"dataSources":["https://pubmed.ncbi.nlm.nih.gov/15995297/","https://eje.bioscientifica.com/view/journals/eje/175/6/541.xml","https://www.karger.com/Article/FullText/516611","https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5946231/"],"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":19,"content":"<p data-pm-slice=\"0 0 []\">Let’s talk about the number one food that has the most vitamin K2. But first, a little background on vitamin K2. in a book called “Nutrition and Physical Degeneration” by Dr. Weston Price.</p><p data-pm-slice=\"0 0 []\">&nbsp;</p><p>He was a dentist, but he did a lot of research and visited these remote cultures that ate very healthy foods, and he was trying to identify what it was about their diet that generated such amazing teeth as compared to nowadays, when everyone needs braces.</p><p>&nbsp;</p><p>We have our wisdom teeth extracted because there is insufficient space in our skull. The teeth are overcrowded. I have a lot of overbite and underbite issues, not to mention my teeth. I pretty much had cavities in every single tooth in my skull.</p><p>&nbsp;</p><p>So Western Price looked at the calcium. He looked at the fat-soluble vitamins. Maybe at first he thought it was vitamin D, vitamin A, or vitamin E, but at the time, vitamin K2 wasn’t identified. And so it was really interesting that he had a term for it called “activator X,” kind of like the X factor.</p><p>&nbsp;</p><p>Just something to supplement the regular fat cycle vitamins that are promoting really good teeth, such as really good bones, bone structure, and overall health.He just didn’t know about vitamin K2 because it hadn’t been discovered yet.</p><p>&nbsp;</p><p>And so he looked at cultures in the Swiss Alps, and he found that they ate a lot of grass-fed butter and cheese and really natural things. And so he identified their teeth as being just, like, really, really good.</p><p>&nbsp;</p><p>Fast forward. We know now. It’s Vitamin K2. There’s vitamin K1, which is all about clotting. And then there’s vitamin K2, which is all about calcium transportation. Vitamin K2 works with vitamin D.</p><p>&nbsp;</p><p>Now, vitamin D helps a person absorb calcium in the intestines by a factor of 20. If someone doesn’t have enough vitamin D, calcium really won’t be absorbed in the blood very well. And so vitamin D is all about raising calcium in the blood.</p><p>&nbsp;</p><p>But vitamin K2 takes it to the next level. It takes the calcium from the blood and pushes it into the bone. And so the way it does this is by activating certain proteins. And another thing that’s really interesting about vitamin K2 is that it uses a transport system called LDL, the so-called “bad cholesterol” that everyone’s trying to avoid.</p><p>&nbsp;</p><p>Well, it takes a ride in LDL through the body, and then it ends up in your bones. So it makes your bones really, really solid. It helps certain parts of your teeth become very, very strong. It keeps calcium from building up in the arteries.</p><p>&nbsp;</p><p>It prevents vascular calcification. It also keeps calcium from accumulating in your cartilage or joints, which can lead to arthritis.So it’s all about calcium transportation. It activates a very important cell called a beta cell in your pancreas, which makes insulin more sensitive.</p><p>&nbsp;</p><p>So if a person has insulin resistance, which the majority of the population has, it can really help someone’s blood sugar by improving insulin resistance, because now that insulin is going to make insulin more sensitive, then your body can make less insulin.&nbsp;</p><p>&nbsp;</p><p>It helps generate more ATP or energy in the muscle cell. You’re going to have a lot more energy to do exercise. It also is involved in supporting the cells that make testosterone. It also works on the brain.&nbsp;</p><p>&nbsp;</p><p>It improves spatial learning as well as memory, which is pretty cool. And like I said before, it also inhibits this calcium build up in the arteries and in the joints. So you can see it’s a very, very important vitamin and we need to have it in our diet.&nbsp;</p><p>&nbsp;</p><p>Unfortunately, there’s no requirements or RDAs for K2 yet, even though we need it now. The majority of vitamin K2 comes from bacteria. And so when a cow eats grass that is loaded with vitamin K1, that vitamin K1 changes into vitamin K2 with the help of bacteria, vitamin K1.&nbsp;</p><p>&nbsp;</p><p>And vitamin K2 are fat-soluble vitamins, so it is stored in fat. So if someone goes low fat or they’re on medications that block cholesterol, for example, they may not not get enough vitamin K2.&nbsp;</p><p>&nbsp;</p><p>At least the microbes in your own gut do make some of the vitamin K2 that you have in your body, okay? And that’s made from Vitamin K1. So there’s a little conversion going on in your gut.&nbsp;</p><p>&nbsp;</p><p>And as a side note, E. Coli is one of the bacteria that has this ability to help you make vitamin K2. And I’m not talking about the pathogenic version. I’m talking about the version that is fairly friendly in your body. It actually makes certain B vitamins, and it also makes vitamin K2 from vitamin K1, which is interesting.&nbsp;</p><p>&nbsp;</p><p>The number one food that has the most vitamin K2 is cheese. There is one other food that has more vitamin K2, but most people are not going to consume it. So I didn’t want to even mention that cheese is number two, but I’m just going to put it number one because most people will consume cheese.&nbsp;</p><p>&nbsp;</p><p>The number one product is really NATO, which is a fermented soybean, which, if you ever tasted it, you probably would not like it too much. It’s kind of an acquired taste. It’s kind of like my dad lacking limb burger cheese, right, which basically has a very unique flavor, which we all couldn’t stand growing up.&nbsp;</p><p>&nbsp;</p><p>But recently I tasted some of it and actually actually, now I kind of like it. It does not taste like it smells. But as far as the abundance of vitamin K2, cheese is at the very top of the list. Mainly it’s the hard cheeses, but it’s also in the soft cheeses.&nbsp;</p><p>&nbsp;</p><p>But out of all of the hard cheeses and the soft cheeses, there’s one cheese that it ranks number one, and that is called the munster cheese, which is grown in the mountains of France where they create this cheese with raw milk, not the pasteurized milk, but they use in the US.&nbsp;</p><p>&nbsp;</p><p>Now, it is true that vitamin K2 will survive some of the pasteurization, the heating of the cheese, but it also kills off the microbes, right, that are making the vitamin K2. So you’re always going to find more vitamin K2 in things that are more raw, especially when we’re getting the cheese.</p><p>&nbsp;</p><p>There’s all sorts of versions of vitamin K2. There’s just kind of like these subset versions of vitamin K2. You have like the MK-4, MK-7, etc. But in cheese you have MK-4, MK-5, you have MK-6, MK-7, MK-8, and also MK-9.&nbsp;</p><p>&nbsp;</p><p>So you have a huge variety of different versions of this vitamin K2 as compared to some other foods that may only have one version, like maybe MK-4 or MK-7. But if you can find some raw cheese, that would always be better.&nbsp;</p><p>&nbsp;</p><p>Usually European cheese, high quality, hard cheeses are going to have a little bit more, soft cheeses will have a little bit less, but you’re still going to get a good amount of vitamin K2 in cheese.&nbsp;</p><p>&nbsp;</p><p>Now, some people are going to say, well, wow, I thought this saturated fat, and the cheese was bad, right? It’s going to create heart problems. And now I’m confused because vitamin K2 removes the calcium out of the arteries and that also helps prevent heart disease.&nbsp;</p><p>&nbsp;</p><p>So what’s more important, removing the calcium from the arteries or the cholesterol that’s building up from all the fatty foods? Well, it’s just to clear the confusion, I’m going to put some links down below of some clinical trials and I think you’ll find interesting, completely refuting this data that saturated fat will make you die earlier or increase your risk for heart attacks or other problems.&nbsp;</p><p>&nbsp;</p><p>There’s absolutely no evidence to show that saturated fat is going to worsen your health or cause diabetes. Unfortunately, those recommendations that we should increase our unsaturated fats, the Omega-6 to replace the saturated fats, are bad information.&nbsp;</p><p>&nbsp;</p><p>Now, I just have to say something about those recommendations, the governmental recommendations. First of all, anything related to health that’s recommended by the government might not be true. I mean, if you think about it, who is the government?</p><p>&nbsp;</p><p>Is there one person? Is there a group? Is there a panel? Are these recommendations slightly biassed because they come from various groups that can have influence over these policies? The answer is a big, fat yes. There’s definitely a revolving door between industry and government.</p><p>&nbsp;</p><p>kind of goes back and forth. So take any health-related advice from the government with a grain of salt. So we have cheese, which is a really good source of vitamin K2. We also have grass-fed butter, which is made from cows, but grains have very little vitamin K2.</p><p>&nbsp;</p><p>Why is that? because grains don’t have a lot of vitamin K1. Grass has a lot of vitamin K1. This vitamin K1 is then converted into vitamin K2. So it’s grass-fed and grass-finished.</p><p>&nbsp;</p><p>Or, to put it another way, 100% grass-fed. That’s what you want to consume, as far as butter and other foods are concerned, if you want to get more vitamin K2. The cool thing about butter is that it has great amounts of vitamin A, vitamin E, vitamin D, and vitamin K2.</p><p>&nbsp;</p><p>It’s really good for someone who has osteoporosis, osteopenia, osteomalacia, or even rickets. These are all problems with the bones. And then you have things like goose liver, duck liver, duck fat, and eel.</p><p>&nbsp;</p><p>Yes, eel is loaded with vitamin K2. Beef liver or lamb liver The liver has vitamin K2. Ground beef. grass-fed hot dogs. I’m not talking about the processed hot dogs you might get at a baseball game or something.</p><p>&nbsp;</p><p>I’m referring to high-quality, grass-fed, no-sugar-added, clean hot dogs with vitamin K2.I’m not referring to regular commercial bacon. I’m talking about higher-quality bacon that has vitamin K2.</p><p>&nbsp;</p><p>In fact, out of all the meats, pork contains the most vitamin K2, which is interesting. And then you also have things like sauerkraut. It’s a fermented product that contains vitamin K2 with the help of bacteria.</p><p>&nbsp;</p><p>And also, cod liver oil is another great thing, especially for children growing up. A lactating woman and her growing child should consume high-quality cheese on a regular basis, unless there is an allergy, as well as high-quality butter and collaborative oil.</p><p>&nbsp;</p><p>And not only will that help them avoid getting braces, but it’s going to improve their entire health. And if you’re taking vitamin D, always make sure you take vitamin K2 with it because they work hand in hand.</p><p>&nbsp;</p><p>Sometimes people are concerned with the toxicity of vitamin D, but if you take vitamin K2 and magnesium, you can greatly offset the toxicity that could potentially occur if you’re taking massive amounts for many, many months.</p><p>&nbsp;</p><p>Now, since you’re on the topic of vitamin K2, there’s a lot more to know about it. You should check out this article that I did that has quite a few views. I’ll put it up right here.</p><p>&nbsp;</p><p><strong>Summery:</strong></p><p>&nbsp;</p><p><strong>The health benefits of vitamin K2:</strong></p><p>• It supports healthy bones<br>• It supports strong teeth<br>• It helps prevent calcium from building up in the arteries, cartilage, and joints&nbsp;<br>• It helps support healthy blood sugar levels<br>• It helps generate ATP (energy)<br>• It supports healthy testosterone levels<br>• It supports the brain&nbsp;</p><p>&nbsp;</p><p><strong>Other food sources of vitamin K2 include:</strong></p><p><br>• Grass-fed butter<br>• Goose liver<br>• Duck liver<br>• Duck fat<br>• Eel<br>• Beef liver<br>• Lamb's liver<br>• Ground beef<br>• Grass-fed hot dogs&nbsp;<br>• High-quality bacon&nbsp;<br>• Pork&nbsp;<br>• Sauerkraut&nbsp;<br>• Cod liver oil&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}