{"pageProps":{"article":[{"id":33,"attributes":{"title":"Can't seem to finish?A Urologist explains the causes and treatments of Delayed Ejaculation.","slug":"can-t-seem-to-finish-a-urologist-explains-the-causes-and-treatments-of-delayed-ejaculation","createdAt":"2023-02-22T21:31:32.531Z","updatedAt":"2023-02-22T22:06:23.116Z","publishedAt":"2023-02-22T22:06:23.113Z","img":"https://images.pexels.com/photos/5915744/pexels-photo-5915744.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Feeling frustrated in bed? Does it take you long to ejaculate or you never get there? Read this article until the end and learn what causes delayed ejaculation and what you can do to treat it.\n\nDelayed Ejaculation: What can you do about it?  \n\nAre you having a hard time finishing? Well, today we’re going to talk about delayed ejaculation. \n\nDefinition of Delayed Ejaculation\n\nSo, delayed ejaculation is a condition where it takes a man longer than usual to achieve climax and ejaculate, and usually the number that we see is anywhere between 20 and 30 minutes.  \n\nHowever, the clinical definition is a little bit more stringent, and it is a marked delay or marked  infrequency of ejaculation that has occurred almost 75% to 100% of the time in the last six months, and that causes the individual distress or bother.  \n\nAnd this is pretty uncommon. It occurs in about 1% of men where they have a lifelong delayed ejaculation and 4% of men where they get acquired delayed ejaculation. \n\nIn this article, we’re going to cover the physiology of erection, the causes, the diagnosis, and the treatment options for delayed ejaculation. So make sure to stick around until the end. \n\nDefinition of Ejaculation\n\nSo ejaculation is the process of releasing semen from the body, and it occurs in many steps. The first step is emission, where semen enters the urethra through the ejaculatory duct and the bladder neck closes to make sure that your semen will not go backwards into the bladder.  \n\nAnd the process of expulsion, where the semen is pushed out through the urethra, usually with the support of the pelvic floor muscles and the muscles around the urethra called the bubble cavernosis muscles.  \n\nInterestingly, ejaculation is a reflex. Once you get to the point where your body sends signals to your spinal cord and then to your brain that you need to ejaculate, ejaculation occurs and there’s nothing you can do to stop it.  \n\nAnd typically, orgasm occurs at the same time as ejaculation. But orgasm is a brain triggered event whereas ejaculation is a spinal cord triggered event. And so these can occur her most often together, but not always.  \n\nAnd specifically, some hormones, like dopamine, are increased during orgasm, whereas other hormones, like prolactin, are suppressed. So some of the medical treatments, all of which are off label, kind of try to work with these hormones to help improve the time to ejaculation and orgasm.  \n\nWhat causes delayed ejaculation?\n\n Well, there’s a number of different causes. It can be psychological, meaning that it’s due to something in your brain or something that’s bothering you in your brain or it can be physiological, meaning that’s from your body and sometimes it can be a combination of both.  \n\nPsychological issues\n\nSo psychological issues can be many. It can be due to certain fears you have. It can be due to having strong religious convictions or guilt associated with ejaculation. It can be due to relationship conflicts.  \n\nIt can be due to idiosyncratic masturbation techniques which I’ve talked about before in my article about when the small chances where masturbation can become harmful. It can be due to performance anxiety. Or the lack of stimulation or arousal. So all of these things can contribute to a psychological delayed ejaculation. \n\n Physiological causes, meaning from your body that you cannot control can be due to things like having surgery which affects the nerves that carry those signals to the spinal cord to cause the ejaculatory reflex or having medical conditions like multiple sclerosis or spinal cord injury where we see this quite often.  ","tags":["ejaculation"],"readTime":7,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":33,"content":"<h2 data-pm-slice=\"0 0 []\">Delayed Ejaculation: What can you do about it?</h2><p data-pm-slice=\"0 0 []\">&nbsp;</p><p><strong>Are you having a hard time finishing? Well, today we’re going to talk about delayed ejaculation.</strong>&nbsp;</p><p>&nbsp;</p><p><strong>Definition of Delayed Ejaculation</strong></p><p>&nbsp;</p><p>So, delayed ejaculation is a condition where it takes a man longer than usual to achieve climax and ejaculate, and usually the number that we see is anywhere between 20 and 30 minutes.&nbsp;&nbsp;</p><p>&nbsp;</p><p>However, the clinical definition is a little bit more stringent, and it is a marked delay or marked&nbsp;&nbsp;infrequency of ejaculation that has occurred almost 75% to 100% of the time in the last six months, and that causes the individual distress or bother.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And this is pretty uncommon. It occurs in about 1% of men where they have a lifelong delayed ejaculation and 4% of men where they get acquired delayed ejaculation.&nbsp;</p><p>&nbsp;</p><p>In this article, we’re going to cover the physiology of erection, the causes, the diagnosis, and the treatment options for delayed ejaculation.&nbsp;So make sure to stick around until the end.&nbsp;</p><p>&nbsp;</p><h2>Definition of Ejaculation</h2><p>&nbsp;</p><p>So ejaculation is the process of releasing semen from the body, and it occurs in many steps. The first step is emission, where semen enters the urethra through the ejaculatory duct and the bladder neck closes to make sure that your semen will not go backwards into the bladder.&nbsp;</p><p>&nbsp;</p><p>And the process of expulsion, where the semen is pushed out through the urethra, usually with the support of the pelvic floor muscles and the muscles around the urethra called the bubble cavernosis muscles.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Interestingly, ejaculation is a reflex. Once you get to the point where your body sends signals to your spinal cord and then to your brain that you need to ejaculate, ejaculation occurs and there’s nothing you can do to stop it.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And typically, orgasm occurs at the same time as ejaculation. But orgasm is a brain triggered event whereas ejaculation is a spinal cord triggered event. And so these can occur her most often together, but not always.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And specifically, some hormones, like dopamine, are&nbsp;increased during orgasm, whereas other hormones, like prolactin, are suppressed. So some of the medical treatments, all of which are off label, kind of try to work with these hormones to help improve the time to ejaculation and orgasm.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>What causes delayed ejaculation?</h2><p>&nbsp;</p><p>Well, there’s a number of different causes. It can be psychological, meaning that it’s&nbsp;due to something in your brain or something that’s bothering you in your brain or it can be physiological, meaning that’s from your body and sometimes it can be a combination of both.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Psychological issues</h2><p>&nbsp;</p><p>So psychological issues can be many. It can be due to certain fears you have. It can be due to having strong religious convictions or guilt associated with ejaculation. It can be due to relationship conflicts.&nbsp;&nbsp;</p><p>&nbsp;</p><p>It can be due to idiosyncratic masturbation techniques which I’ve talked about before in my article&nbsp;about when the small chances where masturbation can become harmful. It can be due to performance anxiety.&nbsp;Or the lack of stimulation or arousal. So all of these things can contribute to a psychological delayed ejaculation.&nbsp;</p><p>&nbsp;</p><p>Physiological causes, meaning from your body that you cannot control can be due to things like having surgery which affects the nerves that carry those signals to the spinal cord to cause the ejaculatory reflex or having medical conditions like multiple sclerosis or spinal cord injury where we see this quite often.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Low testosterone</h2><p>&nbsp;</p><p>Interestingly, there’s also data to suggest that. Low testosterone is commonly seen in men with delayed ejaculation. However, supplementing&nbsp;testosterone doesn’t always correct the problem. So we don’t think that the low testosterone is causing the delayed ejaculation, but certainly something to get checked out.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Other hormones that can be abnormal are those like prolactin and your thyroid levels, that can also affect ejaculation. Certain congenital abnormalities can play a role.&nbsp;</p><p>&nbsp;</p><h2>And last,&nbsp;Aging.&nbsp;</h2><p>&nbsp;</p><p>And the reason aging can cause delayed ejaculation is because the sensitivity of the penis can decrease during age.&nbsp;&nbsp;</p><p>&nbsp;</p><p>This is just because as people age, not only does their whole body get older, but also their nervous system gets older. And this can change the receptors that take sensory input and convert that into signals to your body.&nbsp;</p><p>&nbsp;</p><p>And so it can be useful in those cases to experiment with different types of stimulation like vibration, different types of temperature, and see if those things can also cause different types of sensations sent to your spinal cord that can lead to ejaculation and orgasm.&nbsp;&nbsp;</p><p>&nbsp;</p><p>How do we diagnose delayed ejaculation?&nbsp;</p><p>&nbsp;</p><p>Well, it’s really important to get a good&nbsp;ejaculation. There are several things we want to get a sense of.&nbsp;</p><p>&nbsp;</p><p>We want to get a sense of what is going on in your relationship.&nbsp;</p><p>&nbsp;</p><p>And is this a situational occurrence that only happened to certain people? Is it recent? Has it become a more common thing for many, many years, or have you had it for your entire life?&nbsp;</p><p>&nbsp;</p><p>We also want to get a sense of all the other issues that may be associated with sexual dysfunction.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>So, are you having issues with arousal ejaculation?&nbsp;</h2><p>&nbsp;</p><p>Are you having an orgasm at the time but not feeling ejaculation? Because that could be a sign of something called retrograde ejaculation.&nbsp;</p><p>&nbsp;</p><p>We’ll also want to know your masturbation habits and your medical history. Is there certain medications or surgeries that you’ve had that might be affecting your nervous system.</p><p>&nbsp;</p><p>During the examination, we’ll want to assess one. Do you have normal secondary sex characteristics? Meaning, do the testicles seem to be a normal size? Are the other structures like the vast deference and the epididymis normal and palpable on both sides unless, of course, you’ve had a vasectomy.&nbsp;</p><p>&nbsp;</p><p>What is the nervous response of that area? So how do you respond to light touch or touch pinprick? And are your reflexes intact? So there are certain tests we can do in the office to assess your reflexes.&nbsp;&nbsp;</p><p>&nbsp;</p><p>As I mentioned before, ejaculation is a reflex, and typically, if we do any testing, it will be based on your history and your physical examination. Perhaps if there’s a concern for retrograde ejaculation, we may check the urine after orgasm to see if there is sperm indeed in the bladder.&nbsp;</p><p>&nbsp;</p><p>Also, if there’s any abnormalities in the prostate, the testicles, the vast deference or epidemic, we may proceed with an ultrasound. Again, all of these things are dependent on what we find during the examination and during your history.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>How do we treat retrograde ejaculation?</h2><p>&nbsp;</p><p>Well, treatment really depends on what the cause is. So if it’s psychological in nature, there are a whole host of treatment options that can be offered by a psychologist with expertise in sexual medicine.&nbsp;&nbsp;</p><p>&nbsp;</p><p>This can include things like cognitive behavioral training. If it’s associated with masturbation, there can be things like masturbation retraining and adjustment of sexual fantasies can also proceed with psychotherapy to kind of focus on areas of conflict and sensate focus exercises.</p><p>&nbsp;&nbsp;</p><p>So focusing on touch and intimacy rather than the sexual encounter and building yourself up to the sexual encounter itself. And things like mindfulness training to reduce anxiety associated with sex.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And also, things like couples counseling can be very helpful.&nbsp;</p><p>&nbsp;</p><p>In men who have a low testosterone and have delayed ejaculation, supplementing the testosterone can be helpful in a small subset of patients, although not always.&nbsp;</p><p>&nbsp;</p><p>If it’s neurologic in nature and you’re not having retrograde Ejaculation, then you may be having Anejaculation. And that is actually useful to seek out an infertility specialist where they can then work with you to obtain the sperm for fertility purposes, using things like vibratory stimulation and reluctant ejaculation, or even surgical procedures to remove the semen from the areas where it’s stored in the body.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And as I mentioned earlier, there are a whole host of off label treatments. Nothing is FDA approved that can help with delayed ejaculation. I’m not going to list them all here because, as I mentioned, they are off label.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So seeking out care from an expert in sexual medicine can be very helpful in managing delayed ejaculation and experimenting with these medications to see if something helps. Okay, I hope you guys found this helpful.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And as always, we’re going to take care of yourself.&nbsp;</p>"}}}]},"__N_SSG":true}