{"pageProps":{"article":[{"id":46,"attributes":{"title":"Can sexual kinks and fetishes be harmful to your health, according to a urologist?","slug":"can-sexual-kinks-and-fetishes-be-harmful-to-your-health-according-to-a-urologist","createdAt":"2023-03-02T21:52:33.301Z","updatedAt":"2023-03-02T21:52:34.857Z","publishedAt":"2023-03-02T21:52:34.853Z","img":"https://images.pexels.com/photos/5915429/pexels-photo-5915429.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"BDSM relates to activities that occur between two or more individuals, that include things like administering or receiving intense sorts of stimuli, which may include pain. \n\nAlso including things like authority and submission in between the two individuals and also including arousal that’s associated with certain inanimate objects or maybe even specific body parts.  \n\nSometimes these activities can also include role play, and it’s described as changing your consciousness or changing your headspace. \n\nSo there’s been a couple studies in areas like Quebec, Belgium and Australia looking at how many people have been interested in kinks like this or have participated in them and how often do they do them regularly.  \n\nAnd depending on the study, at least half of both men and women have either wanted to participate in a sort of fetishes or BDSM like play. And within that population, about 20% to 30% had at some point participated in some sort of BDSM play.  \n\nAnd that could be like being tied up or spanking or giving spanking or receiving spanking. \n\nBeing someone who does it more regularly was less common somewhere on the order of 1 to 7%. While very few recognize it as an identity, many people participate in it at some form at some point during their lifetime.  ","tags":["BDSM"],"readTime":5,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":46,"content":"<h2 data-pm-slice=\"1 1 []\">Full Form of BDSM</h2><p data-pm-slice=\"1 1 []\">&nbsp;</p><p><strong>Bondage and Discipline, Dominance and Submission, Sadochism and Masochism.</strong></p><h2>What is BDSM? How common is it and who’s doing it and is it safe?&nbsp;</h2><p>&nbsp;</p><p>BDSM relates to activities that occur between two or more individuals, that include things like administering or receiving intense sorts of stimuli, which may include pain.&nbsp;</p><p>&nbsp;</p><p>Also including things like authority and submission in between the two individuals and also including arousal that’s associated with certain inanimate objects or maybe even specific body parts.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Sometimes these activities can also include role play, and it’s described as changing your consciousness or changing your headspace.&nbsp;</p><p>&nbsp;</p><p>So there’s been a couple studies in areas like Quebec, Belgium and Australia looking at how many people have been interested in kinks like this or have participated in them and how often do they do them regularly.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And depending on the study, at least half of both men and women have either wanted to participate in a sort of fetishes or BDSM like play. And within that population, about 20% to 30% had at some point participated in some sort of BDSM play.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And that could be like being tied up or spanking or giving spanking or receiving spanking.&nbsp;</p><p>&nbsp;</p><p>Being someone who does it more regularly was less common somewhere on the order of 1 to 7%. While very few recognize it as an identity, many people participate in it at some form at some point during their lifetime.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Different categories of BDSM</h2><p>&nbsp;</p><p>So when reviewing the literature on BDSM, one of the research articles actually described the different types of BDSM play.&nbsp;</p><p>&nbsp;</p><p>So for your interest and knowledge, these are the different categories.&nbsp;</p><p>&nbsp;</p><p>First include sensation play.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So incorporating sensation, which could be tickling or cupping or using clamps or cups. Rough body play, which can include some sort of slapping or pulling or things of that nature. Genital, sex and bodily fluid, which is somewhat self-explanatory.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Sensory deprivation like using some way to take away people’s sensations like blindfolds bondage so being tied up or using handcuffs seen or relationship dynamics which are often described as having a dominant and a submissive role play and psychological play, that’s pretty obvious.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And lastly, body modification which can be permanent in some of these cases.&nbsp;</p><p>&nbsp;</p><p>So these things can be as benign as very gentle and can be very aggressive.&nbsp;</p><p>&nbsp;</p><h2>How often do people get injuries from BDSM or kinks?&nbsp;And how often do they report it to their doctors?&nbsp;</h2><p>&nbsp;</p><p>So, in order to figure this out, a group of researchers surveyed almost 1400 individuals who identified themselves as being involved in kink play. They recruited people through social media sites through certain organizations that are like called Fetlife, which is specifically for individuals who are interested in kink related activities or other organizations like the National Coalition for Sexual Freedom.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So, out of those, nearly 1400 individuals over 10% actually had an injury that either caused them to seek medical attention or take off a day of work.&nbsp;</p><p>&nbsp;</p><p>And sadly, those who did have an injury were actually less likely to go seek medical attention.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And that was more common in people who had a prior bad experience with healthcare providers. And if people felt like they had to educate their doctors about what BDSM was, they were less likely to go see them, which all makes sense.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And overall, less than half of people told their doctors about their involvement in these sorts of activities and slightly more than half talked to their mental health providers like psychiatrists or psychologists about their activities.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But as you know, there can be physical complications associated with this sort of play. There can be bruising or musculoskeletal injuries from things like whipping, flogging, there can also be burns from using hot wax play, there can be nerve injuries from bondage activities.&nbsp;&nbsp;</p><p>&nbsp;</p><p>If you have any sort of broken skin that can often lead to infections and also if you’re doing any sort of body modification like piercings or temporary needle play, that can also cause exposure to other infections that the person you’re engaging with may have.&nbsp;&nbsp;</p><p>&nbsp;</p><p>However, dying from something like BDSM is extremely rare. And when you look at the evidence of people who’ve had fatal injuries from a sexual act and the most common and reason for that is due to erotic asphyxiation or Strangulation.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And that can range anywhere from 0.02% to 0.2%. And to compare that to dying during sex from a heart attack, for example, that’s also very uncommon and around 0.25%&nbsp;of people die from a cardiovascular event during intercourse.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Fatalities from BDSM</h2><p>&nbsp;</p><p>So how do we know about these fatalities due to BDSM related play?&nbsp;</p><p>&nbsp;</p><p>Well, there was a study that looked at all the BDSM related fatalities that were reported in the literature between 1986 and 2020 and they found 14 cases.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And so in these 14 case reports, there were 17 instances of death. And again, the most common 88% of the people who died were due to erotic Asphyxiation or Strangulation.&nbsp;</p><p>&nbsp;</p><p>And in a lot of those cases, there was also mention of illicit drugs or mind-altering drugs that were taken by either the person who was administering the asphyxiation or the person who was receiving it.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>How to have safe BDSM?</h2><p>&nbsp;</p><p>But this is not really common in BDSM communities because they have very specific rules in how to initiate people, educate people who are interested in BDSM, how to manage after care issues, and also have safe words that they used to make sure people can feel comfortable saying when they feel discomfort.&nbsp;That is out of the range of what they are expecting.&nbsp;</p><p>&nbsp;</p><p>Also, the usage of drugs is generally frowned upon in this.&nbsp;</p><p>&nbsp;</p><p>So I would say if you are interested in participating in some sort of kink related play with your partner, please number one, educate yourselves on what is safe and what is not.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And secondly, never do it when you’re under the influence of any mind-altering medications or drugs.&nbsp;</p><p>&nbsp;</p><p>I hope you guys found this helpful. As always,&nbsp;take&nbsp;care.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}