{"pageProps":{"article":[{"id":50,"attributes":{"title":"The 5 reasons to avoid No Nut November, as explained by a urologist","slug":"the-5-reasons-to-avoid-no-nut-november-as-explained-by-a-urologist","createdAt":"2023-03-16T00:17:12.683Z","updatedAt":"2023-03-16T00:17:15.604Z","publishedAt":"2023-03-16T00:17:15.602Z","img":"https://images.pexels.com/photos/5187652/pexels-photo-5187652.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"‘No Nut November’, as it is usually known, can be traced back to a random entry on Urban Dictionary in 2011, and then gained traction on Twitter, Reddit, 4chan and TikTok over the years.\n\nNow it’s been co-opted by certain well-meaning organisations trying to combat porn addiction, like NoFap, and other far-right groups that require complete masturbation abstinence.\n\nBut basically No Nut November means that someone has set a challenge for themselves to not jerk the noodle/flick the bean for the month of November. Whilst it is mainly dudes that partake, it is obviously open to everyone.","tags":["No Nut November"],"readTime":7,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":50,"content":"<p data-pm-slice=\"0 0 []\">Sober October is over, and now it’s No Nut November. But should you really participate in No Nut November?</p><p data-pm-slice=\"0 0 []\">&nbsp;</p><p><strong>I’m going to give you five reasons why you shouldn’t participate in No Nut November.</strong>&nbsp;</p><p>&nbsp;</p><p>As a disclaimer, this is not an article&nbsp;to shame anyone who wants to participate in no Nut November. If you find some benefit from doing so and it’s not affecting you negatively in any way, then please, by all means, go ahead.&nbsp;</p><p>&nbsp;</p><p>But these are five reasons that if you’re kind of skittish about doing it, that really you shouldn’t do it.</p><h2>So number one reason is that it actually reduces the quality of your sperm.</h2><p>&nbsp;</p><p>This is interesting because we do tell people that optimally, when you’re trying to conceive and have babies, you should try not to have sex every day, necessarily, maybe every other day.&nbsp;</p><p>&nbsp;</p><p>However, emerging data says that it may be okay to just have sex every day. And here’s why. So, as you abstain from sex, studies have shown that, yes, sperm number and the semen volume increase over time.&nbsp;</p><p>&nbsp;</p><p>However, the quality of that sperm decreases with longer periods of abstinence. Specifically over five days, you find that we see increases in sperm DNA fragmentation. So what does that mean? It means that the DNA is not as good a quality as it is in the sperm that you would have after day one or day two.&nbsp;</p><p>&nbsp;</p><p>And when you’re trying to create an embryo,&nbsp;trying to conceive a baby, it’s really important for the sperm to have good quality DNA. Otherwise, the embryo doesn’t usually take.</p><p>&nbsp;</p><p>In fact, in one study, looking at over 5000 semen analyses after men who had not ejected for eleven to 14 days, they found that sperm motility, which means the ability of the sperm to move to get to the egg, decrease as well as sperm morphology, which is the shape of the sperm.&nbsp;</p><p>&nbsp;</p><p>So you may not know this, but sperm is always pictured in this beautiful little head and tail. But often we see sperm that are looking a little bit different. They may be more round, they may not have a tail, they may look a little bit different.&nbsp;And those sperm are not capable of fertilizing an egg.</p><h2>Number two reason, and this is a big one, it doesn’t affect testosterone levels.</h2><p>&nbsp;</p><p>Hear me out. Everyone quotes this one study. They looked at 30 men after seven days of abstinence and found that there’s testosterone increased by over 100%.&nbsp;</p><p>&nbsp;</p><p>But that study has since been retracted, meaning that for some reason, some scientific reason, it was actually pulled from the literature as being a good, supportive evidence.</p><p>&nbsp;</p><p>One of the big reasons that semen retention proponents talk about doing this process is because it boosts testosterone.&nbsp;</p><p>&nbsp;</p><p>And what are the benefits of having higher testosterone? Well, it can boost your libido, increase your muscle mass, reduce your fatigue, and even improve your cognitive function. Meaning it might sharpen your memory.&nbsp;That sounds great. If you could do something to give you all those things naturally, of course you would do it.</p><p>&nbsp;</p><p>In another study, they only looked at 10&nbsp;men between the ages of 22 and 29, and they evaluated their testosterone levels after 21 days of abstinence.&nbsp;</p><p>&nbsp;</p><p>And what they found was they did have an increase in testosterone, but it wasn’t sustained for any long period of time. It was only 20 to 30 minutes.</p><p>&nbsp;</p><p>So if you’re looking for a sustained boost in testosterone, make sure you check out my article&nbsp;on natural ways to Boost Testosterone.&nbsp;</p><p>&nbsp;</p><p>And also, if you’re older and not trying to conceive, talk to your urologist about getting testosterone replacement. I’ve also written&nbsp;an article&nbsp;on that. So make sure you check out my article&nbsp;on testosterone replacement as well.&nbsp;</p><p>&nbsp;</p><h2>Number three, it does not enhance your athletic performance.</h2><p>&nbsp;</p><p>Since Roman and Greek times, educators have been touting the benefits of abstaining from sex before athletic performance. And the reason was that they thought that sexual frustration would cause some increased aggression, whereas&nbsp;sex may lead people to be more calm, relaxed and maybe even tired.</p><p>&nbsp;</p><p>In a metaanalysis of nine studies looking at sports performance or athletic performance after abstaining from sex, what they found was that there was no impact on a number of different factors.&nbsp;</p><p>&nbsp;</p><p>One of these was a stationary bike stress test, and they looked at differences in output after abstain versus after sex. They found no difference. They also found that there was no difference in focus.</p><p>&nbsp;</p><p>Another study looked at hand grip strength, which is a measure of muscular performance and strength.&nbsp;</p><p>&nbsp;</p><p>And the only thing they found was that in people who had sex 2 hours before performing, they did have an increased heart rate. Which means that, yes, if you are having sex 2 hours before going to a performance or going to a game or a competition of some sort, it may affect your recovery a little bit.&nbsp;</p><p>&nbsp;</p><p>Ultimately, I think the key here is that not every single person is the same. What you want to think about is your personal routine. What do you normally do? Because increased stress in certain types of activities is not actually good.&nbsp;So if avoiding sex is causing a lot of stress, that can actually hamper your performance.</p><p>&nbsp;</p><p>Generally speaking, the night before you’re going to have a big performance is not the time to be changing your general routine.&nbsp;</p><p>&nbsp;</p><p>So if you have sex every day, then have sex every day. If that’s a normal part of your life, then you should go ahead and do that.</p><p>&nbsp;</p><h2>And number four, if you’re not ejaculating during the day, your body will often take care of it at night while you sleep.&nbsp;</h2><p>&nbsp;</p><p>&nbsp;</p><p>So I wrote&nbsp;an article on nocturnal emissions or wet dreams or nightfall, whatever you want to call it. But it’s actually these are normally occurring ejaculations that happen during your sleep. They are not always associated with erotic dreams, but we’ve seen that in studies, it’s correlated people who have more nocturnal emissions are those who’ve had a longer duration between having an orgasm and their sleep time.</p><p>&nbsp;</p><h2>Pelvic floor dysfunction &nbsp;</h2><p>&nbsp;</p><p>If this is really stressing you out, it can cause. What we call&nbsp;Blue balls or Pelvic floor dysfunction. So blue balls is actually a real thing. It’s called Epididymal hypertension. What that means is when you’re aroused, blood flow goes to the penis and to the testicles.&nbsp;</p><p>&nbsp;</p><p>And usually after you have an active stimulation and your release, all that blood flow goes away. However, sometimes some of that blood flow still stays around and it can cause this discomfort&nbsp;and achy feeling that many people describe as blue balls, or, for women, blue vulva.&nbsp;</p><p>&nbsp;</p><p>Also, if this is really stressing you out, it can cause something called pelvic floor dysfunction. Basically, pelvic floor muscles are the bowl of muscles that sit in our pelvis that hold all our organs up.&nbsp;</p><p>&nbsp;</p><p>But they can also carry a lot of stress. If you’re getting very stressed and trying to control your ejaculation over and over again, the pelvic floor muscles can get really tense and they can start holding tension all the time.&nbsp;</p><p>&nbsp;</p><p>When that happens, you can develop a number of different symptoms. This can include symptoms like pain with Ejaculation, Testicular pain can cause pain with defecation or back pain. It can also cause urgency, like got to go, got to go in the bathroom, as well as constipation.&nbsp;</p><p>&nbsp;</p><h2>Should you do No Nut November?</h2><p>&nbsp;</p><p>So if you’re trying to do No Nut November and you realize that you’re having a lot of discomfort, this may be why.</p><p>&nbsp;</p><p>And it’s important to see an urologist and go to a pelvic floor physical therapist to help take care of all this pelvic floor tension.&nbsp;</p><p>&nbsp;</p><p>I hope you all have a wonderful November, and whatever you decide to practice, that’s all fine with me, as long as you are happy and healthy.</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}