{"pageProps":{"article":[{"id":34,"attributes":{"title":"According to an Urologist, 10 Amazing Ways to Increase Your Sexual Pleasure","slug":"according-to-an-urologist-10-amazing-ways-to-increase-your-pleasure","createdAt":"2023-02-22T23:31:02.271Z","updatedAt":"2023-02-22T23:31:03.956Z","publishedAt":"2023-02-22T23:31:03.953Z","img":"https://images.pexels.com/photos/4541585/pexels-photo-4541585.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Are you satisfied with the state of your sexual relationship?\nOr would you like to give it a little more boost? Discover the ten ways you and your partner can improve your pleasure in bed.","tags":["orgasm"],"readTime":15,"dataSources":null,"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":34,"content":"<h2 data-pm-slice=\"0 0 []\">How to increase sexual pleasure?</h2><p data-pm-slice=\"0 0 []\">&nbsp;</p><p><strong>We all have sex. One, to have children, and two, for pleasure. And in this article, I’m going to talk about 10&nbsp;ways you can increase pleasure.&nbsp;</strong></p><p>&nbsp;</p><h2>Communicate&nbsp;</h2><p>&nbsp;</p><p>So number one is simple communication. And this sounds super easy, but you’d be surprised to know how many patients of mine come into the office and tell me about their issue.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And I ask them, how does your partner feel about this? And they say, Well, I’ve never really asked them. I just want to make sure that I can pleasure them appropriately. I ask them, well, do they find pleasure from penetrative intercourse or do they find pleasure from other things?&nbsp;&nbsp;</p><p>&nbsp;</p><p>And sometimes they’re just not sure. And it’s not your fault because no one taught us how to communicate about sex. It’s not something you learn in sex head. It’s not something your parents usually talk to you about.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>So how do you even start doing it?</strong>&nbsp;</p><p>&nbsp;</p><p>Well, let me give you some tips. First off, you want to make sure that you communicate outside of the bedroom. You don’t want to actually have a really serious communication right before or after you’re about to be intimate with your partner, because it can either end the intimate session, meaning you’re not going to be intimate because now you’ve brought up this really awkward conversation, or it can lead to somebody feeling really insecure.&nbsp;&nbsp;</p><p>&nbsp;</p><p>You might have brought up how you would really like to try something else, and they may misinterpret that and say, hey, is something wrong with me? Am I not providing you pleasure? And so it’s really important to do this in a neutral location, either when you’re having breakfast or lunch or when you’re out for a walk or something else where you can have a serious communication, but it can be casual and relaxed.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Number two, realize that it’s going to take many conversations. You’re not just going to have one conversation, and it’s over. You guys have probably never had communication before, and so it’s going to be a bit awkward and it’s probably good to just say, hey, I’d really like to make this a part of our relationship where we talk about our intimate time, about sex, about how we can increase pleasure for each other.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Maybe we can start talking about it today and revisit it at a later date. And number three, when you’re talking about it, you want to make it about yourself. You want to say, hey, I would really like it if we could do more of this.&nbsp;&nbsp;</p><p>&nbsp;</p><p>How do you feel about that? Not I don’t like it because you don’t do this for me, because that will end up making the other person feel inferior or bad about themselves or feel like they’re being attacked.&nbsp;</p><p>&nbsp;</p><p>And lastly, if they’re complaining of an issue that is medical, like they’re having issues with erections, of getting aroused or having pain with sex and you’ve tried some different things, it’s important to get professional help.&nbsp;</p><p>&nbsp;</p><p>Whether that means seeing a sex therapist or a counselor that can help you either communicate through these things or figure out if there’s a psychological component to them or seeing an urologist. We have tons of options to help you get better in all those areas.&nbsp;</p><p>&nbsp;</p><p>And so it’s really important to just take the plunge. This is what we do for a living. We certainly do our best to not make you feel uncomfortable because we want you to get the help you need to have the best sex life possible.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Be open to masturbating</h2><p>&nbsp;</p><p>And then number two is, be open to experimentation.&nbsp;</p><p>&nbsp;</p><p>Now, what exactly does that mean? One is open to masturbating. Be open to each other, masturbating and learning from masturbation. So masturbation can be a great way to explore your body and figure out what you like and what you don’t like.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And so don’t take it as, oh, they’re finding pleasure by themselves. I’m going to be replaced. It’s more about, hey, this is great. My partner is finding pleasure and able to communicate that with me.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And certainly in relationships where there’s a mismatched libido, meaning somebody’s really wanting to have sex a lot and someone’s having less masturbation is a great way to kind of equalize that so that you are able to get pleasure from yourself and from your partner at different times.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Now, I’ve talked about things that you want to be careful with, with masturbation and the benefits of masturbation. So check out both those articles.&nbsp;</p><p>&nbsp;</p><p>And also the other way you can experiment is with each other.&nbsp;So you can kind of figure out which parts of the body or which erogenous zones make someone arouse and that’s different from person to person. For some people, it can be the nipples, the ears, the toes, the inside of the elbow, right?&nbsp;&nbsp;</p><p>&nbsp;</p><p>And so actually figuring out what areas for each individual person cause them to be aroused can make sex more fun and foreplay more enjoyable because you can stimulate these other areas and every single person is different.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But these areas map on the brain to areas near the genitals, which is why sometimes our brain can derive pleasure from really like kind of unrelated things like your earlobe. So experimenting can bring a whole new wave or different way of achieving pleasure.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Some people have even recommended, like, mapping out your body, like take a marker, obviously a washable marker, and mark out areas that you think you might enjoy being touched and some areas that maybe you are like, no way, please don’t go there.&nbsp;Or I’m not ready for that.&nbsp;</p><p>&nbsp;</p><p>And let your partner kind of see that. And so that can be with either a circle and an X or green light, red light and maybe a yellow light, like where I’m ready to experiment, but I’m not sure.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And then throughout the experience when you’re trying new things is continue the communication. Just because you’re trying to be intimate doesn’t mean that you stop communicating the whole time. You want to communicate, yes; I like this.&nbsp;No, I don’t. And don’t take it personally. You’re experimenting, you’re figuring it out.&nbsp;</p><p>&nbsp;</p><p>So before I go on to some more things you can do with your partner, I want to talk specifically about women and specifically about men, how you can increase their individual pleasure.&nbsp;</p><p>&nbsp;</p><h2>Stimulate the clitoris</h2><p>&nbsp;</p><p>For women, the first thing is to stimulate the clitoris. The reason being is 80% to 90% of women need clitoral stimulation in order to climax, whether that’s clitoral stimulation with penetration or without.&nbsp;</p><p>&nbsp;</p><p>And that’s because the clitoris is the homolog of the penis. And what this means is that they both develop from the same tissue embryologically. And so, as the fetus develops, if it gets the right signals to have an XY chromosome to be a male, it’s going to develop a penis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And if it gets the signals to be an XX chromosome, it’s going to get the signal to develop into a clitoris. And they basically are the exact same, except for the clitoris, instead of extending outward, extends inward and then forks like a wishbone on the inside.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So in women, certainly when they’re deriving pleasure, most often it’s because their clitoris is being stimulated from the inside of the vagina or the outside of the vagina. So it’s important again to experiment and figure out what your partner likes best.&nbsp;And that may or may not include just penetrative sex.&nbsp;</p><p>&nbsp;</p><h2>Increase foreplay</h2><p>&nbsp;</p><p>Foreplay can help for both men and women, but particularly in women, it can take 20 to 30 minutes to achieve full arousal.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>And what exactly does that mean?</strong>&nbsp;</p><p>&nbsp;</p><p>Well, as women are achieving arousal, their vagina creates lubricant. And it can take some time for the body signals to say, hey, I’m aroused, for the body to start making lubricant.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Also, as the body becomes more aroused, the vagina widens and lengthens, as I mentioned in a recent video, and it gets ready to accommodate an erect penis. And so if you go too fast and they’re not fully aroused, it can actually mean that sex is painful when you’re penetrating deeply.&nbsp;And so that’s why foreplay is so important.&nbsp;</p><p>&nbsp;</p><p>And let me take a little minute to talk about lubrication. Lubrication of a woman does not correlate with how turned on they are all the time. There are certain times in a woman’s life where she may make less lubricant, or they may just not make much lubricant as in general, it’s just genetic differences.&nbsp;</p><p>&nbsp;</p><p>And this can be because they’re going through menopause, when the body actually changes and has less estrogen, so the tissues become thinner, create less lubrication.&nbsp;And that’s just a part of going through menopause.&nbsp;</p><p>&nbsp;</p><p>Certainly we have treatments to help with that thinness, like vaginal estrogen. So women who are reading&nbsp;this, who are going through menopause, please talk to your doctor about hormones, particularly vaginal estrogen, which can be a great way to thicken those tissues in the vagina and make sex more pleasurable.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Also, if they’ve just had a baby or they’ve had surgery where they’ve reduced their estrogen or their uncertain medications, all of these things can make less lubricant. It has nothing to do with&nbsp;you, or how turned on they are, or how ready they are for sex all the time.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Use lubrication</h2><p>&nbsp;</p><p>Lubrication is fun. Buy a lubricant. It’s great, it’s cheap, it’s easy. I’ve written&nbsp;an entire article&nbsp;about lubricants. But the bottom line is lubricants are meant to make things more slippery, more fun and have less friction.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And overall there’s nothing wrong with that. It’s great. You can use that at every age and it’s wonderful. So if you want to deep deeper dive, make sure you check out my article. But just briefly, there are three different types of lubricants, and the easiest type to get is water-based lubricants.&nbsp;&nbsp;</p><p>&nbsp;</p><p>That’s because they’re everywhere. You can get them over the counter at any drugstore, super easy, and they’re usually very affordable and they’re great. The things you have to look out for is that they do dry up pretty quickly and so you need to reapply so that you continue having the benefit of the lubricant.&nbsp;&nbsp;</p><p>&nbsp;</p><p>There’s also silicone based lubricants which are slippery and longer lasting, so you usually only have to apply once and they’re tons of fun. But you do have to be careful if you’re using them with silicone-based sex toys because they can degrade the sex toy.&nbsp;</p><p>&nbsp;</p><p>And lastly, they are oil-based lubricants and these are also longer lasting. But you do have to be careful if you’re using them with condoms because they can cause condom breakage and so avoid those if you are using a condom.&nbsp;</p><p>&nbsp;</p><p><strong>What about men?</strong>&nbsp;</p><p>&nbsp;</p><p>Well, I think for men, again, communication is going to help you understand what the like and don’t like. Not all men are the same, but the important thing is that men have a lot of pressure to perform.&nbsp;&nbsp;</p><p>&nbsp;</p><p>They have to get and sustain an erection and last long enough. And unfortunately, it’s not like a machine. There’s going to be times where a man will lose his erection early or ejaculate earlier than he wanted to.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And that’s okay. It’s important to realize that it’s not a sign that something is wrong with you. It may be a sign that they have stress in their system, they’ve had something to drink, they have a medical problem or medical condition.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And so all these things taken together, it’s really not usually about the partner. It’s about something else. So if you’re in the middle of things and you’re still feeling intimate, it’s okay to keep going.&nbsp;</p><p>&nbsp;</p><h2>Don’t take performance issues personally</h2><p>&nbsp;</p><p>There are other ways you can continue pleasuring each other, in other ways that he can continue pleasuring you as well. It’s important to realize everyone’s got ten fingers, they’ve got a mouse, they’ve got toys.&nbsp;And you can use all those different things to help increase pleasure whether or not you have a functioning erection.</p><p>&nbsp;</p><h2>Increase relaxation</h2><p>&nbsp;</p><p>I mentioned stress earlier, and that brings us to our next point, which is increased relaxation.&nbsp;</p><p>&nbsp;</p><p>Because when your body is stressed, it releases cortisol. It turns on your sympathetic nervous system and you increase your fight or flight and your body gets ready to run. Basically, it increases blood flow to the extremities and to help you get enough energy to the muscles so that you can then do whatever activity you’re going to do, which is run away from the stressor.&nbsp;</p><p>&nbsp;</p><p>But in reality, your body can’t differentiate between a stressor like, like a lion coming after you, or a stressor like you had a rough day at work. Your body does the same thing. And so if you’re stressed, you’re just not going to be able to get blood flow to the genitals because it’s working somewhere else and it’s going to be much harder to get aroused.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So in order to increase pleasure, you can actually incorporate some sort of&nbsp;couple’s relaxation before you get intimate. That can be giving each other a massage or even going for a massage together, that can be doing yoga together or meditating together.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Those things can help your body relax. Know that you’re in a safe space and that will make it easier and more readily available to you to get aroused and get excited about sex. And if you’re wondering how to destress quickly, I wrote&nbsp;an article&nbsp;while back about how you can destress in as little as 6 seconds per day.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So make sure you check that one out because it’s got great things that I personally use every day to help reduce stress.&nbsp;</p><p>&nbsp;</p><h2>Schedule time for intimacy</h2><p>&nbsp;</p><p>A lot of people kind of go, whoa, I don’t want to schedule sex.&nbsp;It should be something that we just do, right? We just get excited about each other and we have sex. But in reality, that’s not what happens, right? We’re busy, we work, we’ve got kids, we’ve got a lot of responsibilities.&nbsp;&nbsp;</p><p>&nbsp;</p><p>It’s not like when you’re young, and your only responsibility is going to school. You have more time and a lot of hormones that help you get really excited. When you see your partner, you get aroused.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But when you’ve won been in a longer term relationship or you’ve got other stressors in life, it’s more difficult to get aroused just by seeing your partner. And so less likely that you’re going to have spontaneous sex.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And that’s because there are two different types of desire. There’s spontaneous desire, which is exactly what I described. You see your partner; you get excited; you want to have sex, and there’s responsive desires.&nbsp;&nbsp;</p><p>&nbsp;</p><p>You don’t necessarily get aroused just by seeing your partner or thinking about them. But when you’re together, when you’re intimate, when you’re holding each other, touching each other, and just being together next to each other, you can remember. Oh yeah, my body likes this.&nbsp;I want, want to have sex with this person.&nbsp;</p><p>&nbsp;</p><p>And so it actually requires you to take the time to be together and not be in your bed looking at your phones, respectively, or typing away in your laptops.&nbsp;&nbsp;</p><p>&nbsp;</p><p>It means that you are actually together. And so that’s where scheduling time comes in. We are an overscheduled culture. I mean, look at your calendars, right? You’ve probably got everything scheduled from work meetings to taking your kids to practice and to when you’re going to exercise even.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But you’ve never scheduled time for your partner. Yeah, you might schedule time for a date night, but guess what happens on date night? You eat a ton of food. Your body gets focused on digesting that food, and you feel bloated and uncomfortable.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And yeah, that’s not the greatest setup for having an intimate time. So let’s schedule time for actual intimacy, where you are going to turn off your phones, turn off your devices, be together with each other, and actually focus on being intimate.&nbsp;</p><p>&nbsp;</p><p>It doesn’t mean that you’re going to have to have sex, but it’s on the table if you want it. And if you think back to when we were kids, right, you would think about, oh, I’m going to have a date with this person on Friday.&nbsp;</p><p>&nbsp;</p><p>I’m really excited, I can’t wait. And you get prepared, right? You’re like, oh, we might have sex. I might shave or do other things or wear a really nice perfume or whatever it is because you want to make that as successful as possible.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And it’s the same thing. It can be an exciting thing to do.&nbsp;</p><p>&nbsp;</p><h2>Be mindful during sex</h2><p>&nbsp;</p><p>And when you’re scheduling this time, it brings me to my next point, which is mindfulness.&nbsp;</p><p>&nbsp;</p><p>Not so long ago, I wrote&nbsp;an article&nbsp;about how mindfulness can help improve your sex life.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And it’s true, being mindful, which means being present during sex, like trying to avoid thinking about other things if they come in and you think of something like, if I forgot to, like, water the plants, well, you know what?&nbsp;I’m going to let that thought come in and go away. And then I’m going to focus on what’s going on, whether it’s how my partner’s holding me, how they’re touching me, how they smell good, or how it feels nice to be in their arms, or it feels nice to hold them, right?&nbsp;&nbsp;</p><p>&nbsp;</p><p>So if you actually focus on those sensations, it can lead to an overall better sex life, better pleasure, better orgasms, better overall experience during sex.&nbsp;&nbsp;</p><p>&nbsp;</p><h2>Exercise</h2><p>&nbsp;</p><p>And I promise you, number ten was something that people don’t talk about quite as often in relation to sex.&nbsp;But that’s Exercise.&nbsp;</p><p>&nbsp;</p><p>We know that exercise is great for you overall. It helps reduce stress, helps you feel great, helps you maybe lose some weight. But ultimately, exercise has also been linked with increased sexual arousal.&nbsp;&nbsp;</p><p>&nbsp;</p><p>That can be with things like walking, swimming, yoga, strength training. All those things have been looked at to increase sexual arousal. In fact, in one study, they found that people who engaged in intense exercise ended up having stronger orgasms later.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And so, overall, exercise can be a great way to get you ready. So you want to try again, relaxing, like I mentioned earlier, go to the gym first for 20 minutes. Come home, take a shower together, and see where it leads you.&nbsp;&nbsp;</p><p>&nbsp;</p><p>All right? I hope you guys enjoyed this article. As always,&nbsp;take care of yourself.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}