{"pageProps":{"article":[{"id":29,"attributes":{"title":"Is there any Scientific way to increase Penis length? A Urologist Explains","slug":"is-there-any-scientific-way-to-increase-penis-length-a-urologist-explains","createdAt":"2023-02-18T23:51:43.520Z","updatedAt":"2023-02-28T07:49:25.771Z","publishedAt":"2023-02-18T23:51:45.130Z","img":"https://images.pexels.com/photos/6376298/pexels-photo-6376298.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"The number one question I get on my social media is how can I get bigger? How can I get longer? Or how can I get more girth? Well, today I am going to address those questions and give you the evidence behind penile lengthening treatments.  \n\n\n\nSo did you guys know that they did a survey of 50,000 heterosexual men? And what they found was that 55% of them were unhappy with the way their penis looked when they asked those men’s partners, 85% of women were satisfied with the way their partner’s genitals looked.  \n\n\n\nBut at the end of the day, it matters how you feel about your appearance. But there’s a lot of issues with that because pornography has really blurred the lines of what exactly is normal. So I made a article previously talking about the average penal length and average penal length, if you look at all the data, approximately the average penal length is about 5.2 inches or 13.2 cm. \n\n \n\nIt’s normal for penal length to be within two and a half standard deviations of that, so either greater or smaller. And so what’s considered abnormal in terms of length being too short would be anything less than 2.9 inches or 7.5 centimeters. And that’s called micro penis. \n\n\n\nMicro penis is prevalent in less than 1% actually 0.14% of the population. So it’s extremely rare. It can be due to several causes, which can include congenital abnormalities, hormonal abnormalities, previous surgeries, or cancer.  \n\n\n\nBut today we’re going to talk about people who have a normal penile length. \n\n\n\nSo while it is true that the large majority of people who are concerned with the size of their penis have a normal penal length based on these numbers, the true issue is that a significant portion of men can have distress related to the idea that their penis is not as long as they desire.  \n\n\n\nAnd this is a form of body dysmorphic disorder, actually has a term, it’s called small penis anxiety. Doesn’t mean that they have a small penis, but they have anxiety related to the fact that they believe that the size of their penis is not long enough.  ","tags":["penile lenth"],"readTime":9,"dataSources":["https://www.sciencedirect.com/science/article/abs/pii/S2050052119300125?via%3Dihub"],"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":29,"content":"<p data-pm-slice=\"0 0 []\">The number one question I get on my social media is how can I get bigger? How can I get longer? Or how can I get more girth? Well, today I am going to address those questions and give you the evidence behind penile lengthening treatments.&nbsp;&nbsp;</p><p data-pm-slice=\"0 0 []\">&nbsp;</p><p>So did you guys know that they did a survey of 50,000 heterosexual men? And what they found was that 55% of them were unhappy with the way their penis looked when they asked those men’s partners, 85% of women were satisfied with the way their partner’s genitals looked.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But at the end of the day, it matters how you feel about your appearance. But there’s a lot of issues with that because pornography has really blurred the lines of what exactly is normal. So I made a article&nbsp;previously talking about the average penile length and average penal length, if you look at all the data, approximately the average penal length is about 5.2 inches or 13.2 cm.&nbsp;</p><p>&nbsp;</p><p>It’s normal for penile length to be within two and a half standard deviations of that, so either greater or smaller. And so what’s considered abnormal in terms of length being too short would be anything less than 2.9 inches or 7.5&nbsp;centimeters.&nbsp;And that’s called micro penis.&nbsp;</p><p>&nbsp;</p><p>Micro penis is prevalent in less than 1% actually 0.14% of the population. So it’s extremely rare. It can be due to several causes, which can include congenital abnormalities, hormonal abnormalities, previous surgeries, or cancer.&nbsp;&nbsp;</p><p>&nbsp;</p><p>But today we’re going to talk about people who have a normal penile length.&nbsp;</p><p>&nbsp;</p><p>So while it is true that the large majority of people who are concerned with the size of their penis have a normal penile length based on these numbers, the true issue is that a significant portion of men can have distress related to the idea that their penis is not as long as they desire.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And this is a form of body dysmorphic disorder, actually has a term, it’s called small penis anxiety. Doesn’t mean that they have a small penis, but they have anxiety related to the fact that they believe that the size of their penis is not long enough.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And the way this is defined is that people have a preoccupation or obsession of the size of their penis, which they spend over 1 hour a day thinking about this. And actually some portion of these men can be so distraught that it can affect their activities of daily living and some of them can end up in the hospital due to their overwhelming obsession or even have suicidal ideation.&nbsp;&nbsp;</p><p>&nbsp;</p><p>This is not a joke. This is serious. This can have real serious complications for people. And so I think it’s important to talk about this because this is part of men’s health. The other major issue with this problem is that if you google how am I going to make my penis longer?&nbsp;</p><p>&nbsp;</p><p>You’ll be inundated with tons and tons of websites and information that may or may not be reputable. Many people will go abroad or find non licensed providers to do things to them that can have dramatic consequences.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So please don’t do that. Look for a reputable urologist psychologist to help you with these issues. I will also preface the rest of the information that I’m going to share on this article&nbsp;by telling you that the Sexual medicine society of North America states that procedures for penile lengthening or girth enhancement are not recommended and considered experimental unless they are in context of someone who has a micropenis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So the things I’m about to tell you are. The literature for urology and have some data to support them. However, before doing any of these things, please establish care with an urologist who is familiar with these things.&nbsp;&nbsp;</p><p>&nbsp;</p><p>As a caveat, I do not discuss or offer treatment for penile lengthening in my practice, but because this is such an important topic, I went ahead and did the research for you guys. There are two categories of treatment options available to people who suffer from small penis anxiety or distress due to the belief that their penis is smaller than normal.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And for those people, there are nonsurgical treatments and there are surgical options that are reported in the literature.&nbsp;</p><p>&nbsp;</p><p>Starting off with nonsurgical treatments.&nbsp;</p><p>&nbsp;</p><p><strong>Psychological counseling</strong></p><p>&nbsp;</p><p>So there are validated measures and questionnaires and assessments that can be done to help you understand what normal penile size is and also help you deal with some of these anxious feelings.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Interestingly, when you look at people who’ve undergone just psychological counseling and nothing else, the large majority of men no longer want to look for any other treatment, whether it’s nonsurgical or surgical, to enhance the length of their penis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So this is big. I would recommend anyone who’s suffering from anxiety to please seek out psychologic care to help you with this anxiety.&nbsp;</p><p>&nbsp;</p><p>There are three other nonsurgical options.&nbsp;</p><ol><li><p><strong>Penile extenders,&nbsp;</strong></p><p>&nbsp;</p></li><li><p><strong>Vacuum Erection Devices,&nbsp;</strong></p><p>&nbsp;</p></li><li><p><strong>Penile Injectable Treatments.</strong>&nbsp;&nbsp;</p><p>&nbsp;</p></li></ol><p>The only one of these three that has any data to suggest it actually results in penile enhancement, as in length is specifically penal extenders. And penal extenders are essentially a device that has a hole in which you put the penis as well as two metal rods on either side and then a silicone circle at the end to hold the glands in place, and it slowly and mechanically applies traction to the penis to provide length.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And it does this over a course of many months and with a lot of time dedicated to it in each day.&nbsp;</p><p>&nbsp;</p><p>And when you look at the data, people who religiously used these penile traction devices actually did gain some length on their penis and they measured their penile length by a flaccid length as well as a flaccid stretch length.&nbsp;&nbsp;</p><p>&nbsp;</p><p>In urology, we use a flaccid stretch length to estimate the size of an erect penis. So the flacid stretch length has actually been compared to the erect length that has been shown to be very similar for measurement purposes.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So what was the end gain after months and months of daily use?&nbsp;</p><p>&nbsp;</p><p>About 2 cm.&nbsp;</p><p>&nbsp;</p><p>So there was a gain, however, it was very, very small. So you have to be extremely compliant. Do this daily for several hours a day to achieve the desired effect.&nbsp;</p><p>&nbsp;</p><p>Also, there are some complications.&nbsp;</p><p>&nbsp;</p><p>This can include numbness, bruising or overall, just lack of efficacy. You can spend a lot of time doing this and see no benefit.&nbsp;</p><p>&nbsp;</p><p>So this is the only thing that has been shown in the literature to have consistently good results with very low side effects.&nbsp;&nbsp;</p><p>&nbsp;</p><p>The other options, vacuum erection devices specifically, did not increase penile length at all.&nbsp;</p><p>&nbsp;</p><p>And lastly, penile injections. There are a number of different penile injections out there that have been tried, used, and many of them have had devastating complications.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So I do not recommend doing any penile injections. In fact, next week I’m going to be talking a little bit about the history of penile injections and what types of penile injections people have done with good results, bad results, results.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Again, right now, the data is not strong enough to recommend any sort of injection in the penis. And as I mentioned, you can have devastating complications up to 40 years after getting a penile injection.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So please do not inject anything into your penis.&nbsp;</p><p>&nbsp;</p><p>As far as surgical treatments, a lot of different surgical options have been discussed and written out in the literature. One of the most common ones is a suspension ligament incision.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And what that is the penis is held to the pubic bone, which is a bone right in front of your penis by a ligament. And by releasing that ligament, you can give a little bit more length to the penis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>However, this is not without complication. There are also a number of other techniques using different flaps, grafts and even using rib cartilage to help increase the length of your penis.&nbsp;</p><p>&nbsp;</p><p>And all of these overall have poor outcomes with poor satisfaction.&nbsp;&nbsp;</p><p>&nbsp;</p><p>The studies that have actually been able to give results on these particular surgeries have not been really rigorously reported. So at this time, we cannot recommend a surgery to increase your penile length that is not without a multitude of complications.&nbsp;&nbsp;</p><p>&nbsp;</p><p>The only time that you should proceed with any surgery for penile lengthening would be in the context of a clinical trial. And what is a clinical trial? Well, a clinical trial is one that is done at an institution where there is an institutional review board, or IRB.&nbsp;&nbsp;</p><p>&nbsp;</p><p>What that IRB&nbsp;does is, it makes sure that any study that is done in that institution is safe and ethical to be done on human patients. They also make sure that there is data monitoring and a way to report adverse events that occur during the trial on a regular basis so that things that happen because of the surgery are accurately documented.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And then those things are published in the literature so that you can get true, clear, and complete data from a study that’s being done on a certain type of surgery and so that we, as urologists, can say, okay,this has been done in 100 patients, and only ten of them had a complication, and that was minor.&nbsp;</p><p>&nbsp;</p><p>Compared to 20 of them had a horrible complication. And then, this is not safe for us to continue doing.&nbsp;And this is the way that we start looking at data scientifically to make sure that it has good outcomes and it’s safe for people to proceed with doing.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Bottom line, there’s not a lot you can do to change the length that you are given. You can gain a small amount of length with penile traction therapy, and that has been shown in the literature. However, there are many other things that are currently under investigation and are not recommended for routine care.&nbsp;&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>I think first and foremost is getting treatment under the care of a psychologist to deal with this anxiety before doing anything that may be irreversible and have you end up with something that is disfigured, not functional and worse than what you started off with.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Thank you so much for reading.&nbsp;</p><p>And always remember to take care of yourself.&nbsp;&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}