{"pageProps":{"article":[{"id":45,"attributes":{"title":"What your body goes through when you have an erection (it's interesting!)","slug":"what-your-body-goes-through-when-you-have-an-erection-it-s-interesting","createdAt":"2023-03-01T21:34:53.983Z","updatedAt":"2023-03-01T21:46:17.750Z","publishedAt":"2023-03-01T21:34:56.317Z","img":"https://images.pexels.com/photos/3773668/pexels-photo-3773668.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","metaDesc":"Although many erections are caused by sexual arousal, such as watching a sexy television show or fantasising, many erections appear to happen for no apparent reason.\n\nSo, if you had an erection in an unusual or embarrassing situation, such as the middle of a really boring history lesson, there's no need to worry.","tags":["erection"],"readTime":5,"dataSources":["https://onlinelibrary.wiley.com/doi/10.1002/ca.22655","https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8109295/"],"category":{"data":{"id":2,"attributes":{"title":"Health","slug":"health","createdAt":"2023-01-14T18:14:35.696Z","updatedAt":"2023-03-25T00:14:43.861Z","publishedAt":"2023-01-14T18:14:37.420Z","img":"https://images.freeimages.com/variants/r1kHNRt2vrPm4NK9McWGVTeZ/f4a36f6589a0e50e702740b15352bc00e4bfaf6f58bd4db850e167794d05993d"}}},"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}},"body":{"id":45,"content":"<h2 data-pm-slice=\"0 0 []\">What happens to your body when you get an erection?&nbsp;</h2><p data-pm-slice=\"0 0 []\">&nbsp;</p><p>So first off, in order to understand what happens in your body, you have to know the anatomy. So I wrote&nbsp;an article about male anatomy, so make sure you read that.&nbsp;</p><p>&nbsp;</p><h2>Anatomy of erections</h2><p>&nbsp;</p><p>Important to remember in the male anatomy is that you have two erectile bodies which are composed of spongy tissue called the Corpora Cavernosum. In the middle of each of these erectile bodies is a main artery that brings blood flow into these spongy like tissues.&nbsp;&nbsp;</p><p>&nbsp;</p><p><img class=\"image_resized\" style=\"width:75%;\" src=\"https://media.licdn.com/dms/image/C5612AQEFnuA8EfxPiA/article-cover_image-shrink_423_752/0/1520042984700?e=1683158400&amp;v=beta&amp;t=0i7sVF3OU_8LiFfqa948TWRL_5NjKsMdYVxFliL8cDE\"></p><p>&nbsp;</p><p>And above the two erectile bodies are veins that help bring blood to flow out. The first part of an erection is you hear something, see something, smell something, touch something that makes you aroused.&nbsp;And that sends signals to your brain.&nbsp;</p><p>&nbsp;</p><p>In the brain, particularly an area called the hypothalamus and that part of the brain releases several chemical messengers to the spinal cord and the pelvic nerves that stimulate the penis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>An example of this chemical messenger is oxytocin, which you may hear about all the time as a feel-good hormone. The nerves then release other messengers. And one of the main messengers is nitric oxide.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Nitric oxide</strong> is like the ignition for an erection. So with nitric oxide, this tells the body, hey, bring all the blood flow into the penis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So blood goes into the penis and engorges all that spongy tissue, which soaks up the blood like a sponge and enlarges and hardens. And remember, some of those veins are at the top, so when it enlarges and hardens,&nbsp;the veins get compressed so blood cannot leave the penis.&nbsp;So it&nbsp;stays firm and hard.&nbsp;</p><p>&nbsp;</p><p>In addition, if you’re going to engage in sexual activity, your body has a reflex called the Bulbocavernosus reflex, and this triggers the ischiocavernosus muscle, which is one of the pelvic floor muscles, to contract, and that also helps keep blood into the penis itself.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And lastly, the membrane of the Corpora Cavernosum, or the Tunica albuginea, is the the outer layer, also helps keep blood in those tissues. So during this time, the muscles in the penis are relaxed.&nbsp;&nbsp;</p><p>&nbsp;</p><p>When the erection is about to be reversed, the muscles contract, allowing blood to leave the penis, and then the erection goes away.&nbsp;</p><p>&nbsp;</p><h2>Why am I having issues with erections?&nbsp;Why do so many guys have them?&nbsp;</h2><p>&nbsp;</p><p>There’s actually six major causes of erectile dysfunction.&nbsp;</p><p>&nbsp;</p><p>Number one is psychogenic. I’ve written&nbsp;an article&nbsp;on psychogenic erectile dysfunction, but if you haven’t heard it before, the most powerful organ for sex is not the organ down there. It’s actually your brain.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So your brain can cause your penis not to function well. It’s really important to identify if that’s what’s going on with you, because that is correctable with the right support.&nbsp;</p><p>&nbsp;</p><p>The second cause is neurogenic.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So if something affects the nerves that go to the penis, sometimes we see this in spinal cord injury patients or patients who have had a prostatectomy. One component of normal erectile function is having normal levels of testosterone and also having other normal levels of hormones that do not affect testosterone.&nbsp;So if there’s any abnormality in testosterone or other hormones like prolactin, that can cause difficulties with erections.&nbsp;</p><p>&nbsp;</p><p><strong>The most common cause is vasculogenic.</strong>&nbsp;</p><p>&nbsp;</p><p>So I talk about this all the time, but this means that there is a blood flow problem to the penis, and this is most commonly due to things like high blood pressure, heart disease or diabetes.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Which is why I tell all patients who come in with erectile dysfunction to get some baseline blood work to check for their cholesterol levels,&nbsp;sugar levels and a&nbsp;hemoglobin A1C, which is a marker of how your blood sugars have been over the last three months.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Also, it’s important to see your doctor to get a cardiac evaluation and make sure you are not developing any abnormalities with your heart function.&nbsp;</p><p>&nbsp;</p><p>Then there’s also drug induced erectile dysfunction.&nbsp;&nbsp;</p><p>&nbsp;</p><p>So you can read a couple of my articles&nbsp;on how prostate medications as well as antidepressants can affect sexual function. Most commonly, they affect you by having low libido, but that can also affect erection.&nbsp;&nbsp;</p><p>&nbsp;</p><p>Certain blood pressure medications can also cause issues with erections, as well as excessive alcohol use and smoking. So, quit smoking if you’re smoking right now, if you want to keep having good erections.</p><p>&nbsp;&nbsp;</p><p>And the last cause of erectile dysfunction is other diseases and aging.&nbsp;</p><p>&nbsp;</p><p>And these basically cause a multifactorial effect on erection. So these usually cause both vascular problems. Just as you age, your vessels also age and nerve problems,&nbsp;that can be with both diabetes, which can cause both problems in those areas as well as with aging.&nbsp;</p><p>&nbsp;</p><h2>Deeper look at Erectile Dysfunction</h2><p>&nbsp;</p><p>The easiest way to think of it is there are three main things.&nbsp;</p><p>&nbsp;</p><p>One is your brain is not sending the right signals to your penis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And as I mentioned before, this is usually due to neurologic diseases like Parkinson’s, multiple sclerosis, spinal cord injury, those sorts of problems.&nbsp;</p><p>&nbsp;</p><p>Number two is blood flow is not going to the penis.&nbsp;&nbsp;</p><p>&nbsp;</p><p>And like I said before, this is from things like high blood pressure, diabetes, heart disease.&nbsp;</p><p>&nbsp;</p><p>And number three, your tissue actually has some damage to it.&nbsp;</p><p>&nbsp;</p><p>So this we see in men who’ve had trauma to the area if they’ve had certain things like Priapism or an erection that last longer than 4 hours, or if they have something like Peyronie’s disease where you see a curvature&nbsp;in&nbsp;the penis due to plaque formation.&nbsp;&nbsp;</p><p>&nbsp;</p><p>All right, so that’s everything you need to know about erections.&nbsp;</p><p>&nbsp;</p><p>And always remember to take care of yourself.&nbsp;</p><p>Thank you.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"}}}]},"__N_SSG":true}