{"pageProps":{"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    h2: \"h2\",\n    p: \"p\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.h2, {\n      children: \"Did you know that having a condition that affects your brain or spinal cord can actually affect the way your bladder functions? \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Neurogenic Bladder\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And today I’m going to talk about neurogenic bladder or essentially problems that affect the bladder due to neurologic conditions such as spinal cord injuries, strokes, diabetes and multiple sclerosis, Parkinson’s disease. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, to start off, when you think of the body, essentially parts of the brain, the spinal cord, all send nerves and signals to the bladder.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And when there’s any disruption in either the brain, the spinal cord, or the nerves that go to the bladder, it can cause problems with the way the bladder functions. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Neurogenic Bladder Anatomy\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When we think about problems with the bladder, there’s two ways to think about it.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"bladder Image here \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So here’s our bladder. It has two ureters right here, which are the tubes that drain the bladder as well as the bladder itself, and then the outlet or the urethra or p tube, where the urine comes from.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is obviously a female urethra, because a male urethra is much longer. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, you could think about it as a problem with the bladder or a problem with how the urine empties are what we call the outlet of urine. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You can have problems with the bladder itself, where either it doesn’t store urine well, meaning that urine is leaking out because the bladder is not able to hold urine well, or there’s a problem with failure to empty, meaning that the bladder is not squeezing to empty the bladder itself.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You can also have these same problems, but because of the outlet, it can be that the sphincter, which is inside the urethra that usually helps keep urine in when your bladder is filling and relaxing, when your bladder is peeing, is not functioning appropriately, or it’s very weak, or it can be failure to empty, meaning sphincter doesn’t relax when it should. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, like I said, when you’re peeing, the sphincter relaxes and it allows urine to empty out. And it really depends on what kind of injury you have if what problem will happen? Will it affect the bladder or the outlet? \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Most common neurologic conditions\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’m going to go over some of the most common conditions and what we often see as problems with these conditions. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"First type of neurologic conditions we think of is those that affect the brain.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It can be things like stroke, can be things like Parkinson’s disease, and can be things like trauma to the brain. If you’ve had a brain injury or even dementia. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In these patients, how I describe it to them is that typically our brain has a break. The break is on the bladder, so the bladder can fill and not contract. And when the bladder is full, it sends signals to the brain. The brake comes off, the bladder squeezes and it empties. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But the brake is broken because there’s a problem with the brain.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so now the bladder essentially squeezes before it’s full, giving you this constant urge to urinate. So you got to, got to go, got to go. You can’t make it to the bathroom and often you’re having leakage. Also, patients will experience frequency like needing to go to the bathroom very often and sometimes even at night. \"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"The next category of conditions is called spinal cord injury.\"\n      }), \" \"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And spinal cord injuries, it really depends where they are in the spinal cord.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Are they in the top part of the spinal cord, what we call supra sacral, or are they at the very low part of the spinal cord where they’re Infasacral. In those who have supra sacral injuries, we see patients who have issues with not only that bladder problem where they’re going very often because their bladder is squeezing before it’s ready.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But we also have a problem with the sphincter. The sphincter is often not relaxing in time when you need to empty. So they’ll feel a lot of urge to go but then they can’t empty because the sphincter doesn’t relax, it’s not coordinated with the brain.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And so this creates a lot a problem and in fact it’s quite dangerous because what happens is you’re getting all this pressure from the bladder squeezing and your sphincter is not opening. So where does that pressure go?  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, if you remember how the bladder is, it’s going to go up these tubes, up the ureters and they’re attached to the kidneys up here and so that can create long-term problems. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So if you have a spinal cord injury or something like multiple sclerosis, which can also present like this, very similar, and you’re having trouble emptying your bladder, it’s very important to see an urologist and get regular followup to make sure your kidneys are safe.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And lastly, sacral spinal cord injuries, these often present with bladders that actually don’t contract at all. So these bladders essentially don’t work at all. They’re just expanding so and expand like a balloon and they never contract.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So you can’t actually empty the urine very well. Sometimes, people who have this problem, particularly, actually diabetics, often can develop this problem after many, many years of having diabetes, can overcome it because they can bear down just like you’re having a bowel movement or having a poop when you push, you can sometimes empty urine that way. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But these people can also have a sphincter that doesn’t work. So now they have a bunch of urine and a sphincter that doesn’t relax, that’s fixed, and then you’re having trouble emptying your bladder.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And again, these people need to see an urologist regularly to get checked because again, you can have that same problem where the urine fills and fills and fills backs up to the ureters and causes problems with the kidney.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also, many people who have these issues can also get recurrent urinary tract infections. If you want to learn more about how to prevent recurrent urinary tract infections, check out my article on that as well. But this is a real problem and a huge quality of life issue. \"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Is it okay to have a neurogenic bladder?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All this to say is that depending on what you have, you may or may not follow the textbook. But certainly these can have serious implications for your bladder function.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"And it’s really important to see an urologist to discuss what type of neurogenic bladder you might have and how you can fix it and live a better quality of life, prevent infection and prevent problems to your kidneys.  \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Hope you guys found this helpful. As always, take care. \"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Thank you.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"title":"How can a back or brain injury permanently alter your bladder? | Neurogenic bladder types","metaDesc":"Did you know that having a condition that affects your brain or spinal cord can actually affect the way your bladder functions? \n\nNeurogenic Bladder\n\nAnd today I’m going to talk about neurogenic bladder or essentially problems that affect the bladder due to neurologic conditions such as spinal cord injuries, strokes, diabetes and multiple sclerosis, Parkinson’s disease. \n\nSo, to start off, when you think of the body, essentially parts of the brain, the spinal cord, all send nerves and signals to the bladder.  \n\nAnd when there’s any disruption in either the brain, the spinal cord, or the nerves that go to the bladder, it can cause problems with the way the bladder functions. \n\nNeurogenic Bladder Anatomy\n\nWhen we think about problems with the bladder, there’s two ways to think about it.  \n\nbladder Image here \n\nSo here’s our bladder. It has two ureters right here, which are the tubes that drain the bladder as well as the bladder itself, and then the outlet or the urethra or p tube, where the urine comes from.  \n\nThis is obviously a female urethra, because a male urethra is much longer. \n\nHowever, you could think about it as a problem with the bladder or a problem with how the urine empties are what we call the outlet of urine.  \n\nYou can have problems with the bladder itself, where either it doesn’t store urine well, meaning that urine is leaking out because the bladder is not able to hold urine well, or there’s a problem with failure to empty, meaning that the bladder is not squeezing to empty the bladder itself.  \n\nYou can also have these same problems, but because of the outlet, it can be that the sphincter, which is inside the urethra that usually helps keep urine in when your bladder is filling and relaxing, when your bladder is peeing, is not functioning appropriately, or it’s very weak, or it can be failure to empty, meaning sphincter doesn’t relax when it should. \n\nSo, like I said, when you’re peeing, the sphincter relaxes and it allows urine to empty out. And it really depends on what kind of injury you have if what problem will happen? Will it affect the bladder or the outlet? \n\nMost common neurologic conditions\n\nI’m going to go over some of the most common conditions and what we often see as problems with these conditions. \n\n First type of neurologic conditions we think of is those that affect the brain.  \n\nIt can be things like stroke, can be things like Parkinson’s disease, and can be things like trauma to the brain. If you’ve had a brain injury or even dementia. \n\nIn these patients, how I describe it to them is that typically our brain has a break. The break is on the bladder, so the bladder can fill and not contract. And when the bladder is full, it sends signals to the brain. The brake comes off, the bladder squeezes and it empties. \n\nBut the brake is broken because there’s a problem with the brain.  \n\nAnd so now the bladder essentially squeezes before it’s full, giving you this constant urge to urinate. So you got to, got to go, got to go. You can’t make it to the bathroom and often you’re having leakage. Also, patients will experience frequency like needing to go to the bathroom very often and sometimes even at night. \n\n The next category of conditions is called spinal cord injury. \n\nAnd spinal cord injuries, it really depends where they are in the spinal cord.  \n\nAre they in the top part of the spinal cord, what we call supra sacral, or are they at the very low part of the spinal cord where they’re Infasacral. In those who have supra sacral injuries, we see patients who have issues with not only that bladder problem where they’re going very often because their bladder is squeezing before it’s ready.  \n\nBut we also have a problem with the sphincter. The sphincter is often not relaxing in time when you need to empty. So they’ll feel a lot of urge to go but then they can’t empty because the sphincter doesn’t relax, it’s not coordinated with the brain.  \n\nAnd so this creates a lot a problem and in fact it’s quite dangerous because what happens is you’re getting all this pressure from the bladder squeezing and your sphincter is not opening. So where does that pressure go?  \n\nWell, if you remember how the bladder is, it’s going to go up these tubes, up the ureters and they’re attached to the kidneys up here and so that can create long-term problems. \n\nSo if you have a spinal cord injury or something like multiple sclerosis, which can also present like this, very similar, and you’re having trouble emptying your bladder, it’s very important to see an urologist and get regular followup to make sure your kidneys are safe.  \n\nAnd lastly, sacral spinal cord injuries, these often present with bladders that actually don’t contract at all. So these bladders essentially don’t work at all. They’re just expanding so and expand like a balloon and they never contract.  \n\nSo you can’t actually empty the urine very well. Sometimes, people who have this problem, particularly, actually diabetics, often can develop this problem after many, many years of having diabetes, can overcome it because they can bear down just like you’re having a bowel movement or having a poop when you push, you can sometimes empty urine that way. \n\nBut these people can also have a sphincter that doesn’t work. So now they have a bunch of urine and a sphincter that doesn’t relax, that’s fixed, and then you’re having trouble emptying your bladder.  \n\nAnd again, these people need to see an urologist regularly to get checked because again, you can have that same problem where the urine fills and fills and fills backs up to the ureters and causes problems with the kidney.  \n\nAlso, many people who have these issues can also get recurrent urinary tract infections. If you want to learn more about how to prevent recurrent urinary tract infections, check out my article on that as well. But this is a real problem and a huge quality of life issue. \n\nIs it okay to have a neurogenic bladder?\n\nAll this to say is that depending on what you have, you may or may not follow the textbook. But certainly these can have serious implications for your bladder function.  \n\nAnd it’s really important to see an urologist to discuss what type of neurogenic bladder you might have and how you can fix it and live a better quality of life, prevent infection and prevent problems to your kidneys.  \n","tags":["bladder"],"slug":"how-can-a-back-or-brain-injury-permanently-alter-your-bladder-neurogenic-bladder-types","readTime":5,"img":"https://images.pexels.com/photos/7430447/pexels-photo-7430447.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1","dataSources":null,"author":{"data":{"id":1,"attributes":{"username":"sarvesh","email":"sarvesh@gmail.com","provider":"local","confirmed":true,"blocked":false,"createdAt":"2023-01-10T18:16:01.442Z","updatedAt":"2023-01-31T01:13:02.561Z"}}}},"__N_SSG":true}